Repository: Acidburn0zzz/live-manual
Catalog: manual/old/*/manual.xml.po
Languages: fr

source: About this manual
fr: A propos de ce manuel

source: The main goal of this manual is to serve as a single access point to all documentation related to the Debian Live project. It does not include end-user documentation for using a Debian Live system.
fr: Le but principal de ce manuel est de servir de seul point d'entrée pour toute la documentation relative au projet Debian Live. Il n'inclut pas la documentation utilisateur final pour utiliser un système Debian Live.

source: Some of the commands mentioned in the text must be executed with superuser privileges which can be obtained by becoming the root user via <filename>su</filename> or by using <filename>sudo</filename>. To distinguish between commands which may be executed by an unprivileged user and those requiring superuser privileges, commands are prepended by <command>$</command> or <command>#</command> respectively. This symbol is not a part of the command.
fr: Quelques unes des commandes mentionnées dans le texte doivent être exécutées avec lesprivilèges du super-utilisateur, soit en devenant le root ou en utilisant <filename>sudo</filename> Pour distinguer entre les commandes qui doivent être exécutés par un utilisateur non priviligié et celles qui nécessitent les droits super-utilisateurs, les commandes sont préfixées par <computeroutput>$</computeroutput> ou <computeroutput>#</computeroutput>respectivement. Ce symbole ne fait pas parti de la commande.

source: Terms
fr: Définitions

source: Live system
fr: Système Live

source: An operating system that can boot without installation to a hard drive. Live systems do not alter local operating system(s) or file(s) already installed on the computer hard drive unless instructed to do so. Live systems are typically booted from media such as CDs or DVDs, some may also boot with USB sticks or over the network (via netboot images).
fr: Un système d'exploitatioin qui peut démarrer sans installation sur un disque dur.Un système live ne modifie pas les systèmes d'exploitation ou les fichiers précédemment installés sur le disque dur de l'ordinateur à moins de lui demander de la faire. Les systèmes live démarrent le plus souvent depuis un CD ou un DVD mais aussi depuis une clef USB et depuis le reséau.

source: The Debian sub-project which maintains the &live-helper; and &live-initramfs; utilities.
fr: Le sous projet Debian qui maintient les utilitaires &live-helper; et &live-initramfs;

source: Debian Live system
fr: Système Debian Live

source: A live system that uses software from the Debian operating system that may be booted from CDs, DVDs, USB sticks, over the network (via netboot images), and over the internet (via boot parameter fetch=URL)
fr: Un système Debian Live est un système live qui utilise des logiciels du système d'exploitation Debian

source: Build system / host system
fr: Système de construction / système hôte

source: The environment used to create the live system.
fr: L'environnement utilisé pour crée le système live.

source: A collection of scripts used to build customised Debian Live systems.
fr: Une collection de scripts utilisés pour construire des systèmes Debian Live personnalisés.

source: A collection of scripts used to boot live systems. &live-initramfs; is a fork of <filename>casper</filename> by Canonical, Ltd.
fr: Une collection de scripts utilisés pour démarrer un système live. &live-initramfs; est un fork de <filename>casper</filename> par Canonical, Ltd.

source: The former name of &live-helper;.
fr: L'ancien nom de &live-initramfs;.

source: Debian Installer / (d-i)
fr: Installeur Debian / (d-i)

source: Cheat codes
fr: Codes de triche

source: The chroot program, chroot(8), enables us to run different instances of the GNU/Linux environment on a single system simultaneously without rebooting.
fr: Le programme, chroot(8), permet d'exécuter différentes instances du système GNU/Linux simultanement sur une seule machine sans redémarrage.

source: binary image
fr: image binaire

source: On a live system, binary image refers to the binary filesystem and the respective extension, such as binary.iso or binary.img.
fr: Sur un système live, l'image binaire fait référence au système de fichiers binaire ainsi qu'à son extension, comme binary.iso ou binary.img.

source: Target distribution
fr: Distribution cible

source: &lenny;/&squeeze;/&sid; stable/testing/unstable
fr: etch/lenny/sid stable/testing/unstable

source: The "stable" distribution contains the latest officially released distribution of Debian. The "testing" distribution is the staging area for the next stable release a - the main advantage of using this distribution is that it has more recent versions of software relative to the "stable" release.. The "unstable" distribution is where active development of Debian occurs. Generally, this distribution is run by developers and those who like to live on the edge.
fr: La distribution "stable" contient la dernière version offcielle de Debian. La distributioin "testing" désigne la prochaine version stable -le principal interêt de cette distribution est de posséder des versions de logiciels plus récentes que ceux de la version stable. La distributin "unstable" désigne la distribution où se fait activement le développement de Debian. Généralement, cette distribution est utilisée par les développeurs et par ceux qui aiment vivre sur sur le fil.

source: At the time of writing, &lenny; is the current "stable" release and &squeeze; is the current "testing" release. &sid; will always be a synonym for the "unstable" release.
fr: Au moment de l'écriture de ce document, &lenny; est la version stable courante et &squeeze; est la version "testing" courante. &sid; sera toujours un synonyme pour la version "unstable".

source: Authors
fr: Auteurs

source: A list of authors (in alphabetical order):
fr: Une liste des auteurs (par ordre alphabétique):

source: Contributing to this document
fr: Contribuer à ce document

source: This manual is intended as a community project and all proposals for improvements and contributions are extremely welcome. The preferred way to submit a contribution is to send it to the mailing list. Please see <xref linkend="contact"/> for more information.
fr: Ce manuel a vocation à être un projet communautaire et toutes les propositions pour son amélioration et toutes les contibutions sont extrèmement bienvenues. Le moyen privilégié pour soumettre une contribution est de l'envoyer à la liste de diffusion. Voir svp <xref linkend="contact"/> pour plus d'informations.

source: When submitting a contribution please clearly identify its copyright holder and include the licensing statement. Note that to be accepted the contribution must be licensed under the same license as the rest of the document, namely GPL version 3 or later.
fr: Quand vous soumettez une contribution, identifier clairement.le détenteur du copyright et inclure le paragraphe de licence. Noter que pour être accepté, la contribution doit être sous la même licence que le reste du document, a savoir GPL version 3 ou supérieure.

source: The sources for this manual are maintained using the Git version control system. You can checkout the latest copy by executing:
fr: Les sources de ce manuel sont maintenues via le système de contrôle de version Git. Vous pouvez obtenir la dernière copie en exécutant:

source: Prior to submission of your contribution, please preview your work. To preview the live-manual, ensure the packages needed for building are installed by executing:
fr: Avant de soumettre votre contribution, reliser, svp, votre travail. Pour avoir un aperçu du manuel live, assurez-vous que les paquets suivants sont installés sur votre système en exécutant:

source: You may build the live-manual from the top level directory of your git checkout by executing:
fr: Vous devriez pouvoir construire le manuel depuis le répertoire racine de votre copie locale du git en exécutant:
