Repository: Acidburn0zzz/live-manual
Catalog: manual/old/*/packages.xml.po
Languages: fr

source: Customising package installation
fr: Installation personnalisée des paquets

source: This chapter discusses the customisation of package installation. This involves:
fr: Ce chapitre décrit comment personnaliser l'installation des paquets. Cela implique :

source: Selecting additional packages to be installed
fr: La sélection de paquets additionnels à installer

source: Installing modified packages
fr: L'installation de paquets modifiés

source: Package sources
fr: Les sources des paquets

source: Package installation
fr: L'installation des paquets

source: You can elect to use either <command>apt</command> or <command>aptitude</command> when installing packages. Which utility is used is governed by the <command>LH_APT</command> variable in <filename>config/chroot</filename> or by the <command>--apt</command> argument to <filename>lh_config</filename>:
fr: Vous pouvez choisir d'utiliser <command>apt</command> ou <command>aptitude</command> pour installer les paquets. Ce choix est paramétré par la variable <command>LH_APT</command> dans <filename>config/chroot</filename>, ou par l'argument <command>--apt</command> dans <filename>lh_config</filename>:

source: Specifying a missing package causes package installation to fail, which may not be the desired behaviour.
fr: La spécification d'un paquet manquant causera une erreur à l'installation et risque d'entraîner un comportement non-désiré du système.

source: This is the default setting for building images for Lenny or later.
fr: C'est le réglage par défaut lors de la création d'images pour Lenny et les versions suivantes.

source: Specifying a missing package causes package installation to succeed, which may not be the desired behaviour.
fr: La spécification d'un paquet manquant ne causera pas d'erreur à l'installation et risque d'entraîner un comportement non-désiré du système.

source: This is the default setting for building images for Etch.
fr: C'est le réglage par défaut lors de la création d'images pour Lenny.

source: Installing additional packages
fr: Installer des paquets supplémentaires

source: &live-helper; has a number of mechanisms for indicating that additional packages should be installed, including:
fr: &live-helper; possède un certain nombre de fonctionnalités permettant d'indiquer si des paquets supplémentaires doivent être installés, incluant :

source: The <command>LH_PACKAGES</command> variable
fr: La variable <command>LH_PACKAGES</command>

source: Package lists
fr: Les listes de paquets

source: Local packages (<filename>chroot_local-packages/</filename>)
fr: Les paquets locaux (<filename>chroot_local-packages/</filename>)

source: Tasks
fr: Les tâches

source: To install additional packages, simply add them to the <command>LH_PACKAGES</command> variable in <filename>config/chroot</filename>. For example:
fr: Pour installer des paquets supplémentaires, il suffit de les ajouter à la variable <command>LH_PACKAGES</command> dans <filename>config/chroot</filename>. Par exemple :

source: You can also specify an initial values on the command line:
fr: Il est également possible de spécifier une valeur initiale sur la ligne de commande :

source: The behaviour of &live-helper; when specifying a package that does not exist is determined by your choice of APT utility. See <xref linkend="package-installation"/> for more details.
fr: Le comportement de &live-helper; lors de la spécification d'un paquet inexistant dépend de l'utilitaire APT choisi. Voir <xref linkend="package-installation"/> pour plus de détails.

source: If you need to specify a large number of packages to be installed or you need flexibility regarding which packages to install, you should probably be using package lists. See <xref linkend="package-lists"/> for more information.
fr: Si vous désirez spécifier un grand nombre de paquets à installer, ou que vous désirez plus de flexibilité dans le choix des paquets, vous devriez sans doutes utiliser les listes de paquets. Voir <xref linkend="package-lists"/> pour plus d'informations.

source: Package lists are a powerful way of expressing which packages should be installed. &live-helper; ships with a number of predefined package lists which provide sensible default package selections for the GNOME and KDE desktop environments, as well as standard systems.
fr: Les listes de paquets représentent un moyen très puissant de choisir les paquets à installer. Avec &live-helper; sont fournies un grand nombre de listes de paquets prédéfinies, proposant des sélections de paquets par défaut pour les environnements de bureau GNOME et KDE, ainsi que pour les systèmes standards.

source: To specify a package list, add the name of the list to the <command>LH_PACKAGES_LISTS</command> variable in <filename>config/chroot</filename>. For example:
fr: Pour spécifier une liste de paquets, ajoutez le nom de cette liste à la variable<command>LH_PACKAGES_LISTS</command> dans <filename>config/chroot</filename>. Par exemple :

source: Packages lists that a distributed with &live-helper; reside in view in the <command>/usr/share/live-helper/lists</command> directory.
fr: Les listes de paquets distribuées avec &live-helper; résident dans le répertoire <command>/usr/share/live-helper/lists</command>.

source: Local packages lists
fr: Listes de paquets locaux

source: You may supplement the supplied lists using local package lists stored in <command>config/chroot_local-packageslists</command>.
fr: Vous pouvez ajouter des listes de paquets locaux aux listes par défaut en les insérant dans <command>config/chroot_local-packageslists</command>.

source: Package lists that exist in this directory always override package lists distributed with &live-helper;. This can cause undesired effects when..
fr: Les listes de paquets présentes dans ce répertoire ont systématiquement préséance sur celles fournies avec &live-helper; Ceci peut entraîner des effets non-désirés lorsque..

source: Extending a provided package list using includes
fr: Extension d'une liste de paquets grâce aux "includes"

source: The package lists that are included with &live-helper; make extensive use of includes. They are available to view in the <command>/usr/share/live-helper/lists</command> directory.
fr: Les listes de paquets fournies avec &live-helper; font un usage intensif des "includes". Elles sont disponibles dans le répertoire <command>/usr/share/live-helper/lists</command>

source: Using conditionals inside packages lists
fr: Utilisation de tests dans les listes de paquets

source: or if <command>LH_ARCHITECTURE</command> is set to <command>i386</command> or <command>amd64</command>:
fr: ou si la variable <command>LH_ARCHITECTURE</command> est positionnée sur <command>i386</command> ou <command>amd64</command>:

source: or if <command>LH_SECTIONS</command> contains either <command>contrib</command> or <command>non-free</command>:
fr: ou si la variable <command>LH_SECTIONS</command> contient soit <command>contrib</command>, soit <command>non-free</command>:

source: A conditional may surround an <command>#include</command> directive:
fr: Un test peut encadrer une directive <command>#include</command> :

source: Any &live-helper; configuration variable that begins with <command>LH_</command> can be tested in this way.
fr: Toute variable de configuration de &live-helper; qui commence par <command>LH_</command> peut être testée de cette manière.

source: The nesting of conditionals is not supported.
fr: L'imbrication de tests n'est pas supportée.

source: Installing modified or third-party packages
fr: Installation de paquets modifiés ou de tierce partie

source: Whilst it is against the philosophy of Debian Live, it may sometimes be necessary to build a Live system with modified versions of packages that are in the Debian repository. This may be to modify or support additional features, languages and branding, or even to remove elements of existing packages that are undesirable. Similarly, "third-party" packages may be used to add bespoke and/or proprietary functionality.
fr: Bien que cela aille à l'encontre de la philosophie Debian Live, il peut s'avérer nécessaire de construire un système Live avec des versions modifiées de paquets présents sur le dépôt Debian, ceci afin de modifier ou apporter des fonctionnalités supplémentaires, des supports linguistiques, ou encore pour supprimer des éléments de paquets indésirables. De même, les paquets de "tierce partie" peuvent servir à ajouter des fonctionnalités "sur demande" et/ou propriétaires.

source: This section does not cover advice regarding building or maintaining modified packages. Joachim Breitner's <ulink url="http://www.joachim-breitner.de/blog/archives/282-How-to-fork-privately.html">'How to fork privately'</ulink> may be of interest, however. The creation of bespoke packages is covered in the <ulink url="http://www.debian.org/doc/maint-guide/">Debian New Maintainers' Guide</ulink> and elsewhere.
fr: Cette section ne fournit pas d'aide sur la construction et la maintenance de paquets modifiés. L'article de Joachim Breitner <ulink url="http://www.joachim-breitner.de/blog/archives/282-How-to-fork-privately.html">'How to fork privately'</ulink> peut cependant vous intéresser. La création de paquets "sur mesure" est décrite, entre autres, à l'adresse <ulink url="http://www.debian.org/doc/maint-guide/">Debian New Maintainers' Guide</ulink>.

source: There are two ways of installing modified custom packages:
fr: Il y a deux manières d'installer des paquets modifiés :

source: Using a custom APT repository
fr: Utilisation d'un dépôt APT "custom"

source: The <filename>chroot_local-packages</filename> is simpler to achieve and useful for "one-off" customisations but has a number of drawbacks, whilst using a custom APT repository is more time-consuming to setup.
fr: Il est plus simple d'utiliser <filename>chroot_local-packages</filename> pour une customisation rapide, au prix de certains inconvénients, tandis que l'utilisation d'un dépôt APT spécifique prend plus de temps à mettre en place.

source: Using <filename>chroot_local-packages</filename> to install custom packages
fr: Utilistation de <filename>chroot_local-packages</filename> pour installer des paquets modifiés

source: To install a custom package, simply copy it to the <command>config/chroot_local-packages</command> directory. Packages that are inside this directory will be automatically installed into the live system during build - you do not need to specify them elsewhere.
fr: Pour installer un paquet modifié, il suffit de le placer dans le répertoire <command>config/chroot_local-packages</command>. Les paquets présents dans ce répertoire seront automatiquement installés à la construction du système live. Il n'est pas nécessaire de les spécifier ailleurs.

source: Packages <emphasis>must</emphasis> be named in the prescribed way. One simple way to is to use <command>dpkg-name</command>. FIXME
fr: Les paquets <emphasis>doivent</emphasis> être nommés de la façon décrite. Le plus simple est d'utiliser <command>dpkg-name</command>. À corriger

source: Using <filename>chroot_local-packages</filename> for installation of custom packages has two disadvantages:
fr: L'utilisation de <filename>chroot_local-packages</filename> lors de l'installation de paquets modifiés présente deux inconvénients :

source: It is not possible to use secure APT
fr: Il n'est pas possible d'utiliser APT de façon sécurisée

source: You must install all appropriate packages in the <command>config/chroot_local-packages</command> directory
fr: Il est nécessaire d'installer tous les paquets appropriés dans le répertoire <command>config/chroot_local-packages</command>

source: Does not lend itself to storing Debian Live configurations in revision control
fr: Ça ne se prête pas à l'enregistrement de configurations Debian Live lors de contrôles de révisions

source: Using an APT repository to install custom packages
fr: Utilisation de répertoires APT pour installer des paquets modifiés

source: Unlike You must ensure that you specify the package elsewhere, see (FIXME)
fr: Il faut s'assurer de bien spécifier le paquet ailleurs. Voir (à corriger)

source: Whilst it may seem unnecessary effort to create an APT repository to install custom packages, the infrastructure can be easily re-used at a later date to offer updates of the modified package.
fr: Bien que la création d'un dépôt APT paraisse superflue pour installer des paquets modifiés, une telle infrastructure peut aisément être réutilisée afin d'offrir ultérieurement des mises à jour des paquets modifiés.

source: Custom packages and APT
fr: APT et paquets modifiés

source: &live-helper; uses APT to install all packages into the live system so will therefore inherit behaviours from this program. One relevant example is that (assuming a default configuration) given a package is available in two different repositories, APT will elect to install the package with a higher version number over one with the lower.
fr: &live-helper; fait appel à APT pour installer tous les paquets sur le système live, et hérite donc des comportements de ce programme. Pour donner un exemple pertinent, avec une configuration par défaut, si un paquet est disponible dans deux dépôts différents, APT choisira d'installer le paquet dont le numéro de version est le plus élevé.

source: Because of this. you may wish to increment the version number in your custom packages' <command>debian/changelog</command> files to ensure that your modified version is installed over one in the official Debian repositories. This may also be achieved by altering the live system's APT pinning preferences - see <xref linkend="apt-preferences"/> for more information.
fr: Pour ces raisons, vous pouvez choisir d'incrémenter les numéros de version dans les fichiers <command>debian/changelog</command> de vos paquets modifiés afin de vous assurer qu'ils soient installés plutôt que les versions des dépôts Debian officiels. Vous pouvez également modifier les préférences de priorité APT du système live. Voir <xref linkend="apt-preferences"/> pour de plus amples informations

source: Altering APT preferences during Live system
fr: Modification des préférences APT lors d'une session Live
