Repository: Acidburn0zzz/live-manual
Catalog: manual/old/*/project.xml.po
Languages: fr

source: About the Debian Live Project
fr: À propos du projet Debian Live

source: What is wrong with current live systems
fr: Le problème des systèmes live actuels

source: There are already several Debian-based live systems and they are doing a great job. But from the Debian perspective most of them have one or more of the following disadvantages:
fr: Il existe actuellement plusieurs systèmes live basés sur Debian, et qui font du très bon travail. Mais du point de vue Debian, la plupart d'entre eux présente au moins l'un des inconvénients suivants :

source: They are unofficial projects, developed outside of Debian.
fr: Ce sont des projets officieux, développés en marge de Debian.

source: They mix different distributions, e.g. testing and unstable.
fr: Ils mélangent plusieurs distributions (par exemple, testing et unstable).

source: They support i386 only.
fr: Seules les architectures i386 sont supportées.

source: They modify the behaviour and/or appearance of packages by stripping them down to save space.
fr: Ils modifient le comportement et/ou l'apparence des paquets en les réduisant pour récupérer de l'espace.

source: They include unofficial packages.
fr: Ils incluent des paquets officieux.

source: They ship custom kernels with additional patches that are not part of Debian.
fr: Ils fournissent des noyaux customisés et des patches non-supportés par Debian.

source: They are large and slow due to their sheer size and thus not suitable for rescue issues.
fr: Ils sont gros et lents du simple fait de leur taille, et donc inadaptés aux problèmes de récupération du système.

source: They are not available in different flavours, e.g. CDs, DVDs, USB-stick and netboot images
fr: Il n'y a pas de choix de support d'installation (CD, DVD, clé USB, boot réseau...)

source: Why create our own live system?
fr: Pourquoi créer notre propre système live?

source: Debian is the Universal Operating System: Debian should have an official live system for showing around and to officially represent the true, one and only Debian system with the following main advantages:
fr: Debian est l'OS universel : Debian se doit de posséder un système live officiel, afin de représenter le seul, le vrai et l'unique système Debian, avec ces avantages :

source: It would be an official Debian subproject.
fr: Un sous-projet Debian officiel,

source: It reflects the (current) state of one distribution.
fr: qui reflète l'état courant d'une distribution,

source: It runs on as many architectures as possible.
fr: qui fonctionne sur autant d'architectures que possible

source: It consists of unchanged Debian packages only.
fr: qui est constitué uniquement de paquets Debian non-altérés

source: It does not contain any unofficial packages.
fr: qui ne contient aucun paquet officieux

source: It uses an unaltered Debian kernel-image with no additional patches.
fr: qui utilise une image du noyau inaltérée et sans patches.

source: Philosophy
fr: Philosophie

source: Only unchanged, official packages
fr: Uniquement des paquets officiels et inchangés

source: We will only use official packages from the Debian repository in the "main" section (possibly contrib, although not decided yet). The non-free section is not part of Debian and therefore cannot be used at all for live systems.
fr: Nous n'utiliserons que des paquets officiels de la section "main" des dépôts Debian ( et peut-être de "contrib", cela reste à décider). La section "non-free" ne fait pas partie de Debian, et est par conséquent inutilisable pour les systèmes live.

source: We will not change any packages. Whenever we need to change something, we will do that in coordination with its package maintainer in Debian.
fr: Aucun paquet ne sera modifié. Si des modifications s'imposent, elles seront faites en collaboration avec les mainteneurs de paquets Debian.

source: As an exception, our own packages such as &live-helper; or &live-initramfs; may temporarily be used from our own repository for development reasons (e.g. to create development snapshots). They will be uploaded to Debian on a regular basis.
fr: Exceptionnellement, nous utiliserons temporairement certains paquets (tels que &live-helper;·et·&live-initramfs;)·de nos propres dépôts à des fins de développement. Ceux-ci seront régulièrement transférés à Debian.

source: No package configuration of the live system
fr: Pas de configuration des paquets du système live.

source: In this phase we will not ship or install sample or alternative configurations. All packages are used in their default configuration as they are after a regular installation of Debian.
fr: Lors de cette phase, nous ne fournirons ni n'installerons pas de configuration alternative. Tous les paquets sont utilisés dans leur configuration d'origine, tels qu'ils le sont après une installation Debian classique.

source: Whenever we need a different default configuration, we will do that in coordination with its package maintainer in Debian.
fr: Si une modification de la configuration par défaut s'avère nécessaire, elle sera faite en coordination avec le mainteneur de paquets Debian.

source: A system for configuring packages is provided using debconf in lh_config (use --preseed FILE) allowing custom configured packages to be installed in your custom produced Debian Live images, but for official live images only default configuration will be used. For more information, please see <xref linkend="customization"/>.
fr: Un système de configuration des paquets basé sur debconf est fourni dans lh_config (usage : --preseed FICHIER). Il permet une configuration spécifique des paquets pour être installés par des images live Debian "custom", mais seules les configurations par défaut seront utilisées dans les images live officielles. Pour plus d'informations, reportez-vous à <xref linkend="customization"/>.

source: Exception: There are a few essential changes needed to be make a live system alive (e.g. configuring pam to allow empty passwords). These essential changes have to be kept as minimal as possible and, should be merged within the Debian repository if possible.
fr: Une exception: quelques modifications essentielles sont nécessaires pour rendre un système live utilisable (par exemple, configurer pam afin qu'il autorise les mots de passe vides). Ces changements doivent rester aussi minimes que possible, et devrait être si possible intégrés au dépôt Debian.

source: No live system to hard disk installer for etch
fr: Pas d'installeur dans la version etch.

source: Title says it all.
fr: Tout est dans le titre.

source: Live system to hard disk installer
fr: Installation sur le disque dur

source: For the moment we will not ship an installer to copy the live system to a partition on the hard disk. Although we keep the changes in the live system as drastically minimal as possible compared to a regular Debian installation, the live system does differ in a few essential points (see exceptions, guideline 2).
fr: Pour l'instant,nous ne fournirons pas d'installeur pour copier le système live sur une partition de disque dur. Bien que nous nous efforcions de modifier le moins possible le système live, comparé à une installation Debian classique, ceux-ci diffèrent en quelques points essentiels (voir exceptions, guideline 2).

source: Therefore, we will ship a copy of the regular DebianInstaller (resp. Debian Installer, Graphical Installer) instead, to allow users to perform a regular Debian installation (and, of course, cdebootstrap and debootstrap are on the system too).
fr: Par conséquent, nous fournirons à la place une copie de l'installeur Debian (resp.·Debian·Installer,·Graphical·Installer), afin de permettre aux utilisateurs d'effectuer une installation classique. Et bien sûr, cdebootstrap et·debootstrap sont présents sur le système.

source: Mailing list
fr: Liste de diffusion

source: The primary contact for the project is the <ulink url="http://lists.debian.org/debian-live/">mailing list</ulink>. You can email the list directly by addressing your mail to <email>debian-live@lists.debian.org</email>. The <ulink url="http://lists.debian.org/debian-live/">list archives</ulink> are also available.
fr: Rejoignez la <ulink url="http://lists.debian.org/debian-live/">liste de diffusion</ulink> du projet, ou écrivez directement à <email>debian-live@lists.debian.org</email>. Vous pouvez également consulter les <ulink url="http://lists.debian.org/debian-live/">archives</ulink>

source: A number of users and developers are present in the <ulink url="irc://irc.debian.org/#debian-live">#debian-live</ulink> channel on <ulink url="http://oftc.net">OFTC</ulink>. When asking a question on IRC, please be patient for an answer. If no answer is forthcoming, please email the mailing list.
fr: Des utilisateurs et développeurs sont présents sur le canal <ulink url="irc://irc.debian.org/#debian-live">#debian-live</ulink>·sur·<ulink url="http://oftc.net">OFTC</ulink>. Merci d'être patient lorsque vous posez des questions sur l'IRC. Si aucune réponse ne vous parvient, postez votre message sur la liste de diffusion.

source: The Debian Bug Tracking System (BTS) contains details of bugs reported by users and developers. Each bug is given a number, and is kept on file until it is marked as having been dealt with. For more information, please see <xref linkend="bugs"/>.
fr: Le Système de Suivi de Bugs Debian (Debian·Bug·Tracking·System·- BTS) détaille les bugs rapportés par les utilisateurs et les développeurs. Chaque bug reçoit un numéro et est répertorié jusqu'à ce qu'il soit marqué comme résolu. Pour plus d'informations, voir <xref linkend="bugs"/>.

source: The <ulink url="http://wiki.debian.org/DebianLive">Debian Live wiki</ulink> is a place to gather information, discuss applied technologies, and document frameworks of Debian Live systems that go beyond the scope of this document.
fr: Au-delà de cette documentation, vous pouvez trouver plus d'informations, discuter des nouvelles technologies et vous documenter sur les systèmes live Debian sur <ulink url="http://wiki.debian.org/DebianLive">wiki Debian Live</ulink>
