Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/about_project.ssi.po
Languages: fr

source: :B~ About the Debian Live Project
fr: :B~ À propos du projet Debian Live

source: 1~about-project About the Debian Live Project
fr: 1~about-project À propos du projet Debian Live

source: 3~ What is wrong with current live systems
fr: 3~ Quel est le problème avec les systèmes live actuels

source: When Debian Live was initiated, there were already several Debian based live systems available and they are doing a great job. From the Debian perspective most of them have one or more of the following disadvantages:
fr: Lorsque Debian Live a été lancé, il y avait déjà plusieurs systèmes live basés sur debian et ils faisaient un excellent travail. Du point de vue de Debian la plupart d'entre eux ont un ou plusieurs des inconvénients suivants:

source: _* They are unofficial projects, developed outside of Debian.
fr: _* Ce sont des projets non officiels, développées en dehors de Debian.

source: _* They mix different distributions, e.g. *{testing}* and *{unstable}*.
fr: _* Ils mélangent les différentes distributions p. ex *{testing}* et *{unstable}*.

source: _* They support i386 only.
fr: _* Ils supportent seulement i386.

source: _* They modify the behaviour and/or appearance of packages by stripping them down to save space.
fr: _* Ils modifient le comportement et/ou l'apparence des paquets en les dépouillant pour économiser l'espace.

source: _* They include unofficial packages.
fr: _* Ils incluent paquets non officiels.

source: _* They ship custom kernels with additional patches that are not part of Debian.
fr: _* Ils offrent kernels personnalisés avec des patches supplémentaires qui ne font pas partie de Debian.

source: _* They are large and slow due to their sheer size and thus not suitable for rescue issues.
fr: _* Ils sont grands et lents en raison de leur dimension et donc pas recommandés comme systémes de sauvetage.

source: _* They are not available in different flavours, e.g. CDs, DVDs, USB-stick and netboot images.
fr: _* Ils ne sont pas disponibles en différents formats, p. ex. CDs, DVDs, clés USB et images netboot.

source: 3~ Why create our own live system?
fr: 3~ Pourquoi créer notre propre système live?

source: Debian is the Universal Operating System: Debian has an official live system for showing around and to officially represent the true, one and only Debian system with the following main advantages:
fr: Debian est le système d'exploitation universel: Debian a un système officiel live pour afficher autour et pour représenter officiellement le vrai, seul et unique système Debian avec les principaux avantages suivants:

source: _* It would be an official Debian subproject.
fr: _* Ce serait un sous-projet officiel Debian.

source: _* It reflects the (current) state of one distribution.
fr: _* Il reflète l'état (actuel) d'une distribution.

source: _* It runs on as many architectures as possible.
fr: _* Il fonctionne sur le plus grand nombre d'architectures possible.

source: _* It consists of unchanged Debian packages only.
fr: _* Il seulement se compose de paquets Debian inchangés.

source: _* It does not contain any unofficial packages.
fr: _* Il ne contient pas de paquets non officiels.

source: _* It uses an unaltered Debian kernel with no additional patches.
fr: _* Il utilise un kernel Debian inchangé sans patches supplémentaires.

source: 2~ Philosophy
fr: 2~ Philosophie

source: 3~ Only unchanged, official packages
fr: 3~ Seulement paquets officiels inchangés

source: We will only use official packages from the Debian repository in the "main" section. The non-free section is not part of Debian and therefore cannot be used at all for official live system images.
fr: Nous seulement utiliserons les paquets officiels Debian du référentiel «main ». La section non-free ne fait pas partie de Debian et ne peut donc pas être utilisée pour les images officiels du système live.

source: We will not change any packages. Whenever we need to change something, we will do that in coordination with its package maintainer in Debian.
fr: Nous ne changerons pas les paquets. Chaque fois que nous avons besoin de changer quelque chose, nous le ferons en coordination avec le responsable du paquet dans Debian.

source: As an exception, our own packages such as live-boot, live-build or live-config may temporarily be used from our own repository for development reasons (e.g. to create development snapshots). They will be uploaded to Debian on a regular basis.
fr: À titre d'exception, nos propres paquets tels que live-boot, live-build ou live-config peuvent être utilisés temporairement à partir de notre propre référentiel pour raisons de développement (par exemple pour créer des instantanés de développement). Ils seront téléchargés sur Debian régulièrement.

source: 3~ No package configuration of the live system
fr: 3~ Pas de configuration des paquets du système live

source: In this phase we will not ship or install sample or alternative configurations. All packages are used in their default configuration as they are after a regular installation of Debian.
fr: Dans cette phase, nous n'offerons configurations alternatives. Tous les paquets sont utilisés dans leur configuration par défaut comme ils sont après une installation standard de Debian.

source: Whenever we need a different default configuration, we will do that in coordination with its package maintainer in Debian.
fr: Chaque fois que nous avons besoin d'une configuration par défaut différent, nous le ferons en coordination avec le responsable du paquet dans Debian.

source: A system for configuring packages is provided using debconf in #{lb config}# (use --preseed FILE) allowing custom configured packages to be installed in your custom produced Debian Live images, but for official live images only default configuration will be used. For more information, please see {Customization overview}#customization-overview.
fr: Un système de configuration des paquets est fourni avec debconf dans #{lb config}# (utiliser --preseed FICHIER) permettant la personnalisation des paquets installés sur votre image Debian Live, mais pour les images officielles seulement sera utilisé une configuration par défaut. Pour plus d'informations, s'il vous plaît voir {Vue d'ensemble de la personnalisation}#customization-overview.

source: Exception: There are a few essential changes needed to bring a live system to life (e.g. configuring pam to allow empty passwords). These essential changes have to be kept as minimal as possible and should be merged within the Debian repository if possible.
fr: Exception: Il y a quelques changements essentiels nécessaires pour mettre un système live en marche (par exemple la configuration de pam pour permettre des mots de passe vide). Ces changements essentiels doivent être maintenus aussi minimes que possible et devraient être fusionnées au sein du référentiel Debian s'il est possible.

source: _* *{Mailing list}*: The primary contact for the project is the mailing list at http://lists.debian.org/debian-live/. You can email the list directly by addressing your mail to debian-live@lists.debian.org. The list archives are available at http://lists.debian.org/debian-live/.
fr: _* *{Liste de diffusion}*: Le contact principal du projet est la liste de diffusion http://lists.debian.org/debian-live/. Vous pouvez envoyer un courriel à la liste directement en adressant votre courrier à debian-live@lists.debian.org. Les archives de la liste sont disponibles à http://lists.debian.org/debian-live/.

source: _* *{IRC}*: A number of users and developers are present in the #debian-live channel on irc.debian.org (OFTC). When asking a question on IRC, please be patient for an answer. If no answer is forthcoming, please email the mailing list.
fr: _* *{IRC}*: Un certain nombre d'utilisateurs et les développeurs sont présents dans le canal #debian-live sur irc.debian.org (OFTC). Quand vous posez une question sur IRC, s'il vous plaît soyez patient en attendant une réponse. Si aucune réponse n'est donnée, s'il vous plaît envoyez un courriel à la liste de diffusion.

source: _* *{BTS}*: The Debian Bug Tracking System (BTS) contains details of bugs reported by users and developers. Each bug is given a number, and is kept on file until it is marked as having been dealt with. For more information, please see {Reporting bugs}#bugs.
fr: _* *{BTS}*: Le Debian Bug Tracking System (BTS) contient les détails des bugs rapportés par les utilisateurs et les développeurs. Chaque bug reçoit un numéro, et il est conservé jusqu'à ce qu'il soit marqué comme traité. Pour plus d'informations, s'il vous plaît voir {Rapporter des bugs}#bugs.

source: _* *{Wiki}*: The Debian Live wiki at http://wiki.debian.org/DebianLive is a place to gather information, discuss applied technologies, and document frameworks of Debian Live systems that go beyond the scope of this document.
fr: _* *{Wiki}*: Le wiki Debian Live à http://wiki.debian.org/DebianLive est un lieu pour recueillir des informations, discuter des technologies appliquées, et structures des systèmes Debian Live qui vont au-delà de la portée de ce document.
