Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/about_manual.ssi.po
Languages: it, pt_br

source: :B~ About this manual
it: :B~ A proposito di questo manuale
pt_br: :B~ Sobre esse manual

source: 1~about-manual About this manual
it: 1~about-manual A proposito di questo manuale

source: This manual serves as a single access point to all documentation related to the Debian Live project and in particular applies to the software produced by the project for the Debian 7.0 "Wheezy" release. While it is primarily focused on helping you build a live system and not on end-user topics, an end-user may find some useful information in these sections: {The Basics}#the-basics covers preparing images to be booted from media or the network, and {Customizing run time behaviours}#customizing-run-time-behaviours describes some options that may be specified at the boot prompt, such as selecting a keyboard layout and locale, and using persistence.
it: Questo manuale funge da unico punto d'accesso a tutta la documentazione relativa al progetto Debian Live e si applica in particolare al software prodotto per il rilascio di Debian 7.0 "Wheezy". Sebbene sia principalmente focalizzato nell'aiutare a costruire un sistema live e non su argomenti per l'utente finale, è comunque possibile trovare alcune informazioni utili in queste sezioni: le {Nozioni di base}#the-basics coprono la preparazione delle immagini da avviare da un supporto o dalla rete, mentre {Personalizzare i comportamenti durante l'esecuzione}#customizing-run-time-behaviours descrive alcune opzioni specificabili al prompt d'avvio, come la scelta di un layout di tastiera e una lingua, e l'utilizzo della persistenza.

source: Some of the commands mentioned in the text must be executed with superuser privileges which can be obtained by becoming the root user via #{su}# or by using #{sudo}#. To distinguish between commands which may be executed by an unprivileged user and those requiring superuser privileges, commands are prepended by #{$}# or #{#}# respectively. This symbol is not a part of the command.
it: Alcuni dei comandi menzionati nel testo devono essere eseguiti con i privilegi di super-utente che possono essere ottenuti diventando utente root tramite #{su}# oppure usando #{sudo}#. Per distinguere i comandi che possono essere eseguiti come utente normale da quelli che necessitano dei privilegi di super-utente, i comandi sono preceduti rispettivamente da #{$}# o #{#}#. Questi simboli non fanno parte del comando.
pt_br: Alguns comandos mencionados no texto devem ser executados com privilégios de super-usuário, que podem ser obtidos tornando-se usuário root via #{su}# ou usando #{sudo}#. Para distinção entre os comandos que talvez possam ser executados como usuário não privilegiado e aqueles que requerem privilégios de super usuário, os comandos são precididos por: #{$}# ou #{#}# respectivamente. Esse simbolo não é parte do comando.

source: 2~ For the impatient
it: 2~ Per gli impazienti

source: While we believe that everything in this manual is important to at least some of our users, we realize it is a lot of material to cover and that you may wish to experience early success using the software before delving into the details. Therefore, we suggest reading in the following order. First, read this chapter, {About this manual}#about-manual, from the beginning and ending with the {Terms}#terms section. Next, skip to the three tutorials at the front of the {Examples}#examples section designed to teach you image building and customization basics. Read {Using the examples}#using-the-examples first, followed by {Tutorial 1: A standard image}#tutorial-1, {Tutorial 2: A web browser utility}#tutorial-2 and finally {Tutorial 3: A personalized image}#tutorial-3. By the end of these tutorials, you will have a taste of what can be done with Debian Live. We encourage you to return to more in-depth study of the manual, perhaps next reading {The basics}#the-basics, skimming or skipping {Building a netboot image}#building-netboot-image, and finishing by reading the {Customization overview}#customization-overview and the chapters that follow it. By this point, we hope you are thoroughly excited by what can be done with Debian Live and motivated to read the rest of the manual, cover-to-cover.
it: Sebbene crediamo che ogni cosa in questo manuale sia importante almeno per alcuni dei nostri utenti, ci rendiamo conto che c'è tanto materiale da trattare e che si potrebbe voler provare il software prima di entrare nei dettagli; pertanto suggeriamo di leggerlo nel seguente ordine. Per iniziare leggere questo capitolo, {A proposito di questo manuale}#about-manual, da cima a fondo insieme alla sezione {Glossario}#terms, quindi passare ai tre tutorial all'inizio della sezione {Esempi}#examples progettati per insegnare le basi della costruzione e della personalizzazione delle immagini. Si legga innanzitutto {Usare gli esempi}#using-the-examples, seguito da {Tutorial 1: un'immagine standard}#tutorial-1, {Tutorial 2: un programma di utilità web browser}#tutorial-2 e, infine, {Tutorial 3: un'immagine personalizzata}#tutorial-3. Alla fine di queste esercitazioni, si avrà un assaggio di ciò che si può fare con Debian Live. Ti invitiamo ad uno studio più approfondito del manuale, magari leggendo in seguito le {Nozioni di base}#the-basics, sfogliando o saltando {Creare un'immagine netboot}#building-netboot-image, e finendo con la lettura di {Panoramica sulla personalizzazione}#customization-overview e dei capitoli che lo seguono. A questo punto, ci auguriamo che tu sia davvero eccitato da ciò che si può fare con Debian Live e motivato a leggere il resto del manuale, da cima a fondo.

source: 2~terms Terms
it: 2~terms Glossario
pt_br: 2~terms Terminologia

source: _* *{Live system}*: An operating system that can boot without installation to a hard drive. Live systems do not alter local operating system(s) or file(s) already installed on the computer hard drive unless instructed to do so. Live systems are typically booted from media such as CDs, DVDs or USB sticks. Some may also boot over the network.
it: _* *{Live system}*: Un sistema operativo che può partire senza installazione su disco rigido. I sistemi live non alterano né il sistema operativo locale (o i sistemi operativi locali) né i file già installati sul disco rigido del computer a meno che lo si faccia volontariamente. I sistemi live vengono solitamente avviati da supporti quali CD, DVD o penne USB; alcuni possono anche avviarsi via rete.
pt_br: _* *{Live system}*: Um sistema operacional que pode inicializar sem instalação em um disco rígido. Sistemas live não devem alterar o(s) sistema(s) operacional(s) local(is) ou arquivo(s) já instalados no disco rígido do computador a não ser que seja instruido para isso. Sistemas Live são tipicamente inicializados a partir de uma mídia como CDs, DVDs ou pendrive(s). Alguns também podem inicializar através da rede.

source: _* *{Debian Live}*: The Debian sub-project which maintains the live-boot, live-build, live-config, and live-manual packages.
it: _* *{Debian Live}*: Il sotto-progetto Debian che mantiene i pacchetti live-boot, live-build, live-config e live-manual.
pt_br: _* *{Debian Live}*: O sub-projeto Debian que manten os pacotes live-boot, live-build, live-config, e live-manual.

source: _* *{Debian Live system}*: A live system that uses software from the Debian operating system that may be booted from CDs, DVDs, USB sticks, over the network (via netboot images), and over the Internet (via boot parameter #{fetch=URL}#).
it: _* *{Debian Live system}*: Un sistema live che usa software proveniente dal sistema operativo Debian e che può essere lanciato da CD, DVD, supporti USB, via rete (tramite immagini netboot) e via internet (tramite il parametro di boot #{fetch=URL}#).
pt_br: _* *{Debian Live system}*: Um sistema live que usa softwares do sistema operacional Debian que também pode ser inicializado a partir de CD's, DVDs, Discos USB, através da rede (via imagens netbook), e através da Internet (via parametro de boot #{fetch=URL}#).

source: _* *{Host system}*: The environment used to create the live system.
it: _* *{Host system}*: L'ambiente utilizzato per creare il sistema live.
pt_br: _* *{Host system}*: O ambiente usado para criar o sistema live.

source: _* *{Target system}*: The environment used to run the live system.
it: _* *{Target system}*: L'ambiente usato per eseguire il sistema live.
pt_br: _* *{Target system}*: O ambiente usado para rodar o sistema live.

source: _* *{live-boot}*: A collection of scripts used to boot live systems. live-boot was formerly a part of live-initramfs.
it: _* *{live-boot}*: Una raccolta di script usati per avviare sistemi live. live-boot era una parte di live-initramfs.
pt_br: _* *{live-boot}*: Uma coleção de scripts usados para inicializar sistemas live. live-boot era formalmente parte do live-initramfs.

source: _* *{live-build}*: A collection of scripts used to build customized Debian Live systems. live-build was formerly known as live-helper, and even earlier known as live-package.
it: _* *{live-build}*: Una raccolta di script usati per creare sistemi Debian Live personalizzati. live-build era conosciuto come live-helper, ed ancora prima come live-package.
pt_br: _* *{live-build}*: Uma coleção de scripts usados para construir sistemas Debian live customizados. live-build era formalmente conhecido como live-helper, e ainda antes conhecido como live-package.

source: _* *{live-config}*: A collection of scripts used to configure a live system during the boot process. live-config was formerly a part of live-initramfs.
it: _* *{live-config}*: Una raccolta di script usati per configurare un sistema live durante il processo di inizializzazione. live-config era una parte di live-initramfs.
pt_br: _* *{live-config}*: Uma coleção de scripts usados para configurar um sistema live durante o processo de boot. live-config era formalmente parte do live-initramfs.

source: _* *{live-manual}*: This document is maintained in a package called live-manual.
it: _* *{live-manual}*: Questo documento è inserito nel pacchetto chiamato live-manual.
pt_br: _* *{live-manual}*: Esse documento é mantido em um pacote chamado live-manual.

source: _* *{Debian Installer (d-i)}*: The official installation system for the Debian distribution.
it: _* *{Debian Installer (d-i)}*: Il sistema d'installazione ufficiale per la distribuzione Debian.
pt_br: _* *{Debian Installer (d-i)}*: O sistema oficial de instalação para a distribuição Debian.

source: _* *{Boot parameters}*: Parameters that can be entered at the bootloader prompt to influence the kernel or live-config.
it: _* *{Boot parameters}*: Parametri che possono essere immessi nel prompt del boot loader per modificare il comportamento del kernel o di live-config.
pt_br: _* *{Boot parameters}*: Parametros que podem ser entrados no prompt do bootloader para influenciar o kernel ou o live-config.

source: _* *{chroot}*: The chroot program, #{chroot(8)}#, enables us to run different instances of the GNU/Linux environment on a single system simultaneously without rebooting.
it: _* *{chroot}*: Il programma chroot, #{chroot(8)}#, rende possibile eseguire diverse istanze dell'ambiente GNU/Linux su un singolo sistema simultaneamente senza riavviare.

source: _* *{Binary image}*: A file containing the live system, such as binary.iso or binary.img.
it: _* *{Binary image}*: Un file che contiene il sistema live, come binary.iso o binary.img.
pt_br: _* *{Binary image}*: Um arquivo contendo o sistema live, como binary.iso ou binary.img.

source: _* *{Target distribution}*: The distribution upon which your live system will be based. This can differ from the distribution of your host system.
it: _* *{Target distribution}*: La distribuzione su cui sarà basato il sistema live. Può differire dalla distribuzione presente sul proprio computer.
pt_br: _* *{Target distribution}*: A distribuição em que o sistema live será baseado. Isso pode diferir da distribuição do seu sistema host.

source: _* *{Squeeze/Wheezy/Sid (stable/testing/unstable)}*: Debian codenames for releases. At the time of writing, Squeeze is the current *{stable}* release and Wheezy is the current *{testing}* release. Sid will always be a synonym for the *{unstable}* release. Throughout the manual, we tend to use codenames for the releases, as that is what is supported by the tools themselves.
it: _* *{Squeeze/Wheezy/Sid (stable/testing/unstable)}*: Nomi in codice per i rilasci Debian; al momento Squeeze è l'attuale *{stable}* e Wheezy l'attuale *{testing}*. Sid sarà sempre il sinonimo della *{unstable}*. In tutto il manuale si tende ad usare i nomi in codice dei rilasci, in quanto questo è ciò che è previsto dagli strumenti stessi.

source: The *{stable}* distribution contains the latest officially released distribution of Debian. The *{testing}* distribution is the staging area for the next *{stable}* release. A major advantage of using this distribution is that it has more recent versions of software relative to the *{stable}* release. The *{unstable}* distribution is where active development of Debian occurs. Generally, this distribution is run by developers and those who like to live on the edge.
it: La distribuzione *{stable}* contiene l'ultima distribuzione ufficialmente rilasciata da Debian; la *{testing}* è il punto di raccolta per i pacchetti della prossima *{stable}*. Uno dei principali vantaggi nell'uso di questa distribuzione sta nell'avere software più recente rispetto alla *{stable}*. La distribuzione *{unstable}* è dove avviene lo sviluppo attivo di Debian; viene generalmente usata dagli sviluppatori o da coloro che amano l'azzardo.

source: 2~ Authors
it: 2~ Autori
pt_br: 2~Autores

source: A list of authors (in alphabetical order):
it: Lista degli autori (in ordine alfabetico):
pt_br: A lista de autores (em ordem alfabética)

source: 2~how-to-contribute Contributing to this document
it: 2~how-to-contribute Contribuire a questo documento

source: This manual is intended as a community project and all proposals for improvements and contributions are extremely welcome. The preferred way to submit a contribution is to send it to the mailing list. Please see the section {Contact}#contact for more information.
it: Questo manuale è pensato come un progetto comunitario e ogni suggerimento e contributo è benvenuto. Il modo migliore per apportare un contributo è di inviarlo alla mailing list. Per maggiori informazioni si veda la sezione {Contatti}#contact.

source: When submitting a contribution, please clearly identify its copyright holder and include the licensing statement. Note that to be accepted, the contribution must be licensed under the same license as the rest of the document, namely, GPL version 3 or later.
it: Quando si sottopone un contributo, si prega di indicare chiaramente il detentore del copyright e di includere la licenza. Si noti che, per essere accettato, il contributo deve essere distribuito con la stessa licenza del resto del documento, ovvero la GPL versione 3 o successiva.
pt_br: Quando estiver submetendo uma contribuição, por favor identificar claramente o seu titular de direitos autorais e incluir a declaração de licenciamento. Note que para ser aceita, a contribuição deve ser licenciada obre as mesmas licenças do resto do documento, ou seja, GPL versão 3 ou superior.

source: The sources for this manual are maintained using the Git version control system. You can check out the latest copy by executing:
it: I sorgenti di questo manuale sono mantenuti utilizzando il sistema di controllo Git. Si può visionare la copia più recente eseguendo:

source: Prior to submission of your contribution, please preview your work. To preview the live-manual, ensure the packages needed for building are installed by executing:
it: Prima di sottoporre un contributo, si prega di visionare l'anteprima del proprio lavoro. Per ottenere l'anteprima di live-manual, assicurarsi di avere installati i pacchetti necessari per la sua compilazione eseguendo:
pt_br: Antes de submeter sua contribuição, por favor pré-visualize seu trabalho. Para pré-visualizar o live-manual, tenha certeza que os pacotes necessários para contruir estão instalados executando:

source: You may build the live-manual from the top level directory of your Git checkout by executing:
it: Si può compilare il live-manual dalla directory superiore del checkout di Git eseguendo:

source: Since it takes a while to build the manual in all supported languages, you may find it convenient when proofing to build for only one language, e.g. by executing:
it: Dato che occorre del tempo per compilare il manuale in tutte le lingue supportate, può risultare conveniente farlo per una sola lingua, ad esempio eseguendo:

source: It is also possible to build by document type, e.g:
it: È inoltre possibile compilare in base al tipo di documento, esempio:

source: Or combine both, e.g:
it: O entrambi:

source: 3~ Applying changes
it: 3~ Applicare le modifiche

source: Anyone can directly commit to the repository. However, we ask you to send bigger changes to the mailing list to discuss them first. To push to the repository, you must follow this procedure:
it: Chiunque può eseguire il commit direttamente sul repository; tuttavia chiediamo di inviare le modifiche più corpose in mailing list, per poterne prima discuterne. Per eseguire il push sul repository, si deve seguire questa procedura:

source: _* Fetch the public commit key:
it: _* Prelevare la chiave pubblica:
pt_br: _* Obter a chave publica de commit:

source: _* Add the following section to your openssh-client config:
it: _* Aggiungere la seguente sezione alla propria configurazione di openssh-client:
pt_br: _* Adicione a seguinte sessão na configuração do seu openssh-client:

source: _* Check out a clone of the manual through ssh:
it: _* Scaricare tramite ssh un clone del manuale:

source: _* Note that you should commit any changes on the debian-next branch, not on the debian branch.
it: _* Si noti che tutte le modifiche vanno eseguite sul ramo debian-next e non su quello debian.

source: _* After editing the files in #{manual/en/}#, please call the 'commit' target in the top level directory to sanitize the files and update the translation files:
it: _* Dopo aver modificato i file in #{manual/en/}#, chiamare il target "commit" nella directory superiore per bonificare i file ed aggiornare i file di traduzione:

source: _* Then
it: quindi

source: _* After sanitizing and adding the files, commit the changes. Write commit messages that consist of full, useful sentences in English, starting with a capital letter and ending with a full stop. Usually, these will start with the form 'Fixing/Adding/Removing/Correcting/Translating', e.g.
it: _* Dopo aver pulito e aggiunto i file è possibile eseguire il commit delle modifiche. Si scrivano messaggi costituiti da frasi in inglese esaurienti e utili, inizianti con una lettera maiuscola e terminanti con un punto. Solitamente cominceranno con la forma "Fixing/Adding/Removing/Correcting/Translating", ad esempio.

source: _* Push the commit to the server:
it: _* Inviare il commit al server:
pt_br: _* Enviar as submissões para os servidor.

source: 3~translation Translation
it: 3~translation Traduzione

source: To submit a translation for a new language, follow these three steps:
it: Per inviare una traduzione per una nuova lingua, seguire questi tre passi:

source: _* Translate the about_manual.ssi.pot, about_project.ssi.pot and index.html.in.pot files to your language with your favourite editor (such as poedit). Send translated files to the mailing list. Once we have reviewed your submission, we will add the new language to the manual (providing the po files) and will enable it in the autobuild.
it: _* Tradurre i file about_manual.ssi.pot, about_project.ssi.pot e index.html.in.pot nella propria lingua con il proprio editor preferito (tipo poedit). Inviare i file tradotti alla mailing list. Una volta che abbiamo ricevuto il contributo, aggiungeremo la nuova lingua al manuale (fornendo i file po) e la attiveremo per la procedura di compilazione automatica.

source: _* Once the new language is added, you can randomly start translating all po files in #{manual/po/}#.
it: _* Una volta che la nuova lingua è stata aggiunta, si può iniziare a tradurre tutti i file po situati in #{manual/po/}#, nell'ordine che si preferisce.

source: _* Don't forget you need #{make commit}# to ensure the translated manuals are updated from the po files and then you can review your changes launching #{make build}# before #{git add .}#, #{git commit -a -m "Translating..."}# and #{git push}#.
it: _* Non dimenticare che è necessario usare #{make commit}# per assicurarsi che i manuali tradotti siano aggiornati partendo dai file po, quindi si possono verificare le modifiche con #{make build}# prima di #{git add .}#, #{git commit -a -m "Traduzione..."}# e #{git push}#.

source: *{Note:}* Please be aware that even though both #{make commit}# and #{make build}# remove your build directory, if you build the manual to review your changes as recommended, you may want to clean your git tree before pushing. In order to do that, you can use #{make clean}#. This last step is not compulsory thanks to the .gitignore file but it is a good practice to avoid committing files involuntarily.
it: *{Nota:}* anche se #{make commit}# e #{make build}# rimuovono entrambi la directory di compilazione, se si compila il manuale per rivedere le modifiche come consigliato, si consiglia di pulire l'albero git prima del push; per fare ciò si puà usare il comando #{make clean}#. Grazie al file .gitignore, quest'ultimo passaggio non è obbligatorio ma è una buona abitudine che evita di fare involontariamente il commit di certi file.

source: 1~ About this manual
pt_br: 1~ Sobre esse manual

source: The main goal of this manual is to serve as a single access point to all documentation related to the Debian Live project. It does not include end-user documentation for using a Debian Live system as far as things are live specific.
pt_br: O principal objetivo deste manual é servir como único ponto de acesso para toda a documentação relacionada ao projeto Debian Live. Ele não inclui documentação do usuário para usar o sistema Debian Live nem sobre as coisas que são Live específicas.

source: _* *{chroot}*: The chroot program, chroot(8), enables us to run different instances of the GNU/Linux environment on a single system simultaneously without rebooting.
pt_br: _* *{chroot}*: O programa chroot, chroot(8), nos habilita a rodar simultâneamente diferentes instâncias do ambiente do GNU/Linux em um único sistema sem reinicialização.

source: _* *{Squeeze/Wheezy/Sid (stable/testing/unstable)}*: The stable distribution contains the latest officially released distribution of Debian. The testing distribution is the staging area for the next stable release. A major advantage of using this distribution is that it has more recent versions of software relative to the stable release. The unstable distribution is where active development of Debian occurs. Generally, this distribution is run by developers and those who like to live on the edge.
pt_br: _* *{Squeeze/Wheezy/Sid (stable/testing/unstable)}*: A distribuição estável(stable) contem a última versão oficial lançada do Debian. A distribuição "Testing" é a ária de estágio para a próxima versão estável(stable). A maior vantagem de usar essa distribuição é que ela tem versões mais recentes de software relacionado com a versão estável(stable). A distribuição instável(unstable) é onde ocorre o desenvolvimento ativo do Debian. Geralmente, essa distribuição é mantida por desenvolvedores e aqueles que vivem no limite.
