Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/about_manual.ssi.po
Languages: it, pt_br

source: At the time of writing, Squeeze is the current stable release and Wheezy is the current testing release. Sid will always be a synonym for the unstable release.
pt_br: No tempo da escrita, Squeeze é o a atual versão estável(stable) e Wheezy é a atual versão testing. Sid sempre será um sinônimo para a versão instável(unstable).

source: 2~ Contributing to this document
pt_br: 2~ Contribuindo com esse documento

source: The sources for this manual are maintained using the Git version control system. You can checkout the latest copy by executing:
pt_br: Os fontes para esse manail são mantidos usando o sistema de controle de versão Git. Você pode fazer o checkout da ultima cópia executando:

source: You may build the live-manual from the top level directory of your git checkout by executing:
pt_br: Você também pode construir o live-manual a partir do primeiro nível do diretório do seu git checkout executando:

source: 3~ Applying patches
pt_br: 3~ Aplicando patches

source: Directly commiting to the repository is possible by anyone. However, we ask you to send bigger changes to the mailing list to discuss them first. In order to push to the repository, the following steps are required.
pt_br: Diretamente cometer ao repoitório é possivel por qualquer um. No entanto, nós pedimo que você mande maiores mudanças para a lista de e-mail para discuti-las primeiro. Para enviar ao repositório, os seguintes passos são necessários:

source: $ mkdir -p ~/.ssh/identity.d $ wget http://live.debian.net/other/keys/gitosis@live.debian.net \ -O ~/.ssh/identity.d/live.debian.net $ wget http://live.debian.net/other/keys/gitosis@live.debian.net.pub \ -O ~/.ssh/identity.d/live.debian.net.pub $ chmod 0600 ~/.ssh/identity.d/live.debian.net*
pt_br: $ mkdir -p ~/.ssh/identity.d $ wget http://live.debian.net/other/keys/gitosis@live.debian.net \ -O ~/.ssh/identity.d/gitosis@live.debian.net $ wget http://live.debian.net/other/keys/gitosis@live.debian.net.pub \ -O ~/.ssh/identity.d/gitosis@live.debian.net.pub $ chmod 0600 ~/.ssh/identity.d/gitosis@live.debian.net*

source: _* Checkout a clone of the manual through ssh:
pt_br: _* Fazer o checkout de um clone do manual por ssh:

source: _* After editing the files in manual/en/, please call the 'commit' target in the top level directory to sanitize the files and update the translation files:
pt_br: _* Depois de editar os arquivos no manual/en/, por favor chame o alvo 'commit' no nível superior do diretório para higiênizar os arquivos e atualizar os arquivos de tradução.

source: _* After sanitizing commit the changes. Write commit messages, that consist of full useful sentences, starting with a capital letter and ending with a full stop. Usually starting with the form 'Fixing/Adding/Removing/Correcting/':
pt_br: _* Depois de higiênizar submeta as mudançãs. Escreva mensagens de submissão, que consistem em sentanças completas úteis, começando por letra maiuscula e acabando com uma parada total. Normalmente iniciando com as formas 'Fixing/Adding/Removing/Correcting/':
