Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/common-tasks.xml.po
Languages: fr

source: Common tasks
fr: Tâche communes

source: The Debian Installer
fr: L'installeur Debian

source: Although Debian Live is mostly concerned with avoiding permanent installation, integrating some form of installer to your image is possible. There are number of different "types" of installation, varying in what and how to install the image.
fr: Bien que l'intérêt du système live soit qu'il permet d'éviter une installation permanente, il est possible d'intégrer un installeur dans l'image. Il existe différents types d'installation, selon les images et comment les installer.

source: The "Debian Installer"
fr: L'Installeur Debian

source: Please note the careful use of capital letters when referring to the "Debian Installer" in this section - when used like this we refer explicitly to the official installer for the Debian system, not anything else. It is often seen abbreviated to "d-i".
fr: Notez l'utilisation de majuscules en référence à l'Installeur Debian dans cette section. Nous désignons ainsi explicitement l'installeur officiel pour le système Debian, et rien d'autre. On le trouve souvent abrégé en "d-i".

source: The three main types of installer are:
fr: Les trois principaux types d'installeurs sont :

source: "Normal" Debian Installer
fr: L'Installeur Debian "normal"

source: This is a normal Debian Live image with a seperate kernel and initrd which (when selected from the appropriate bootloader) launches into a standard Debian Installer instance, just as if you had downloaded a CD image of Debian and booted it.
fr: C'est une image Debian live classique, pourvue d'un noyau et d'initrd séparés, qui, si vous sélectionnez le bootloader approprié, lance une instance standard de l'Installeur Debian, comme si vous démarriez d'un live cd Debian.

source: This means that Debian is installed by fetching and installing <command>.deb</command> packages using <filename>debootstrap</filename> or <filename>cdebootstrap</filename>, from the local media or some network-base network, resulting in a standard Debian system being installed to the hard disk.
fr: Cela signifie que Debian s'installe en récupérant et en installant des paquets <command>.deb</command> et en utilisant <filename>debootstrap</filename> ou <filename>cdebootstrap</filename>, depuis le réseau ou un média local, de sorte qu'un système Debian standard soit installé sur le disque dur.

source: This whole process can be preseeded and customised in a number of ways; see the relevant "DebianInstaller" wiki page and installation guide for more. This is operational now withing &live-helper;.
fr: Tout ce procédé est configurable de diverses façons, via les fichiers preseed. Pour plus d'informations, référez-vous à la page appropriée du wiki de l'Installeur Debian, ainsi qu'au guide d'installation. Ceci est désormais opérationnel dans &live-helper;.

source: "Live" Debian Installer
fr: L'Installeur "Live" Debian

source: This is a Debian Live image with a seperate kernel and initrd which (when selected from the appropriate bootloader) launches into an instance of the Debian Installer.
fr: C'est une image Debian Live, pourvue d'un noyau et d'initrd séparés, qui, si vous sélectionnez le bootloader approprié, lance une instance de l'Installeur Debian.

source: Installation will proceed in an identical fashion to the "Normal" installation described above, but at the actual package installation stage, instead of using <filename>debootstrap</filename> to fetch and install packages, the "live" filesystem image is copied to the target. After this stage, the Debian Installer continues as normal, installing and configuring items such as bootloaders and local users, etc.
fr: L'installation se déroule de la même façon que l'installation "normale" décrite plus haut, mais au moment d'installer réellement les paquets, au lieu d'utiliser <filename>debootstrap</filename> pour récupérer et installer les paquets, l'image du système de fichiers "live" est copiée sur la cible. Passé ce stade, l'Installeur Debian continue normalement à installer et configurer des éléments tels que le chargeur de boot, les utilisateurs locaux, etc.

source: This is working now.
fr: Ceci fonctionne désormais.

source: "Ubuntu"-style installer
fr: Installeur - style "Ubuntu"

source: This is where you boot into a graphical Debian Live system and run a wizard-based program which installs and configures the live system, all the time remaining inside the live graphical environment.
fr: Cela consiste à démarrer un sytème Debian Live graphique et de lancer un "wizard" qui installe et configure le système live, tout en restant à l'intérieur de l'environnement graphique.

source: This is currently NOT possible with Debian Live.
fr: Ceci n'est pour l'instant PAS possible dans Debian Live.

source: The values "Normal", "Live" and "Ubuntu" are not valid values for
fr: Les valeurs "Normal", "Live" et "Ubuntu" ne sont pas valides pour
