Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/examples.ssi.po
Languages: fr

source: :B~ Examples
fr: :B~ Exemples

source: 1~examples Examples
fr: 1~examples Exemples

source: This chapter covers example builds for specific use cases with Debian Live. If you are new to building your own Debian Live images, we recommend you first look at the three tutorials in sequence, as each one teaches new techniques that will help you use and understand the remaining examples.
fr: Ce chapitre s'occupe d'exemples de constructions pour des cas d'utilisation spécifiques avec Debian Live. Si vous êtes nouveau avec la construction de vos propres images Debian Live, nous vous recommandons d'abord regarder les trois tutoriels en séquence, parce que chacun enseigne nouvelles techniques qui vous aideront à utiliser et à comprendre les exemples restants.

source: 2~using-the-examples Using the examples
fr: 2~using-the-examples En utilisant les exemples

source: To use these examples you need a system to build them on that meets the requirements listed in {Requirements}#requirements and has live-build installed as described in {Installing live-build}#installing-live-build.
fr: Pour utiliser ces exemples vous avez besoin d'un système pour les construire, lequel répond aux exigences énumérées dans {Exigences}#requirements et qui a live-build installé comme décrit à {Installation de live-build}#installing-live-build.

source: Note that, for the sake of brevity, in these examples we do not specify a local mirror to use for the build. You can speed up downloads considerably if you use a local mirror. You may specify the options when you use #{lb config}#, as described in {Distribution mirrors used at build time}#distribution-mirrors-build-time, or for more convenience, set the default for your build system in #{/etc/live/build.conf}#. Simply create this file and in it, set the corresponding #{LB_MIRROR_*}# variables to your preferred mirror. All other mirrors used in the build will be defaulted from these values. For example:
fr: Notez que, pour des raisons de concision, dans ces exemples, nous ne spécifions pas un miroir local à utiliser pour la construction. Vous pouvez accélérer considérablement les téléchargements si vous utilisez un miroir local. Vous pouvez spécifier les options lorsque vous utilisez #{lb config}#, tel que décrit dans {Miroirs de distribution utilisés au temps de construction}#distribution-mirrors-build-time, ou pour plus de commodité, fixez par défaut votre système de construction dans #{/etc/live/build.conf}#. Il suffit de créer ce fichier et de définir les variables #{LB_MIRROR_*}# correspondantes à votre miroir préféré. Tous les autres miroirs utilisés dans la construction seront par défaut à partir de ces valeurs. Par exemple:

source: LB_MIRROR_BOOTSTRAP="http://mirror/debian/" LB_MIRROR_CHROOT_SECURITY="http://mirror/debian-security/" LB_MIRROR_CHROOT_BACKPORTS="http://mirror/debian-backports/"
fr: LB_MIRROR_BOOTSTRAP="http://mirror/debian/" LB_MIRROR_CHROOT_SECURITY="http://mirror/debian-security/" LB_MIRROR_CHROOT_BACKPORTS="http://mirror/debian-updates/"

source: 2~tutorial-1 Tutorial 1: A default image
fr: 2~tutorial-1 Tutorial 1: Une image par défaut

source: *{Use case:}* Create a simple first image, learning the basics of live-build.
fr: *{Cas d'utilisation:}* Créer une image simple d'abord, apprenant les bases de live-build.

source: In this tutorial, we will build a default ISO hybrid Debian Live image containing only base packages (no Xorg) and some Debian Live support packages, as a first exercise in using live-build.
fr: Dans ce tutoriel, nous construirons une image Debian Live ISO hybride par défaut contenant uniquement paquets de base (pas de Xorg) et quelques paquets Debian de soutien live, comme un premier exercice en utilisant live-build.

source: You can't get much simpler than this:
fr: Vous ne pouvez pas obtenir rien plus simple que cela:

source: Examine the contents of the #{config/}# directory if you wish. You will see stored here a skeletal configuration, ready to customize or, in this case, use immediately to build a default image.
fr: Examinez le contenu du répertoire #{config/}# si vous le souhaitez. Vous verrez stockés ici une arborescence de configuration, pour être personnalisee ou, dans ce cas, utiliser immédiatement pour construire une image par défaut.

source: Now, as superuser, build the image, saving a log as you build with #{tee}#.
fr: Maintenant, en tant que superutilisateur, construire l'image en enregistrant un journal avec #{tee}#.

source: Assuming all goes well, after a while, the current directory will contain #{binary.hybrid.iso}#. This ISO hybrid image can be booted directly in a virtual machine as described in {Testing an ISO image with Qemu}#testing-iso-with-qemu and {Testing an ISO image with virtualbox}#testing-iso-with-virtualbox, or else imaged onto optical media or a USB flash device as described in {Burning an ISO image to a physical medium}#burning-iso-image and {Copying an ISO hybrid image to a USB stick}#copying-iso-hybrid-to-usb, respectively.
fr: En supposant que tout se passe bien, après un certain temps, le répertoire courant contiendra #{binary.hybrid.iso}#. Cette image ISO hybride peut être démarrée directement dans une machine virtuelle comme décrit dans {Test d'une image ISO avec QEMU}#testing-iso-with-qemu et {Test d'une image ISO avec virtualbox}#testing-iso-with-virtualbox, ou bien copiée sur un support optique ou un périphérique USB comme décrit dans {Graver une image ISO sur un support physique}#burning-iso-image et {Copie d'un image ISO hybride sur une clé USB}#copying-iso-hybrid-to-usb, respectivement.

source: 2~tutorial-2 Tutorial 2: A web browser utility
fr: 2~tutorial-2 Tutoriel 2: Un utilitaire d'un navigateur Web

source: *{Use case:}* Create a web browser utility image, learning how to apply customizations.
fr: *{Cas d'utilisation:}* Créer une image d'un utilitaire d'un navigateur Web, en apprenant à appliquer des personnalisations.

source: In this tutorial, we will create an image suitable for use as a web browser utility, serving as an introduction to customizing Debian Live images.
fr: Dans ce tutoriel, nous allons créer une image utilisable comme un utilitaire de navigateur Web, en servant d'introduction à la personnalisation d'images Debian Live.

source: Our choice of LXDE for this example reflects our desire to provide a minimal desktop environment, since the focus of the image is the single use we have in mind, the web browser. We could go even further and provide a default configuration for the web browser in #{config/includes.chroot/etc/iceweasel/profile/}#, or additional support packages for viewing various kinds of web content, but we leave this as an exercise for the reader.
fr: Notre choix de LXDE pour cet exemple reflète notre volonté de fournir un environnement de bureau minime, puisque le point de l'image est l'utilisation unique que nous avons à l'esprit, le navigateur web. On pourrait aller encore plus loin et offrir une configuration par défaut pour le navigateur web dans #{config/includes.chroot/etc/iceweasel/profile/}#, ou des paquets de soutien supplémentaires pour visualiser différents types de contenu web, mais nous laissons cela comme un exercice pour le lecteur.

source: Build the image, again as superuser, keeping a log as in {Tutorial 1}#tutorial-1:
fr: Construire l'image, encore une fois en tant que superutilisateur, garder un journal comme dans {Tutoriel 1}#tutorial-1:

source: Again, verify the image is OK and test, as in {Tutorial 1}#tutorial-1.
fr: Encore une fois, vérifiez que l'image est OK et faire un test, comme dans {Tutoriel 1}#tutorial-1:

source: 2~tutorial-3 Tutorial 3: A personalized image
fr: 2~tutorial-3 Tutoriel 3: Une image personnalisée

source: *{Use case:}* Create a project to build a personalized image, containing your favourite software to take with you on a USB stick wherever you go, and evolving in successive revisions as your needs and preferences change.
fr: *{Cas d'utilisation:}* Créer un projet pour construire une image personnalisée, contenant vos logiciels préférés à emporter avec vous sur une clé USB où que vous alliez, et évoluant dans des révisions successives selon vos besoins et vos préférences changent.

source: Since we will be changing our personalized image over a number of revisions, and we want to track those changes, trying things experimentally and possibly reverting them if things don't work out, we will keep our configuration in the popular #{git}# version control system. We will also use the best practice of autoconfiguration via #{auto}# scripts as described in {Managing a configuration}#managing-a-configuration.
fr: Puisque nous allons changer notre image personnalisée pendant un certain nombre de révisions, et nous voulons suivre ces changements, d'essayer des choses expérimentalement et éventuellement de les revenir si les choses ne fonctionnent pas, nous garderons notre configuration dans le populaire système de contrôle de version #{git}#. Nous allons également utiliser les meilleures pratiques d'autoconfiguration via #{auto}# scripts tel que décrit dans {Gestion d'une configuration}#managing-a-configuration.

source: 3~ First revision
fr: 3~ Première révision

source: Edit #{auto/config}# to read as follows:
fr: Éditer #{auto/config}# pour lire comme suit:

source: Perform #{lb config}# to generate the config tree, using the #{auto/config}# script you just created:
fr: Exécutez #{lb config}# pour générer l'arbre de configuration, en utilisant le script #{auto/config}# que vous avez crée:

source: Now populate your local package list:
fr: Maintenant remplir votre liste de paquets locaux:

source: First, #{--architectures i386}# ensures that on our #{amd64}# build system, we build a 32-bit version suitable for use on most machines. Second, we use #{--linux-flavours 686-pae}# because we don't anticipate using this image on much older systems. Third, we have chosen the /{lxde}/ task metapackage to give us a minimal desktop. And finally, we have added two initial favourite packages: /{iceweasel}/ and /{xchat}/.
fr: Tout d'abord, #{--architectures i386}# assure que sur notre système de construction #{amd64}#, nous construisons une version de 32 bits qui peut être utilisée sur la plupart des machines. En seconde place, nous utilisons #{--linux-flavours 686-pae}# parce que nous ne prévoyons pas utiliser cette image sur des systèmes beaucoup plus anciens. En troisième lieu, nous avons choisi la tâche métapaquet /{lxde}/ pour nous donner un bureau minimal. Et enfin, nous avons ajouté deux premiers paquets préférés: /{iceweasel}/ et /{xchat}/.

source: Now, build the image:
fr: Maintenant, construire l'image:

source: Note that unlike in the first two tutorials, we no longer have to type #{2>&1 | tee build.log}# as that is now included in #{auto/build}#.
fr: Notez que contrairement aux deux premiers tutoriels, nous n'avons plus besoin de taper #{2>&1 | tee build.log}# parce que cela est maintenant inclus dans #{auto/build}#.

source: Once you've tested the image (as in {Tutorial 1}#tutorial-1) and are satisfied it works, it's time to initialize our #{git}# repository, adding only the auto scripts we just created, and then make the first commit:
fr: Une fois que vous avez testé l'image (comme dans {Tutoriel 1}#tutorial-1) et vous êtes satisfait avec son fonctionnement, il est temps pour initialiser notre dépôt #{git}#, ajoutant que les scripts auto que nous avons juste créés, et ensuite faire le premier commit:

source: 3~ Second revision
fr: 3~ Deuxième révision

source: In this revision, we're going to clean up from the first build, add the /{vlc}/ package to our configuration, rebuild, test and commit.
fr: Dans cette révision, nous allons nettoyer à partir de la première construction, ajouter le paquet /{vlc}/ à notre configuration, reconstruire, tester et faire le commit.

source: The #{lb clean}# command will clean up all generated files from the previous build except for the cache, which saves having to re-download packages. This ensures that the subsequent #{lb build}# will re-run all stages to regenerate the files from our new configuration.
fr: La commande #{lb clean}# va nettoyer tous les fichiers générés par la construction précédente à l'exception du cache, ça évite d'avoir à re-télécharger les paquets. Cela garantit que la #{lb build}# suivante ré-exécutera toutes les étapes pour régénérer les fichiers de notre nouvelle configuration.

source: Now append the /{vlc}/ package to our local package list in #{config/package-lists/my.list.chroot}#:
fr: Maintenant ajouter le paquet /{vlc}/ à votre liste de paquets locaux dans #{config/package-lists/my.list.chroot}#:

source: Build again:
fr: Construire à nouveau:

source: Test, and when you're satisfied, commit the next revision:
fr: Tester, et quand vous soyez satisfaits, faire le commit de la prochaine révision:

source: Of course, more complicated changes to the configuration are possible, perhaps adding files in subdirectories of #{config/}#. When you commit new revisions, just take care not to hand edit or commit the top-level files in #{config}# containing #{LB_*}# variables, as these are build products, too, and are always cleaned up by #{lb clean}# and re-created with #{lb config}# via their respective #{auto}# scripts.
fr: Bien sûr, des changements plus compliqués à la configuration sont possibles, peut-être l'ajout de fichiers dans les sous-répertoires de #{config/}#. Quand vous livrez des nouvelles révisions, on doit prendre soin de ne pas modifier à la main ou envoyer au dépôt les fichiers de niveau supérieur dans #{config}# contenant variables #{LB_*}#, car ce sont aussi des produits de creation et sont toujours nettoyés par #{lb clean}# et re-créés avec #{lb config}# via leur respectives #{auto}# scripts.

source: We've come to the end of our tutorial series. While many more kinds of customization are possible, even just using the few features explored in these simple examples, an almost infinite variety of different images can be created. The remaining examples in this section cover several other use cases drawn from the collected experiences of users of Debian Live.
fr: Nous sommes arrivés à la fin de notre série de tutoriels. Alors que de nombreux types de personnalisations sont possibles, même juste en utilisant les fonctionnalités explorées dans ces exemples simples, une variété presque infinie d'images différentes peuvent être crées. Les autres exemples de cette section couvrent plusieurs autres cas d'utilisation tirés des expériences recueillies des utilisateurs de Debian Live.

source: 2~ A VNC Kiosk Client
fr: 2~ Un client Kiosk VNC

source: *{Use case:}* Create an image with live-build to boot directly to a VNC server.
fr: *{Cas d'utilisation:}* Créer une image avec live-build pour démarrer directement à un serveur VNC.

source: Make a build directory and create an skeletal configuration inside it, disabling recommends to make a minimal system. And then create two initial package lists: the first one generated with a script provided by live-build named #{Packages}# (see {Generated package lists}#generated-package-lists), and the second one including /{xorg}/, /{gdm3}/, /{metacity}/ and /{xvnc4viewer}/.
fr: Créer un répertoire de construction et créer une configuration arborescent à l'intérieur, désactiver «recommends» pour faire un système minimal. Et puis créer deux listes initiales de paquets: la première générée par un script fourni par live-build nommée #{Packages}# (voir {Générer listes de paquets}#generated-package-lists), et la seconde incluant /{xorg}/, /{gdm3}/, /{metacity}/ et /{xvnc4viewer}/.

source: As explained in {Tweaking APT to save space}#tweaking-apt-to-save-space you may need to re-add some recommended packages to make your image work properly.
fr: Comme il est expliqué en {Régler APT pour économiser de l'espace}#tweaking-apt-to-save-space il peut-être que vous devrez rajouter quelques paquets recommandés pour faire fonctionner votre image correctement.

source: An easy way to list recommends is using /{apt-cache}/. For example:
fr: Une façon facile d'énumérer les «recommends» est en utilisant /{apt-cache}/. Par exemple:

source: In this example we found out that we had to re-include several packages recommended by live-config and live-boot: #{user-setup}# to make autologin work and #{sudo}# as an essential program to shutdown the system. Besides, it could be handy to add #{live-tools}# to be able to copy the image to RAM and #{eject}# to eventually eject the live media. So:
fr: Dans cet exemple, nous avons découvert que nous devions ré-inclure plusieurs paquets recommandés par live-config et live-boot: #{user-setup}# pour l'autologin et #{sudo}# un logiciel essentiel pour arrêter le système. En outre, il pourrait être utile d'ajouter #{live-tools}# pour copier l'image dans la RAM et #{eject}# pour éjecter le support live. Alors:

source: After that, create the directory #{/etc/skel}# in #{config/includes.chroot}# and put a custom #{.xsession}# in it for the default user that will launch /{metacity}/ and start /{xvncviewer}/, connecting to port #{5901}# on a server at #{192.168.1.2}#:
fr: Aprés, créer le répertoire #{/etc/skel}# dans #{config/includes.chroot}# avec un fichier #{.xsession}# personnalisée pour l'utilisateur par défaut qui va lancer /{metacity}/ et /{xvncviewer}/, en reliant le port #{5901}# sur un serveur à #{192.168.1.2}#:

source: Build the image:
fr: Construire l'image:

source: Enjoy.
fr: Amusez-vous bien!

source: 2~ A base image for a 128MB USB key
fr: 2~ Une image de base pour une clé USB de 128MB

source: *{Use case:}* Create a default image with some components removed in order to fit on a 128MB USB key with a little space left over to use as you see fit.
fr: *{Cas d'utilisation:}* Créer une image par défaut avec certains composants éliminés afin de l'adapter sur une clé USB de 128MB avec un peu d'espace laissé pour l'utiliser à votre convenance.

source: When optimizing an image to fit a certain media size, you need to understand the tradeoffs you are making between size and functionality. In this example, we trim only so much as to make room for additional material within a 128MB media size, but without doing anything to destroy the integrity of the packages contained within, such as the purging of locale data via the /{localepurge}/ package, or other such "intrusive" optimizations. Of particular note, we use #{--debootstrap-options}# to create a minimal system from scratch.
fr: Pour l'optimisation d'une image adaptée à la dimension de certains supports, vous avez besoin de comprendre le compromis que vous faites entre la taille et la fonctionnalité. Dans cet exemple, nous réduisons la taille uniquement que pour faire place au matériel supplémentaire au sein d'une taille de 128MB, mais sans faire rien pour détruire l'intégrité des paquets contenus, telle que la purge des données de localisation via le paquet /{localepurge}/, ou d'autres optimisations "intrusives". On notera en particulier, que nous utilisons #{--debootstrap-options}# pour créer un système minimal à partir de zéro.

source: To make the image work properly, we must re-add, at least, two recommended packages which are left out by the #{--apt-recommends false}# option. See {Tweaking APT to save space}#tweaking-apt-to-save-space
fr: Pour faire que l'image fonctionne correctement, nous devons ajouter à nouveau, au moins, deux paquets recommandés qui sont laissés de côté par l'option #{--apt-recommends false}#. Voir {Régler APT pour économiser de l'espace}#tweaking-apt-to-save-space

source: Now, build the image in the usual way:
fr: Maintenant, construire l'image de la manière habituelle:

source: On the author's system at the time of writing this, the above configuration produced a 77MB image. This compares favourably with the 177MB image produced by the default configuration in {Tutorial 1}#tutorial-1.
fr: Sur le système de l'auteur au moment de l'écriture, la configuration ci-dessus produisait une image de 77MB. Cela se compare favorablement avec l'image de 177MB produite par la configuration par défaut dans {Tutoriel 1}#tutorial-1.

source: 2~ A localized GNOME desktop and installer
fr: 2~ Un bureau GNOME localisé avec un installateur

source: We want to make an iso-hybrid image for i386 architecture using our preferred desktop, in this case GNOME, containing all of the same packages that would be installed by the standard Debian installer for GNOME.
fr: Nous voulons faire une image iso-hybrid pour l'architecture i386 en utilisant notre bureau préféré, dans ce cas, GNOME, contenant tous les paquets qui seraient installés par l'installateur Debian standard pour GNOME.

source: Our initial problem is the discovery of the names of the appropriate language tasks. Currently, live-build cannot help with this. While we might get lucky and find this by trial-and-error, there is a tool, #{grep-dctrl}#, which can be used to dig it out of the task descriptions in tasksel-data, so to prepare, make sure you have both of those things:
fr: Notre premier problème est la découverte des noms des tâches appropriées. Actuellement, live-build ne peut pas aider à faire ça. Alors que nous pourrions être chanceux et trouver ce par essais et erreurs, il y a un outil, #{grep-dctrl}#, qui peut être utilisé pour découvrir les descriptions des tâches dans tasksel-data, de sorte à préparer, assurez-vous que vous avez ces deux choses:

source: Now we can search for the appropriate tasks, first with:
fr: Maintenant, nous pouvons rechercher les tâches appropriées, d'abord avec:

source: By this command, we discover the task is called, plainly enough, german. Now to find the related tasks:
fr: Par cette commande, nous découvrons que la tâche est appelée, assez clairement, german. Maintenant, pour trouver les tâches liées:

source: At boot time we will generate the *{de_CH.UTF-8}* locale and select the *{ch}* keyboard layout. Now let's put the pieces together. Recalling from {Using metapackages}#using-metapackages that task metapackages are prefixed #{task-}#, we just specify these language boot parameters, then add standard priority packages and all our discovered task metapackages to our package list as follows:
fr: Au moment du démarrage nous allons générer la locale *{de_CH.UTF-8}* et sélectionner la disposition de clavier *{ch}*. Maintenant, nous allons mettre les morceaux ensemble. Rappelant de {Utilisation des métapaquets}#using-metapackages que les métapaquets sont préfixés #{task-}#, nous précisons ces paramètres de la langue pendant l'amorçage, puis nous ajoutons les paquets de priorité standard et tous nos métapaquets découverts à notre liste de paquets comme suit:

source: Note that we have included the debian-installer-launcher package to launch the installer from the live desktop, and have also specified the 486 flavour kernel, as it is currently necessary to make the installer and live system kernels match for the launcher to work properly.
fr: Notez que nous avons inclus le paquet debian-installer-launcher pour lancer l'installateur à partir du bureau live, nous avons également précisé le noyau 486, parce qu'il est actuellement nécessaire faire que l'installateur et le noyau du systéme live coïncident pour que le lanceur fonctionne correctement.
