Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/index.html.*.po
Languages: ca

source: Debian Live Project
ca: Projecte Debian Live

source: Debian Live Manual
ca: Manual de Debian Live

source: <i>live-manual</i> is available in different file formats and it is translated into several languages. Keep in mind that some translations may be incomplete or may not be up to date.
ca: <i>live-manual</i> està disponible en diferents formats de fitxer i està traduït a diversos idiomes. Tenir en compte que algunes de les traduccions poden estar incompletes o no estar al dia.

source: Please report errors, omissions, patches and suggestions to our mailing list at <a href="mailto:debian-live@lists.debian.org">debian-live@lists.debian.org</a> and read about <a href="html/live-manual.en.html#how-to-contribute">how to contribute</a> to the manual.
ca: Si us plau, informeu dels errors, omissions, pedaços i suggeriments a la llista de correu <a href="mailto:debian-live@lists.debian.org">debian-live@lists.debian.org</a> i llegiu sobre com contribuir al manual <a href="html/live-manual.ca.html#how-to-contribute">com contribuir</a>

source: Available Formats
ca: Formats disponibles

source: <a href="epub/live-manual.en.epub">EPUB</a>
ca: <a href="epub/live-manual.ca.epub">EPUB</a>

source: HTML: <a href="html/live-manual/toc.en.html">multi page</a>, <a href="html/live-manual.en.html">single page</a>
ca: HTML: <a href="html/live-manual/toc.ca.html">varies pàgines</a>, <a href="html/live-manual.ca.html">una sola pàgina</a>

source: <a href="odt/live-manual.en.odt">ODF</a>
ca: <a href="odt/live-manual.ca.odt">ODF</a>

source: PDF: <a href="pdf/portrait.en.a4.pdf">A4 portrait</a>, <a href="pdf/landscape.en.a4.pdf">A4 landscape</a>, <a href="pdf/portrait.en.letter.pdf">letter portrait</a>, <a href="pdf/landscape.en.letter.pdf">letter landscape</a>
ca: PDF: <a href="pdf/portrait.ca.a4.pdf">retrat A4</a>, <a href="pdf/landscape.ca.a4.pdf">A4 paisatge</a>, <a href="pdf/portrait.ca.letter.pdf">carta retrat</a>, <a href="pdf/landscape.ca.letter.pdf">carta paisatge</a>

source: <a href="txt/live-manual.en.txt">Plain text</a>
ca: <a href="txt/live-manual.ca.txt">Text sense format</a>

source: Last changed: @DATE_CHANGE@
ca: Darrera modificació: @DATE_CHANGE@

source: Last built: @DATE_BUILD@
ca: Darrera generació: @DATE_BUILD@

source: Source
ca: Codi font

source: The sources for this manual are available in a <a href="http://git-scm.com/">Git</a> repository at live.debian.net.
ca: Les fonts d'aquest manual estan disponibles en un repositori <a href="http://git-scm.com/">Git</a> a live.debian.net.

source: Browse: <a href="http://live.debian.net/gitweb/?p=live-manual.git"><small><tt>http://live.debian.net/gitweb/?p=live-manual.git</tt></small></a>
ca: Navegar: <a href="http://live.debian.net/gitweb/?p=live-manual.git"><small><tt>http://live.debian.net/gitweb/?p=live-manual.git</tt></small></a>

source: <a href="http://live.debian.net/">Debian Live</a> &lt;<a href="mailto:debian-live@lists.debian.org">debian-live@lists.debian.org</a>&gt; - <a href="http://live.debian.net/legal.html">Legal Notice</a>
ca: <a href="http://live.debian.net/">Debian Live</a> &lt;<a href="mailto:debian-live@lists.debian.org">debian-live@lists.debian.org</a>&gt; - <a href="http://live.debian.net/legal.html">Avís legal</a>
