Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/project_procedures.ssi.po
Languages: es

source: B~ Procedures
es: B~ Procedimientos

source: 1~procedures Procedures
es: 1~procedures Procedimientos

source: This chapter documents the procedures within the Debian Live project for various tasks that need cooperation with other teams in Debian.
es: Este capítulo documenta los procedimientos dentro del proyecto Debian Live para diversas tareas que requieren la cooperación con otros equipos de Debian.

source: 2~ Udeb Uploads
es: 2~ Subir Udeb

source: Before commiting releases of a udeb in d-i svn, one has to call:
es: Antes de enviar una nueva versión de un udeb al d-i svn, uno tiene que ejecutar:

source: 2~ Major Releases
es: 2~ Principales lanzamientos

source: Releasing a new stable major version of Debian includes a lot of different teams working together to make it happen. At some point, the Live team comes in and builds live system images. The requirements to do this are:
es: El lanzamiento de una nueva versión estable de Debian incluye una gran cantidad de equipos diferentes que trabajan juntos para conseguirlo. En un momento dado, el equipo Live aparece y desarrolla imágenes en vivo del sistema. Los requisitos para ello son:

source: _* A mirror containing the released versions for the debian, debian-security and debian-volatile archive which the debian-live buildd can access.
es: _* Una réplica que contiene las versiones publicadas para los archivos de debian, debian-security y debian-volatile a las que el generador de debian-live puede tener acceso.

source: _* The names of the image need to be known (e.g. debian-live-VERSION-ARCH-FLAVOUR.iso).
es: _* Es necesario conocer el nombre de la imagen (p.ej. debian-live-VERSION-ARCH-FLAVOUR.iso).

source: _* The packagelists need to have been updated.
es: _* Es necesario haber actualizado la lista de paquetes.

source: _* The data from debian-cd needs to be synced (udeb exclude lists).
es: _* Es necesario sincronizar los datos de debian-cd (lista de exclusión de udeb)

source: _* The includes from debian-cd needs to be synced (README.*, doc/*, etc.).
es: _* Es necesario sincronizar la lista de los paquetes de debian-cd incluidos (README.*, doc/*, etc.).

source: _* Images are built and mirrored on cdimage.debian.org.
es: _* Las imágenes se generan y se almacenan en cdimage.debian.org.

source: 2~ Point Releases
es: 2~ Nuevas versiones

source: _* Again, we need updated mirror of debian, debian-security and debian-volatile.
es: _* Una vez más, se necesita una réplica actualizada de Debian, debian-security y debian-volatile.

source: _* Send announcement mail.
es: _* Correo para enviar anuncios.

source: 3~ Point release announcement template
es: 3~ Plantilla para anunciar nuevas versiones.

source: An annoucement mail for point releases can be generated using the template below and the following command:
es: Se puede generar un anuncio de nuevas veriones usando la siguiente plantilla y el siguiente comando:

source: Please check the mail carefully before sending and pass it to others for proof-reading.
es: Comprobar el correo con cuidado antes de enviarlo a otras personas para su corrección.

source: Debian Live images for Debian GNU/Linux %major% updated
es: Imágenes de Debian en vivo para Debian GNU/Linux %major% actualizadas

source: The Debian Live project is pleased to announce the availability of updated Live images for its stable distribution Debian GNU/Linux %major% (codename "%codename%").
es: El proyecto Debian Live se complace en anunciar la disponibilidad de las imágenes en vivo actualizadas para su distribución estable de Debian GNU / Linux %major% (nombre en clave "%codename%").

source: The images are available for download at:
es: Las imágenes están disponibles para su descarga en:

source: This update incorporates the changes made in the %minor% point release, which adds corrections for security problems to the stable release along with a few adjustments for serious problems. A full list of the changes may be viewed at:
es: Esta actualización incorpora las modificaciones introducidas en la nueva versión, %minor% la cual añade correcciones para problemas de seguridad a la versión estable junto con algunos ajustes para problemas graves. Se puede consultar una lista completa de los cambios en:

source: It also includes the following Live-specific changes:
es: También incluye los siguientes cambios específicos en vivo:

source: [INSERT LIVE-SPECIFIC CHANGE HERE]
es: [INSERTAR CAMBIOS ESPECÍFICOS EN VIVO AQUI]

source: [LARGER ISSUES MAY DESERVE THEIR OWN SECTION]
es: [LAS CUESTIONES MÁS IMPORTANTES PUEDEN MERECER SU PROPIA SECCIÓN]

source: Download location of updated images:
es: Sitio de descarga de imágenes actualizadas:

source: Debian Live project homepage:
es: Página principal del proyecto Debian Live

source: stable distribution information (release notes, errata etc.):
es: Información acerca de la distribución estable (notas de publicación, errores, etc.):

source: Security announcements and information:
es: Anuncios de seguridad e información

source: About Debian -------------
es: Acerca de Debian -------------

source: The Debian Project is an association of Free Software developers who volunteer their time and effort in order to produce the completely free operating system Debian GNU/Linux.
es: El Proyecto Debian es una asociación de desarrolladores de Software Libre que ofrecen voluntariamente su tiempo y esfuerzo con el fin de producir el sistema operativo libre Debian GNU / Linux.

source: About Debian Live -----------------
es: Acerca de Debian Live -----------------

source: Debian Live is an official sub-project of Debian which produces Debian systems that do not require a classical installer. Images are available for CD/DVD discs, USB sticks and PXE netbooting as well as a bare filesystem images for booting directly from the internet.
es: Debian Live es un sub-proyecto oficial de Debian que produce sistemas Debian que no requieren una instalación clásica. Las imágenes están disponibles para CD / DVD, memorias USB y arranque de red PXE, así como imágenes de un sistema de archivos básico para el arranque directamente desde Internet.

source: Contact Information -------------------
es: Información de contacto -------------------

source: For further information, please visit the Debian Live web pages at <http://live.debian.net/> or alternatively send mail to <debian-live@lists.debian.org>.
es: Para más información, visite las páginas web de Debian Live <http://live.debian.net/> o bien enviar un correo a <debian-live@lists.debian.org>.
