Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/user_customization-contents.ssi.po
Languages: ca, fr

source: :B~ Customizing contents
ca: :B~ Personalització dels continguts
fr: :B~ Personnalisation des contenus

source: 1~customizing-contents Customizing contents
ca: 1~customizing-contents Personalització dels continguts
fr: 1~customizing-contents Personnalisation des contenus

source: This chapter discusses fine-tuning customization of the live system contents beyond merely choosing which packages to include. Includes allow you to add or replace arbitrary files in your Debian Live image, hooks allow you to execute arbitrary commands at different stages of the build and at boot time, and preseeding allows you to configure packages when they are installed by supplying answers to debconf questions.
ca: Aquest capítol tracta d'afinar la personalització dels continguts del sistema en viu més enllà de simplement triar els paquets que es desitja incloure. Els «includes» permeten afegir o reemplaçar fitxers arbitraris en la imatge Debian Live, els scripts ganxo (hooks) permeten executar ordres arbitràries en diferents etapes de la construcció i en el moment d'arrencar, i la preconfiguració permet configurar paquets quan s'instaŀlen mitjançant respostes a les preguntes de debconf .
fr: Ce chapitre aborde affiner la personnalisation du contenu du système live delà du simple choix des paquets à inclure. Les includes vous permettent d'ajouter ou de remplacer des fichiers arbitraires à votre image Debian Live, les hooks vous permettent d'exécuter des commandes arbitraires à différentes étapes de la construction et au démarrage, et la préconfiguration (preseeding) vous permet de configurer les paquets quand ils sont installés en fournissant des réponses aux questions debconf .

source: While ideally a Debian live system would include files entirely provided by unmodified Debian packages, it is sometimes convenient to provide or modify some content by means of files. Using includes, it is possible to add (or replace) arbitrary files in your Debian Live image. live-build provides three mechanisms for using them:
ca: Tot i que l'ideal seria un sistema Debian Live que inclogués només fitxers proporcionats per paquets Debian sense modificació, de vegades és convenient proporcionar o modificar part del contingut a través de fitxers. Amb els includes, és possible afegir (o substituir) fitxers arbitraris en la imatge Debian Live. live-build ofereix tres mecanismes per al seu ús:
fr: Bien qu'idéalement un système Debian Live comprendrait les fichiers entièrement fournis par les paquets Debian non modifiés, on convient parfois de fournir ou de modifier certains contenus par le biais de fichiers. Avec les includes, il est possible d'ajouter (ou remplacer) des fichiers arbitraires à votre image live de Debian. live-build prévoit trois mécanismes de leur utilisation:

source: _* Chroot local includes: These allow you to add or replace files to the chroot/Live filesystem. Please see {Live/chroot local includes}#live-chroot-local-includes for more information.
ca: _* Chroot local includes: Aquests permeten afegir o substituir fitxers dintre de chroot/Live en el sistema de fitxers. Consultar {Live/chroot local includes}#live-chroot-local-includes per a més informació.
fr: _* Chroot local includes: Ils vous permettent d'ajouter ou remplacer des fichiers sur le système de fichiers chroot/Live. S'il vous plaît voir {Live/chroot local includes}#live-chroot-local-includes pour plus d'informations.

source: _* Binary local includes: These allow you to add or replace files in the binary image. Please see {Binary local includes}#binary-local-includes for more information.
ca: _* Binary local includes: Aquests et permeten afegir o substituir fitxers a la imatge binària. Consultar {Binary local includes}#binary-local-includes per a més informació.
fr: _* Binary local includes: Ils vous permettent d'ajouter ou de remplacer des fichiers dans l'image binaire. S'il vous plaît voir {Binary local includes}#binary-local-includes pour plus d'informations.

source: _* Binary includes: These allow you to add or replace Debian specific files in the binary image, such as the templates and tools directories. Please see {Binary includes}#binary-includes for more information.
ca: _* Binary includes: Aquests et permeten afegir o substituir els fitxers específics de Debian a la imatge binària, com ara les plantilles i directoris d'eines. Consultar {Binary includes}#binary-includes per a més informació.
fr: _* Binary includes: Ils vous permettent d'ajouter ou remplacer des fichiers spécifiques de Debian dans l'image binaire, comme les modèles et les répertoires d'outils. S'il vous plaît voir {Binary includes}#binary-includes pour plus d'informations.

source: Please see {Terms}#terms for more information about the distinction between the "Live" and "binary" images.
ca: Consultar {Termes}#terms per a més informació sobre la distinció entre les imatges "Live" and "binary".
fr: S'il vous plaît voir {Termes}#terms pour plus d'informations sur la distinction entre les images "Live" et "binaire".

source: Chroot local includes can be used to add or replace files in the chroot/Live filesystem so that they may be used in the Live system. A typical use is to populate the skeleton user directory (#{/etc/skel}#) used by the Live system to create the live user's home directory. Another is to supply configuration files that can be simply added or replaced in the image without processing; see {Live/chroot local hooks}#live-chroot-local-hooks if processing is needed.
ca: Es poden utilitzar els chroot local includes per afegir o reemplaçar fitxers en el sistema de fitxers chroot/Live perquè puguin ser utilitzats en el sistema en viu. Un ús típic és per omplir l'esquelet de directori d'usuari (#{/etc/skel}#)utilitzat pel sistema en viu per crear el directori home de l'usuari en viu. Un altre és el de subministrar fitxers de configuració que poden ser simplement afegits o reemplaçats en la imatge sense processar; veure{Live/chroot local hooks}#live-chroot-local-hooks si es necessita processar-los.
fr: Chroot local includes peuvent être utilisés pour ajouter ou remplacer des fichiers dans le système de fichiers chroot/Live afin qu'ils puissent être utilisés dans le système Live. Une utilisation typique est de peupler le répertoire du squelette de l'utilisateur (#{/etc/skel}#) utilisé par le système live pour créer le répertoire home de l'utilisateur Live. Une autre est de fournir des fichiers de configuration qui peuvent être simplement ajoutés ou remplacés à l'image sans traitement, voir {Live/chroot local hooks}#live-chroot-local-hooks si le traitement est nécessaire.

source: To include files, simply add them to your #{config/includes.chroot}# directory. This directory corresponds to the root directory #{/}# of the live system. For example, to add a file #{/var/www/index.html}# in the live system, use:
ca: Per incloure fitxers, només s'han d'afegir al directori #{config/includes.chroot}#. Aquest directori es correspon amb el directori arrel #{/}# del sistema en viu. Per exemple, per afegir un fitxer #{/var/www/index.html}# en el sistema en viu, fer:

source: Your configuration will then have the following layout:
ca: La configuració tindrà llavors l'estructura següent:
fr: Votre configuration aura alors le schéma suivant:

source: Chroot local includes are installed after package installation so that files installed by packages are overwritten.
ca: Els chroot local includes s'instaŀlen després de la instaŀlació del paquets de tal manera que es sobreescriuen els fitxers instaŀlats pels paquets.
fr: Chroot local includes sont installés après l'installation de paquets de sorte que les fichiers installés par les paquets sont écrasés.

source: To include material such as documentation or videos on the media filesystem so that it is accessible immediately upon insertion of the media without booting the Live system, you can use binary local includes. This works in a similar fashion to chroot local includes. For example, suppose the files #{~/video_demo.*}# are demo videos of the live system described by and linked to by an HTML index page. Simply copy the material to #{config/includes.binary/}# as follows:
ca: Per incloure material com documentació o vídeos en el sistema de fitxers dels medis de manera que sigui accessible immediatament després de la inserció dels medis sense haver de arrencar el sistema en viu, es pot utilitzar els binary local includes. Això funciona de manera similar als chroot local includes. Per exemple, si els fitxers #{~/video_demo.*}# són vídeos de demostració del sistema en viu descrits i lligats per una pàgina d'índex HTML. Només cal copiar el material a #{config/includes.binary/}# de la següent manera:
fr: Pour inclure des matériels tels que des documents ou des vidéos sur le système de fichiers des supports, afin qu'il soit accessible dès l'insertion du support sans avoir à démarrer le système live, vous pouvez utiliser binary local includes. Cela fonctionne de façon similaire aux chroot local includes. Par exemple, supposons que les fichiers #{~/video_demo.*}# sont des vidéos de démonstration du système live décrit par et lié par une page d'index HTML. Copiez simplement le matériel dans #{config/includes.binary/}# comme suit:

source: These files will now appear in the root directory of the live media.
ca: Aquests fitxers apareixeran ara en el directori arrel dels medis en viu.
fr: Ces fichiers apparaissent maintenant dans le répertoire racine du support live.

source: live-build has some standard files (like documentation) that gets included in the default configuration on every live media. This can be disabled with:
ca: live-build té alguns fitxers estàndard (com ara la documentació) que s'inclouen en la configuració per defecte de tots els medis en viu. Això es pot desactivar amb:
fr: live-build a certains fichiers standard (comme la documentation) qui sera inclus dans la configuration par défaut sur tous les supports live. Ceci peut être désactivé avec:

source: Otherwise, the material will be installed by live-build in #{/includes/}# by default on the media filesystem, or else you can specify an alternate path with #{--includes}#.
ca: En cas contrari, el material serà instaŀlat per live-build a #{/includes/}# per defecte en el sistema de fitxers dels medis o bé es pot especificar una ruta alternativa amb l'opció #{--includes}#.
fr: Sinon, le matériel sera installé par live-build dans #{/includes/}# par défaut sur le système de fichiers du support, ou bien vous pouvez spécifier un autre chemin avec

source: 2~hooks Hooks
ca: 2~hooks Scripts ganxo (Hooks)

source: Hooks allow commands to be performed in the chroot and binary stages of the build in order to customize the image.
ca: Els scripts ganxo permeten executar ordres en les etapes de la construcció chroot i binary per tal de personalitzar la imatge.
fr: Les hooks permettent à les commandes être exécutées dans les étapes chroot et binaire de la construction afin de personnaliser l'image.

source: To run commands in the chroot stage, create a hook script with a #{.chroot}# suffix containing the commands in the #{config/hooks/}# directory. The hook will run in the chroot after the rest of your chroot configuration has been applied, so remember to ensure your configuration includes all packages and files your hook needs in order to run. See the example chroot hook scripts for various common chroot customization tasks provided in #{/usr/share/live/build/examples/hooks}# which you can copy or symlink to use them in your own configuration.
ca: Per executar ordres en l'etapa chroot, crear un script ganxo al directori #{config/hooks/}# amb el sufix #{.chroot}# que contingui les ordres. El ganxo s'executarà en el chroot després que la resta de la configuració del chroot s'hagi aplicat, assegurar-se que la configuració inclou tots els paquets i els fitxers que el ganxo necessita per funcionar. Veure els scripts chroot d'exemple per a diverses tasques comunes de personalització que es poden trovar a #{/usr/share/live/build/examples/hooks}# que es poden copiar o fer un enllaç simbòlic per utilitzar-los en la configuració pròpia.
fr: Pour exécuter des commandes à l'étape chroot, créer un script hook avec le suffixe #{.chroot}# contenant les commandes dans le répertoire #{config/hooks/}#. Le hook s'exécutera dans le chroot après le reste de votre configuration chroot a été appliquée, donc n'oubliez pas de vous assurer que votre configuration inclut tous les paquets et les fichiers que votre hook a besoin pour fonctionner. Voir les exemples de scripts chroot hook pour diverses tâches courantes de personnalisation chroot fournis dans #{/usr/share/live/build/examples/hooks}# que vous pouvez copier ou symlink pour les utiliser dans votre propre configuration.

source: 3~boot-time-hooks Boot-time hooks
ca: 3~boot-time-hooks Scripts ganxo durant l'arrencada
fr: 3~boot-time-hooks Hooks au moment du démarrage

source: To execute commands at boot time, you can supply live-config hooks as explained in the "Customization" section of its man page. Examine live-config's own hooks provided in #{/lib/live/config/}#, noting the sequence numbers. Then provide your own hook prefixed with an appropriate sequence number, either as a chroot local include in #{config/includes.chroot/lib/live/config/}#, or as a custom package as discussed in {Installing modified or third-party packages}#installing-modified-or-third-party-packages.
ca: Per executar ordres durant l'arrencada, es pot proporcionar scripts ganxo live-config com s'explica a la secció "Personalització" de la seva pàgina de manual. Es poden proporcionar els ganxos de live-config a #{/lib/live/config/}#, tenint en compte la seqüència dels números. A continuació, proporcionar el script ganxo propi amb el prefix d'un número de seqüència apropiat, ja sigui com a un chroot local include a #{config/includes.chroot/lib/live/config/}#, o com un paquet personalitzat com es va discutir a {Instaŀlació de paquets modificats o de tercers}#installing-modified-or-third-party-packages.
fr: Pour exécuter des commandes au moment du démarrage, vous pouvez fournir live-config hooks comme expliqué dans la section "Personnalisation" de sa page de manuel. Examiner les hooks de live-config fournis dans #{/lib/live/config/}#, en notant les numéros de séquence. Puis fournir votre propre hook préfixée avec un numéro de séquence appropriée, soit comme un chroot local include dans #{config/includes.chroot/lib/live/config/}#, ou comme un paquet personnalisé tel que discuté dans {Installation des paquets modifiés ou de tiers}#installing-modified-or-third-party-packages.

source: To run commands in the binary stage, create a hook script with a #{.binary}# suffix containing the commands in the #{config/hooks/}# directory. The hook will run after all other binary commands are run, but before binary_checksums, the very last binary command. The commands in your hook do not run in the chroot, so take care to not modify any files outside of the build tree, or you may damage your build system! See the example binary hook scripts for various common binary customization tasks provided in #{/usr/share/live/build/examples/hooks}# which you can copy or symlink to use them in your own configuration.
ca: Per executar ordres a l'etapa binary, crear un script ganxo amb un sufix #{.binary}# que contingui les ordres al directori #{config/hooks/}#. El ganxo s'executarà després que s'executin totes les ordres de la etapa binary però avans dels binary_checksums, la darrera ordre de la etapa binary. Les ordres del ganxo no s'executen al chroot, per tant tenir cura de no modificar cap fitxer de fora del arbre de construcció, o es pot fer malbé el sistema de creació! Veure els scripts ganxo de binary per a diverses tasques comunes de personalització a #{/usr/share/live/build/examples/hooks}# que es poden copiar o fer un enllaç simbòlic per utilitzar-los en la configuració pròpia.
fr: Pour exécuter des commandes à l'étape binaire, créer un script hook avec le suffixe #{.binary}# contenant les commandes dans le répertoire #{config/hooks/}#. Le hook sera exécuté après toutes les autres commandes binaires sont exécutées, mais avant binary_checksums, les dernièrs commandes binaires. Les commandes de votre hook ne s'exécutent pas dans le chroot, afin de prendre soin de ne pas modifier les fichiers en dehors de l'arbre de construction, ou vous pourriez endommager votre système de construction! Voir les exemples de scripts hook binaires pour diverses tâches courantes de personnalisation binaires fournis dans #{/usr/share/live/build/examples/hooks}# que vous pouvez copier ou symlink pour les utiliser dans votre propre configuration.

source: 2~ Preseeding Debconf questions
ca: 2~ Preconfiguració de les preguntes de Debconf
fr: 2~ Préconfigurer questions de debconf

source: Files in the #{config/preseed/}# directory suffixed with #{.preseed}# followed by the stage (#{.chroot}# or #{.binary}#) are considered to be debconf preseed files and are installed by live-build using #{debconf-set-selections}# during the corresponding stage.
ca: Els fitxers del directory #{config/preseed/}# amb el sufix #{.preseed}# seguits del sufix de la etapa (#{.chroot}# o #{.binary}#) son considerats fitxers de preconfiguració de debconf i són instaŀlats per live-build utilitzant #{debconf-set-selections}# durant l'etapa corresponent.
fr: Les fichiers dans le répertoire #{config/preseed/}# avec le suffixe #{.preseed}# suivi de l'étape (#{.chroot}# or #{.binary}#) sont considérés comme des fichiers de préconfiguration debconf et sont installés par live-build en utilisant #{debconf-set-selections}#.

source: For more information about debconf, please see #{debconf(7)}# in the /{debconf}/ package.
ca: Per a més informació sobre debconf, veure #{debconf(7)}# del paquet /{debconf}/.

source: To include files, simply add them to your #{config/includes.chroot}# directory. This directory corresponds to the root directory (#{/}#) of the live system. For example, to add a file #{/var/www/index.html}# in the live system, use:
fr: Pour inclure des fichiers, il suffit de les ajouter à votre répertoire #{config/includes.chroot}#. Ce répertoire correspond au répertoire racine (#{/}#) du système live. Par exemple, pour ajouter un fichier #{/var/www/index.html}# dans le système live, utilisez:

source: For more information about debconf, please see debconf(7) in the #{debconf}# package.
fr: Pour plus d'informations sur debconf, s'il vous plaît voir debconf(7) dans le paquet #{debconf}#.
