Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/user_basics.ssi.po
Languages: it

source: *{Remember: Every time you install a new binary.img on the stick, all data on the stick will be lost because the partition table is overwritten by the contents of the image, so back up your extra partition first to restore again after updating the live image.}*
it: *{Ricorda: ogni volta che si installa un nuovo file binary.img sulla penna, tutti i dati sulla chiavetta saranno persi perché la tabella delle partizioni viene sovrascritta con i contenuti dell'immagine, per cui salvare prima la propria partizione extra in modo da ripristinarla dopo l'aggiornamento dell'immagine live.}*

source: 2~building-netboot-image Building a netboot image
it: 2~building-netboot-image Creare un'immagine netboot

source: The following sequence of commands will create a basic netboot image containing the Debian standard system without X.org. It is suitable for booting over the network.
it: La seguente sequenza di comandi creerà un'immagine netboot di base contenente il sistema Debian standard senza X.org. È adatta per il boot tramite rete.

source: *{Note:}* if you performed any previous examples, you will need to clean up your working directory with the #{lb clean}# command:
it: *{Nota:}* se qualcuno tra gli esempi precedenti è stato seguito, bisogna pulire la directory di lavoro con il comando #{lb clean}#:

source: Run the #{lb config}# command as follows to configure your image for netbooting:
it: Per configurare l'immagine per l'avvio da rete, eseguire il comando #{lb config}# come segue:

source: In contrast with the ISO and HDD images, netbooting does not, itself, serve the filesystem image to the client, so the files must be served via NFS. The #{--net-root-path}# and #{--net-root-server}# options specify the location and server, respectively, of the NFS server where the filesytem image will be located at boot time. Make sure these are set to suitable values for your network and server.
it: Diversamente dalle immagini ISO e HDD, il boot via rete non fornisce un'immagine del filesytem al client, perciò i file devono essere forniti via NFS. Le opzioni net-root-path e net-root-server specificano, rispettivamente, il percorso e il server del server NFS dove l'immagine del filesystem sarà situata all'avvio. Accertarsi che questi siano impostati su valori adeguati alla propria rete.

source: In a network boot, the client runs a small piece of software which usually resides on the EPROM of the Ethernet card. This program sends a DHCP request to get an IP address and information about what to do next. Typically, the next step is getting a higher level bootloader via the TFTP protocol. That could be pxelinux, GRUB, or even boot directly to an operating system like Linux.
it: In un avvio tramite rete, il client esegue una piccola parte di software che normalmente risiede sulla EPROM della scheda Ethernet. Questo programma invia una richiesta DHCP per ottenere un indirizzo IP e le informazioni su cosa fare in seguito. In genere il passo successivo è ottenere un bootloader di di livello superiore attraverso il protocollo TFTP. Questi potrebbe essere pxelinux, GRUB, o anche avviare direttamente un sistema operativo come Linux.

source: For example, if you unpack the generated #{binary-net.tar.gz}# archive in the #{/srv/debian-live}# directory, you'll find the filesystem image in #{live/filesystem.squashfs}# and the kernel, initrd and pxelinux bootloader in #{tftpboot/debian-live/i386}#.
it: Per esempio, estraendo l'archivio generato #{binary-net.tar.gz}# nella directory #{/srv/debian-live}#, si troverà l'immagine del filesystem in #{live/filesystem.squashfs}# mentre il kernel, initrd ed il bootloader pxelinux in #{tftpboot/debian-live/i386}#.

source: We must now configure three services on the server to enable netboot: the DHCP server, the TFTP server and the NFS server.
it: Per abilitare l'avvio tramite rete vanno ora configurati tre servizi:i server DHCP, TFTP e NFS.

source: 3~ DHCP server
it: 3~ Server DHCP

source: We must configure our network's DHCP server to be sure to give an IP address to the netbooting client system, and to advertise the location of the PXE bootloader.
it: Si deve configurare il server DHCP della rete per essere sicuri di fornire un indirizzo IP al sistema client che si avvia tramite rete, e notificare la posizione del bootloader PXE.

source: Here is an example for inspiration, written for the ISC DHCP server #{isc-dhcp-server}# in the #{/etc/dhcp/dhcpd.conf}# configuration file:
it: Ecco un esempio, scritto per un server DHCP ISC #{isc-dhcp-server}# nel file di configurazione #{/etc/dhcp/dhcpd.conf}#:

source: 3~ TFTP server
it: 3~ Server TFTP

source: This serves the kernel and initial ramdisk to the system at run time.
it: Fornisce al sistema il kernel e il ramdisk iniziale in fase di esecuzione.

source: You should install the /{tftpd-hpa}/ package. It can serve all files contained inside a root directory, usually #{/srv/tftp}#. To let it serve files inside #{/srv/debian-live/tftpboot}#, run as root the following command:
it: Si installi il pacchetto /{tftpd-hpa}/, che mette a disposizione tutti i file contenuti in una directory root, di solito #{/srv/tftp}#. Affinché si possa disporre dei file contenuti in #{/srv/debian-live/tftpboot}#, eseguire il seguente comando come utente root:

source: and fill in the new tftp server directory when being asked about it.
it: e inserire la nuova directory del server tftp quando viene richiesto.

source: 3~ NFS server
it: 3~ Server NFS

source: Once the guest computer has downloaded and booted a Linux kernel and loaded its initrd, it will try to mount the Live filesystem image through a NFS server.
it: Una volta che il computer ospite ha scaricato e avviato un kernel Linux e caricato il suo initrd, cercherà di montare l'immagine del filesystem Live tramite un server NFS.

source: You need to install the /{nfs-kernel-server}/ package.
it: Bisogna installare il pacchetto /{nfs-kernel-server}/.

source: Then, make the filesystem image available through NFS by adding a line like the following to #{/etc/exports}#:
it: Quindi, rendere disponibile l'immagine del filesystem via NFS aggiungendo una riga come la seguente in #{/etc/exports}#:

source: and tell the NFS server about this new export with the following command:
it: e comunicare il nuovo export al server NFS con il seguente comando:

source: Setting up these three services can be a little tricky. You might need some patience to get all of them working together. For more information, see the syslinux wiki at http://syslinux.zytor.com/wiki/index.php/PXELINUX or the Debian Installer Manual's TFTP Net Booting section at http://d-i.alioth.debian.org/manual/en.i386/ch04s05.html. They might help, as their processes are very similar.
it: Configurare questi tre servizi può essere un po' problematico. Serve un po' di pazienza per farli funzionare assieme. Per ulteriori informazioni, si veda il wiki syslinux http://syslinux.zytor.com/wiki/index.php/PXELINUX o il manuale del Debian Installer alla sezione per l'avvio TFTP da rete http://d-i.alioth.debian.org/manual/en.i386/ch04s05.html. Ciò può essere d'aiuto, considerato che il procedimento è molto simile.

source: 3~ Netboot testing HowTo
it: 3~ Come provare una netboot

source: Netboot image creation is made easy with live-build magic, but testing the images on physical machines can be really time consuming.
it: La creazione di immagini netboot è resa semplice dal potere di live-build, ma provare le immagini su una macchina reale può essere davvero dispendioso in termini di tempo.

source: To make our life easier, we can use virtualization. There are two solutions.
it: Per semplificarsi la vita, si può usare la virtualizzazione. Ci sono due soluzioni.

source: _* Install /{qemu}/, /{bridge-utils}/, /{sudo}/.
it: _* Installare /{qemu}/, /{bridge-utils}/, /{sudo}/.

source: Edit #{/etc/qemu-ifup}#:
it: Modificare #{/etc/qemu-ifup}#:

source: Get, or build a #{grub-floppy-netboot}# (in the svn).
it: Procurarsi o compilare #{grub-floppy-netboot}# (su svn).

source: Launch #{qemu}# with "#{-net nic,vlan=0 -net tap,vlan=0,ifname=tun0}#"
it: Lanciare #{qemu}# con "#{-net nic,vlan=0 -net tap,vlan=0,ifname=tun0}#"

source: _* Install VMWare Player ("free as in beer" edition)
it: _* Installare VMWare Player (edizione "free as in beer")

source: _* Create a PXETester directory, and create a text file called #{pxe.vwx}# inside
it: _* Creare una directory PXETester, e crearvi all'interno un file di testo chiamato #{pxe.vwx}#

source: _* Paste this text inside:
it: _* Vi si copi dentro questo testo:

source: _* You can play with this configuration file (e.g. change memory limit to 256)
it: _* Si può modificare a piacimento questo file di configurazione (ad esempio portando a 256 il limite della memoria)

source: _* Double click on this file (or run VMWare player and select this file).
it: _* Fare doppio click su questo file (o avviare il player VMWare e selezionare questo file).

source: _* When running just press space if that strange question comes up...
it: _* Se viene posta qualche strana domanda durante l'esecuzione premere il tasto spazio...
