Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/user_examples.ssi.po
Languages: it

source: :B~ Examples
it: :B~ Esempi

source: 1~examples Examples
it: 1~examples Esempi

source: This chapter covers example builds for specific use cases with Debian Live. If you are new to building your own Debian Live images, we recommend you first look at the three tutorials in sequence, as each one teaches new techniques that will help you use and understand the remaining examples.
it: Questo capitolo affronta alcune costruzioni di esempio per specifici casi d'uso con Debian Live. Se si è nuovi nella costruzione di immagini Debian Live, raccomandiamo di dare innanzitutto un'occhiata ai tre tutorial in sequenza, dato che ciascuno insegna nuove tecniche che aiuteranno nell'uso e nella comprensione degli esempi rimanenti.

source: 2~using-the-examples Using the examples
it: 2~using-the-examples Usare gli esempi

source: To use these examples you need a system to build them on that meets the requirements listed in {Requirements}#requirements and has live-build installed as described in {Installing live-build}#installing-live-build.
it: Per usare questi esempi è necessario un sistema per costruirveli sopra che soddisfi i requisiti elencati in {Requisiti}#requirements e avere live-build installato come descritto in {Installare live-build}#installing-live-build.

source: Note that, for the sake of brevity, in these examples we do not specify a local mirror to use for the build. You can speed up downloads considerably if you use a local mirror. You may specify the options when you use #{lb config}#, as described in {Distribution mirrors used at build time}#distribution-mirrors-build-time, or for more convenience, set the default for your build system in #{/etc/live/build.conf}#. Simply create this file and in it, set the corresponding #{LB_MIRROR_*}# variables to your preferred mirror. For example:
it: Si noti che, per brevità, in questi esempi non specifichiamo un mirror locale da usare per la costruzione. Usando un mirror locale, si possono accelerare considerevolmente i download. Si possono specificare le opzioni quando si usa #{lb config}#, come descritto in {Mirror delle distribuzioni usati in fase di compilazione}#distribution-mirrors-build-time o, più convenientemente, impostare il predefinito per il proprio sistema in #{/etc/live/build.conf}#. Si crei semplicemente questo file e si impostino in esso le corrispondenti variabili #{LB_MIRROR_*}# per il mirror desiderato. Ad esempio:

source: 2~tutorial-1 Tutorial 1: A standard image
it: 2~tutorial-1 Tutorial 1: un'immagine standard

source: *{Use case:}* Create a simple first image, learning the basics of live-build.
it: *{Caso d'uso:}* creazione di una prima semplice immagine, imparando i fondamenti di live-build.

source: In this tutorial, we will build a default ISO hybrid Debian Live image containing only base packages (no Xorg) and some Debian Live support packages, as a first exercise in using live-build.
it: In questo tutorial genereremo un'immagine ISO ibrida di Debian Live contenente solo pacchetti base (senza Xorg) e alcuni pacchetti Debian Live di supporto, come primo esercizio sull'uso di live-build.

source: You can't get much simpler than this:
it: Non può essere più semplice:

source: Examine the contents of the #{config/}# directory if you wish. You will see stored here a skeletal configuration, ready to customize or, in this case, use immediately to build a default image.
it: Esaminare i contenuti della directory #{config/}#; si noterà uno scheletro di configurazione pronto per essere personalizzato o, in questo caso, usato immediatamente per costruire un'immagine predefinita.

source: Now, as superuser, build the image, saving a log as you build with #{tee}#.
it: Ora, come super-utente, si generi l'immagine, salvando un log con #{tee}#.

source: Assuming all goes well, after a while, the current directory will contain #{binary-hybrid.iso}#. This ISO hybrid image can be booted directly in a virtual machine as described in {Testing an ISO image with Qemu}#testing-iso-with-qemu and {Testing an ISO image with virtualbox-ose}#testing-iso-with-virtualbox, or else imaged onto optical media or a USB flash device as described in {Burning an ISO image to a physical medium}#burning-iso-image and {Copying USB/HDD image to a USB stick}#copying-usb-hdd-image, respectively.
it: Presupponendo che tutto vada per il verso giusto, dopo un po' la directory corrente conterrà #{binary-hybrid.iso}#. Questa immagine ISO ibrida può essere avviata direttamente in una macchina virtuale come descritto in {Provare un'immagine ISO con Qemu}#testing-iso-with-qemu e {Provare un'immagine ISO con virtualbox-ose}#testing-iso-with-virtualbox, oppure masterizzata su un supporto ottico o ancora su una chiavetta USB come descritto rispettivamente in {Masterizzare un'immagine ISO su un supporto fisico}#burning-iso-image e {Copiare un'immagine USB/HDD su una penna USB}#copying-usb-hdd-image.

source: 2~tutorial-2 Tutorial 2: A web browser utility
it: 2~tutorial-2 Tutorial 2: servizio browser web

source: *{Use case:}* Create a web browser utility image, learning how to apply customizations.
it: *{Caso d'uso:}* creazione di un'immagine per servizio browser web, imparando come applicare le personalizzazioni.

source: In this tutorial, we will create an image suitable for use as a web browser utility, serving as an introduction to customizing Debian Live images.
it: In questo tutorial verrà creata un'immagine adatta all'uso come browser web, che serve come introduzione alla personalizzazione delle immagini Debian Live.

source: Our choice of LXDE for this example reflects our desire to provide a minimal desktop environment, since the focus of the image is the single use we have in mind, the web browser. We could go even further and provide a default configuration for the web browser in #{config/chroot_local-includes/etc/iceweasel/profile/}#, or additional support packages for viewing various kinds of web content, but we leave this as an exercise for the reader.
it: La scelta di LXDE per questo esempio riflette il desiderio di fornire un ambiente desktop minimale, dato che il punto focale dell'immagine è il singolo uso che abbiamo in mente, il browser web. Potremmo anche spingerci oltre e fornire una configurazione predefinita per il browser web in #{config/chroot_local-includes/etc/iceweasel/profile/}#, o pacchetti addizionali di supporto per la fruizione di vari tipi di contenuti web, ma lasciamo questo come esercizio per il lettore.

source: Build the image, again as superuser, keeping a log as in {Tutorial 1}#tutorial-1:
it: Si generi l'immagine, ancora come super-utente, conservando un log come in {Tutorial 1}#tutorial-1:

source: Again, verify the image is OK and test, as in {Tutorial 1}#tutorial-1.
it: Di nuovo, si verifichi che l'immagine sia a posto e la si collaudi, come in {Tutorial 1}#tutorial-1.

source: 2~tutorial-3 Tutorial 3: A personalized image
it: 2~tutorial-3 Tutorial 3: un'immagine personalizzata

source: *{Use case:}* Create a project to build a personalized image, containing your favourite software to take with you on a USB stick wherever you go, and evolving in successive revisions as your needs and preferences change.
it: *{Caso d'uso:}* creazione di un progetto per costruire un'immagine personalizzata che contiene i pacchetti preferiti da portare con sé in una chiavetta USB ovunque si vada, e che evolve in revisioni successive allorché i bisogni o le preferenze cambino.

source: Since we will be changing our personalized image over a number of revisions, and we want to track those changes, trying things experimentally and possibly reverting them if things don't work out, we will keep our configuration in the popular #{git}# version control system. We will also use the best practice of autoconfiguration via #{auto}# scripts as described in {Managing a configuration}#managing-a-configuration.
it: Dal momento che la nostra immagine personalizzata cambierà con le successive revisioni, e che vogliamo tener traccia di questi cambiamenti, andando per tentativi ed eventualmente tornando indietro se qualcosa non funziona, conserveremo la nostra configurazione nel popolare sistema di controllo di versione #{git}#. Useremo anche le migliori pratiche di auto-configurazione tramite gli script #{auto}# come descritto in {Gestire una configurazione}#managing-a-configuration.

source: 3~ First revision
it: 3~ Prima revisione

source: Edit #{auto/config}# to read as follows:
it: Modificare #{auto/config}# come segue:

source: First, #{--architecture i386}# ensures that on our #{amd64}# build system, we build a 32-bit version suitable for use on most machines. Second, we use #{--linux-flavours 686}# because we don't anticipate using this image on much older systems. Third, we've chosen the #{lxde}# package list to give us a minimal desktop. And finally, we have added two initial favourite packages: #{iceweasel}# and #{xchat}#.
it: Per prima cosa, #{--architecture i386}# assicura che sul nostro sistema #{amd64}# costruiamo una versione a 32-bit utilizzabile sulla maggior parte delle macchine. In secondo luogo, usiamo #{--linux-flavours 686}# dato che non prevediamo di usare questa immagine su sistemi troppo vecchi. Terzo, abbiamo scelto la lista di pacchetti #{lxde}# per avere un desktop minimale. Infine, abbiamo aggiunto due pacchetti preferiti per cominciare: #{iceweasel}# e #{xchat}#.

source: Now, build the image:
it: Costruire quindi l'immagine:

source: Note that unlike in the first two tutorials, we no longer have to type #{2>&1 | tee binary.log}# as that is now included in #{auto/build}#.
it: Si noti che diversamente dai primi due tutorial, non occorre più digitare #{2>&1 | tee binary.log}# dato che questo è ora incluso in #{auto/build}#.

source: Once you've tested the image (as in {Tutorial 1}#tutorial-1) and are satisfied it works, it's time to initialize our #{git}# repository, adding only the auto scripts we just created, and then make the first commit:
it: Una volta che l'immagine è stata collaudata (come in {Tutorial 1}#tutorial-1) e che si è sicuri che funzioni correttamente, è il momento di inizializzare il repository #{git}#, aggiungendo solo gli script auto appena creati, e di fare poi il primo commit:

source: 3~ Second revision
it: 3~ Seconda revisione

source: In this revision, we're going to clean up from the first build, add the #{vlc}# package to our configuration, rebuild, test and commit.
it: In questa revisione ripuliremo la prima compilazione, aggiungeremo il pacchetto #{vlc}# alla configurazione, dunque avverrà una ricompilazione, verifica e commit.

source: The #{lb clean}# command will clean up all generated files from the previous build except for the cache, which saves having to re-download packages. This ensures that the subsequent #{lb build}# will re-run all stages to regenerate the files from our new configuration.
it: Il comando #{lb clean}# ripulirà tutti i file ottenuti con la precedente generazione eccetto la cache, che ci evita un nuovo download dei pacchetti. Ciò assicura che il successivo #{lb build}# eseguirà di nuovo tutti i passaggi per rigenerare i file dalla nuova configurazione.

source: Now edit #{auto/config}# to add the #{vlc}# package:
it: Si modifichi ora #{auto/config}# per aggiungere il pacchetto #{vlc}#:

source: Build again:
it: Lanciare nuovamente la generazione:

source: Test, and when you're satisfied, commit the next revision:
it: Verificare, e quando soddisfatti, eseguire il commit della revisione successiva:

source: Of course, more complicated changes to the configuration are possible, perhaps adding files in subdirectories of #{config/}#. When you commit new revisions, just take care not to hand edit or commit the top-level files in #{config}# containing #{LB_*}# variables, as these are build products, too, and are always cleaned up by #{lb clean}# and re-created with #{lb config}# via their respective #{auto}# scripts.
it: Ovviamente sono possibili cambiamenti alla configurazione più complicati, magari aggiungendo file in sottodirectory di #{config/}#. Quando si esegue il commit di nuove revisioni, si faccia solo attenzione a non modificare manualmente o fare un commit dei file al livello superiore di #{config}# che contengono le variabili #{LB_*}#, giacché sono anche prodotti dell'assemblaggio, e che sono sempre ripuliti da #{lb clean}# e ricreati con #{lb config}# attraverso i loro rispettivi script #{auto}#.

source: We've come to the end of our tutorial series. While many more kinds of customization are possible, even just using the few features explored in these simple examples, an almost infinite variety of different images can be created. The remaining examples in this section cover several other use cases drawn from the collected experiences of users of Debian Live.
it: Siamo arrivati alla fine di questa serie di tutorial. Mentre sono possibili molti altri tipi di personalizzazioni, anche solo usando le poche caratteristiche esplorate in questi semplici esempi, può essere creata una varietà quasi infinita di immagini. Gli esempi rimanenti in questa sezione coprono diversi altri casi d'uso estrapolati dalle esperienze raccolte degli utenti Debian Live.

source: 2~ A VNC Kiosk Client
it: 2~ Un client Kiosk VNC

source: *{Use case:}* Create an image with live-build to boot directly to a VNC server.
it: *{Caso d'uso:}* creazione di un'immagine con live-build per avviare direttamente un server VNC.

source: Make a build directory and create a skeletal configuration in it built around the standard-x11 list, including #{gdm3}#, #{metacity}# and #{xtightvncviewer}#, disabling recommends to make a minimal system:
it: Creare una directory con al suo interno una configurazione scheletrica costruita sulla base dell'elenco di standard-x11, tra cui #{gdm3}#, #{metacity}# e #{xtightvncviewer}#, disabilitando i raccomandati per ottenere un sistema minimale:

source: Create the directory #{/etc/skel}# and put a custom #{.xsession}# in it for the default user that will launch metacity and start xvncviewer, connecting to port #{5901}# on a server at #{192.168.1.2}#:
it: Creare la directory #{/etc/skel}# e inserirvi un #{.xsession}# personalizzato per l'utente predefinito che lancerà metacity e avvierà xvncviewer, connesso alla porta #{5901}# su un server all'indirizzo #{192.168.1.2}#:

source: Build the image:
it: Costruire l'immagine:

source: Enjoy.
it: Buon divertimento.

source: 2~ A base image for a 128M USB key
it: 2~ Un'immagine base per una chiavetta USB da 128M

source: *{Use case:}* Create a standard image with some components removed in order to fit on a 128M USB key with space left over to use as you see fit.
it: *{Caso d'uso:}* creazione di un'immagine standard con alcuni componenti rimossi affinché possa stare su una chiavetta USB da 128M, con lo spazio che rimane da usarsi come meglio si crede.

source: When optimizing an image to fit a certain media size, you need to understand the tradeoffs you are making between size and functionality. In this example, we trim only so much as to make room for additional material within a 128M media size, but without doing anything to destroy integrity of the packages contained within, such as the purging of locale data via the #{localepurge}# package, or other such "intrusive" optimizations. Of particular note, you should not use #{--bootstrap-flavour minimal}# unless you really know what you're doing, as omitting priority #{important}# packages will most likely produce a broken live system.
it: Quando si cerca di ottimizzare un'immagine affinché sia contenuta in un supporto, è necessario capire il compromesso che si deve fare tra la dimensione e la funzionalità. In questo esempio, taglieremo solo quanto basta per far sì che il tutto stia in 128M, senza fare nient'altro che distrugga l'integrità dei pacchetti contenuti, come eliminare localizzazioni con il pacchetto #{localepurge}# o altre ottimizzazioni "intrusive". È da notare che non va usato #{--bootstrap-flavour minimal}# a meno che non si sappia cosa si sta facendo, come omettere la priorità dei pacchetti #{important}# che molto probabilmente produrrà un sistema live danneggiato.

source: Now, build the image in the usual way:
it: Costruire quindi l'immagine nel modo consueto:

source: On the author's system at time of writing, the above configuration produced a 78Mbyte image. This compares favourably with the 166Mbyte image produced by the default configuration in {Tutorial 1}#tutorial-1.
it: All'autore del sistema al momento di scrivere, la seguente configurazione ha prodotto una immagine di 78Mbyte. Comparabile favorevolmente con i 166Mbyte prodotta dalla configurazione predefinita nel {Tutorial 1}#tutorial-1.

source: The biggest space-saver here, compared to building a standard image on an #{i386}# architecture system, is to select only the #{486}# kernel flavour instead of the default #{-k "486 686"}#. Leaving off APT's indices with #{--binary-indices false}# also saves a fair amount of space, the tradeoff being that you need to #{apt-get update}# before using apt in the live system. Choosing the #{minimal}# package list leaves out the large #{locales}# package and associated utilities. Dropping recommended packages with #{--apt-recommends false}# saves some additional space, at the expense of omitting some packages you might otherwise expect to be there, such as #{firmware-linux-free}# which may be needed to support certain hardware. The remaining options shave off additional small amounts of space. It's up to you to decide if the functionality that is sacrificed with each optimization is worth the loss in functionality.
it: Ciò che salva più spazio, comparato alla costruzione di un'immagine standard su un sistema con architettura #{i386}#, è la selezione del solo kernel #{486}# invece che quello predefinito #{-k "486 686"}#. Lasciando fuori anche gli indici di APT con #{--binary-indices false}# si può salvare una certa quantità di spazio, il compromesso è usare #{apt-get update}# prima di usare apt nel sistema live. Scegliendo la lista #{minima}# dei pacchetti si esclude il grosso pacchetto #{locales}# e le utilità associate. Saltare i pacchetti raccomandati con #{--apt-recommends false}# salva altro spazio, a scapito di alcuni pacchetti che ci si aspetta di trovare, come #{firmware-linux-free}# che potrebbe servire a supportare un certo hardware. Le restanti opzioni limano altre piccole quantità di spazio. Sta a voi decidere se le funzionalità sacrificate con ciascuna ottimizzazione valgono la pena.

source: 2~ A localized KDE desktop and installer
it: 2~ Un desktop KDE localizzato e l'installer

source: *{Use case:}* Create a KDE desktop image, localized for Brazilian Portuguese and including an installer.
it: *{Caso d'uso:}* creazione di un'immagine con il desktop KDE, localizzato per il portoghese brasiliano e che includa l'installatore.

source: We want to make an iso-hybrid image for i386 architecture using our preferred desktop, in this case KDE, containing all of the same packages that would be installed by the standard Debian installer for KDE.
it: Si vuole creare un'immagine iso ibrida per architettura i386 usando il nostro desktop preferito, in questo caso KDE, contenente tutti gli stessi pacchetti che verrebbero installati dall'installatore Debian standard per KDE.

source: Our initial problem is the discovery of the names of the appropriate tasks. Currently, live-build cannot help with this. While we might get lucky and find this by trial-and-error, there is a tool, #{grep-dctrl}#, which can be used to dig it out of the task descriptions in tasksel-data, so to prepare, make sure you have both of those things:
it: Il problema iniziale è di scoprire i nomi dei task appropriati, attualmente, live-build non aiuta in questo. Si può essere fortunati o arrivarci con vari tentativi, ma c'è uno strumento #{grep-dctrl}# il quale può essere utilizzato per scavare nelle descrizioni in tasksel-data, perciò assicursi di avere entrambi questi pacchetti:

source: Now we can search for the appropriate tasks, first with:
it: Ora si possono cercare i task appropriati:

source: By this command, we discover the task is called, plainly enough, brazilian-portuguese. Now to find the related tasks:
it: Con questo comando, si è scoperto che il task si chiama, abbastanza chiaramente, brazilian-portuguese. Ora per trovare i task correlati:

source: We will use the experimental #{--language}# option, as live-build happens to include #{syslinux}# templates for pt_BR (see {Desktop and language tasks}#desktop-and-language-tasks for details). And at boot time we will generate the pt_BR.UTF-8 locale and select the pt-latin1 keyboard layout. Now let's put the pieces together:
it: Si userà l'opzione sperimentale #{--language}#, poiché live-build contempla i template #{syslinux}# per pt_BR (vedere {Task per desktop e lingua}#desktop-and-language-tasks per i dettagli). All'avvio verrà generata la lingua pt_BR.UTF-8 e selezionato pt-latin1 come layout della tastiera. Ora mettiamo insieme i pezzi:

source: Note that we have included the #{debian-installer-launcher}# package to launch the installer from the live desktop, and have also specified the 486 flavour kernel, as it is currently necessary to make the installer and live system kernels match for the launcher to work properly.
it: Si noti che è stato incluso il pacchetto #{debian-installer-launcher}# in modo da poter lanciare l'installer dal desktop della live, e che è stato anche specificato il kernel 486, dato che attualmente è necessario che il kernel dell'installer e quello del sistema live coincidano affinché il launcher funzioni correttamente.
