Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/user_customization-binary.ssi.po
Languages: ca, es, fr, it

source: :B~ Customizing the binary image
ca: :B~ Personalització de la imatge binària
es: :B~ Personalización de la imagen binaria
it: :B~ Personalizzare l'immagine binaria

source: 1~customizing-binary Customizing the binary image
ca: 1~customizing-binary Personalització de la imatge binària
es: 1~customizing-binary Personalización de la imagen binaria
fr: 1~customizing-binary Personnalisation de l'image binaire
it: 1~customizing-binary Personalizzare l'immagine binaria

source: 2~ Bootloader
ca: 2~ Carregador d'arrencada
es: 2~ Gestor de arranque
fr: 2~ Chargeur d'amorçage

source: live-build uses /{syslinux}/ and some of its derivatives (depending on the image type) as bootloaders by default. They can be easily customized in a number of ways that range from providing a full theme to only modifying some files that allow you to, for example, change the boot timeout or simply add a personalized splash image.
ca: live-build utilitza /{syslinux}/ i alguns dels seus derivats (depenent del tipus d'imatge) com carregadors d'arrencada per defecte. Es poden personalitzar fàcilment en un nombre de maneres que van des de proporcionar un tema complet a només modificar alguns fitxers que permeten, per exemple, canviar el temps d'espera d'arrencada o simplement afegir una imatge de fons personalitzada.
es: live-build utiliza /{syslinux}/ y algunos de sus derivados (en función del tipo de imagen) como gestores de arranque por defecto. Se pueden personalizar fácilmente de formas diferentes que varían desde emplear un tema completo a sólo modificar algunos ficheros que permiten, por ejemplo, cambiar el tiempo de arranque por defecto o simplemente añadir una imagen splash.
fr: live-build utilise /{syslinux}/ et certains de ses dérivés (selon le type d'image) comme chargeurs d'amorçage par défaut. Vous pouvez facilement les personnaliser de différentes façons qui vont de fournir un thème complet à seulement modifier quelques fichiers qui vous permettent, par exemple, changer le délai de démarrage ou tout simplement ajouter une image splash personnalisée.
it: live-build usa /{syslinux}/ e alcuni dei suoi derivati (a seconda del tipo di immagine) come bootloader predefiniti. Si possono facilmente personalizzare in vari modi che vanno dal fornire un tema completo per modificare solo alcuni file che vi permettono ad esempio di cambiare il timeout d'avvio o semplicemente per aggiungere un'immagine splash personalizzata.

source: In order to use a full theme, specify the #{--syslinux-theme}# option (see man #{lb_config}#). live-build will then retrieve the theme from the mirror and install it. You can also package your own theme or modify an already existing one and upload it to your local mirror.
ca: Si es vol utilitzar un tema complet es pot especificar l'opció #{--syslinux-theme}# (veure man #{lb_config}#). live-build descarregarà el tema del mirall i l'instaŀlarà. També es pot empaquetar en un .deb un tema propi o modificar-ne un ja existent i pujar-lo a un servidor local.
es: Si se quiere utilizar un tema completo se puede especificar la opción #{--syslinux-theme}# (ver man #{lb_config}#). live-build lo descargará de la réplica y lo instalará. También se puede empaquetar en un .deb un tema propio o modificar uno ya existente y subirlo a un servidor local.
fr: Si vous souhaitez utiliser un thème complet, vous pouvez spécifier l'option #{--syslinux-theme}# (voir man #{lb_config}#). live-build téléchargera le thème du miroir et l'installera. Vous pouvez également créer votre propre thème ou modifier un déjà existant et le télécharger sur votre miroir local.
it: Per cambiare un intero tema specificare l'opzione #{--syslinux-theme}# (vedere man #{lb_config}#); live-build recupera quindi il tema dal mirror e lo installa. Si può inoltre pacchettizzare il proprio o modificarne uno esistente e caricarlo sul mirror locale.

source: Imagine that you want to build a progress client but you prefer to include the server's theme because you want to have the help menu. Then you would launch #{lb config}# as follows:
es: Si se desea crear un cliente progress pero se quiere utilizar el tema del servidor que incluye el menú de ayuda. Se puede configurar como se explica a continuación:
fr: Imaginez que vous voulez construire un client progress, mais vous voulez inclure le thème du serveur parce que vous voulez avoir le menu d'aide. Ensuite, vous devez lancer #{lb config}# comme suit:
it: Si immagini di voler creare un client progress ma si preferisce includere il tema del server per avere il menù di aiuto. Si lancerà #{lb config}# come segue:

source: If you do not want to bother building a .deb, simply add your local configuration files for a default image to #{config/bootloaders/isolinux}#. Replacing "isolinux" for *{extlinux}*, *{pxelinux}* or *{syslinux}* depending on your use case.
es: Si uno no quiere preocuparse de crear un .deb, sólo tiene que añadir los ficheros de configuración local para una imagen predeterminada a #{config/bootloaders/isolinux}#. Substituyendo "isolinux" por *{extlinux}*, *{pxelinux}* o *{syslinux}* dependiendo del caso de uso.
fr: Si vous ne voulez pas vous préoccuper de la construction d'un .deb, ajoutez simplement vos fichiers de configuration locaux pour une image par défaut a #{config/bootloaders/isolinux}#. Remplaçant "isolinux" pour *{extlinux}*, *{pxelinux}* ou *{syslinux}* en fonction de votre cas d'utilisation.
it: Se non si desidera creare un .deb, aggiungere semplicemente i propri file di configurazione per un'immagine predefinita a #{config/bootloaders/isolinux}#. Sostituire "isolinux" con *{extlinux}*, *{pxelinux}* o *{syslinux}* dipende dalle necessità.

source: There is also the possibility of making smaller changes. For instance, syslinux derivatives are configured by default with a timeout of 0 (zero) which means that they will pause indefinitely at their splash screen until you press a key.
ca: També hi ha la possibilitat de fer petits canvis. Per exemple, els derivats de syslinux estan configurats per defecte amb un temps d'espera de 0 (zero) el que significa que faran una pausa indefinida en la seva pantalla inicial fins que es premi una tecla.
es: Se pueden hacer cambios más pequeños. Por ejemplo, los derivados de syslinux están configurados por defecto con un tiempo de espera de 0 (cero) lo que significa que harán una pausa indefinida en su pantalla de inicio hasta que se pulse una tecla.
fr: Il y a aussi la possibilité de faire des petits changements. Par exemple, les dérivés de syslinux sont configurés par défaut avec un timeout de 0 (zéro) qui signifie qu'ils se mettront en pause indéfiniment à leur écran de démarrage jusqu'à ce que vous pressez une touche.
it: Si può anche fare piccole modifiche. Per esempio i derivati di syslinux sono configurati con un timeout impostato a 0 (zero) in modo predefinito, significa che resteranno in pausa al loro splash screen fino a quando non si preme un tasto.

source: To modify the boot timeout of a default #{iso-hybrid}# image just edit a default *{isolinux.cfg}* file specifying the timeout in units of seconds and add it to #{config/includes.binary/isolinux/}#
ca: Per modificar el temps d'espera d'arrencada d'una imatge #{iso-hybrid}# es pot editar el fitxer *{isolinux.cfg}* per defecte especificant el temps d'espera en segons i afegir-lo a #{config/includes.binary/isolinux/}#
es: Para modificar el tiempo de espera de arranque de una imagen #{iso-hybrid}# se puede editar un fichero *{isolinux.cfg}* especificando el tiempo de espera en unidades de segundo y agregarlo a #{config/includes.binary/isolinux/}#
fr: Pour modifier le délai de démarrage d'une image iso-hybrid, vous pouvez éditer un fichier *{isolinux.cfg}* précisant le timeout dans les unités de secondes et l'ajouter à #{config/includes.binary/isolinux/}#
it: Per modificare il timeout di avvio di un'immagine #{iso-hybrid}# modificare un file *{isolinux.cfg}* predefinito specificando il timeout in unità di secondi e aggiungerlo a #{config/includes.binary/isolinux/}#

source: A modified *{isolinux.cfg}* to boot after five seconds would be similar to this:
ca: Un *{isolinux.cfg}* modificat per arrencar després de cinc segons seria semblant a aquest:
es: Un fichero *{isolinux.cfg}* modificado para arrancar después de cinco segundos sería así:
fr: Un *{isolinux.cfg}* modifié pour démarrer après cinq secondes ressemblerait à ceci:
it: Un file *{isolinux.cfg}* modificato per fare il boot dopo cinque secondi sarà simile a questo:

source: An alternative way of achieving the same goal could be writing a hook and adding it to #{config/hooks/}# Remember to add the #{.binary}# suffix to run in the binary stage. A proposed example:
ca: Una forma alternativa d'aconseguir el mateix objectiu podria ser escriure un script ganxo i afegir-lo a #{config/hooks/}#. Recordar afegir el sufix #{.binary}# per tal que s'executi durant l'etapa binary. Un exemple proposat:
es: Una forma alternativa de lograr el mismo objetivo podría ser escribiendo un script gancho y agregarlo a #{config/hooks/}#. Recordar añadir el sufijo .binary para que sea ejecutado en la etapa binary. Un ejemplo podría ser:
fr: Une autre façon d'atteindre le même objectif pourrait être écrire un hook et l'ajouter à #{config/hooks/}# N'oubliez pas d'ajouter le suffixe #{.binary}# pour l'exécuter dans l’étape binaire. Un exemple proposé:
it: Un modo alternativo per raggiungere lo stesso obiettivo potrebbe essere scrivere un hook e aggiungerlo a #{config/hooks/}# Ricordarsi di aggiungere il suffisso #{.binary}# per eseguirsi nella fase binaria. Ecco un esempio:

source: Likewise, if you want to use a personalized splash.png image, add a picture of 640x480 pixels to #{config/includes.binary/isolinux/}#
ca: De la mateixa manera, si es vol utilitzar una imatge personalitzada splash.png es pot afegir una imatge de 640x480 píxels a #{config/includes.binary/isolinux/}#
es: Del mismo modo, si se quiere usar una splash.png personalizada basta con añadir una imagen de 640x480 píxeles en #{config/includes.binary/isolinux/}#
fr: Également, si vous souhaitez utiliser une splash.png personnalisée, vous pouvez ajouter une image de 640x480 pixels à #{config/includes.binary/isolinux/}#
it: Allo stesso modo, se si vuole utilizzare un'immagine splash.png personalizzata basta aggiungerne una di 640x480 pixel a #{config/includes.binary/isolinux/}#

source: 2~ ISO metadata
ca: 2~ metadades ISO
es: 2~ Metadatos ISO
fr: 2~ Métadonnées ISO
it: 2~ Metadati ISO

source: When creating an ISO9660 binary image, you can use the following options to add various textual metadata for your image. This can help you easily identify the version or configuration of an image without booting it.
ca: Quan es crea una imatge binària ISO9660, es poden utilitzar les següents opcions per afegir diverses metadades textuals. Això pot ajudar a identificar fàcilment la versió o la configuració d'una imatge sense arrencar-la.
es: Al crear una imagen binaria ISO9660 se pueden utilizar las siguientes opciones para añadir varios metadatos textuales a la imagen. Esto puede ayudar a identificar fácilmente la versión o la configuración de una imagen sin arrancarla.
fr: En créant une image binaire ISO9660, vous pouvez utiliser les options suivantes pour ajouter différentes métadonnées textuelles pour votre image. Cela peut vous aider à facilement identifier la version ou la configuration d'une image sans la démarrer.
it: Quando si crea un'immagine binaria ISO9660, si possono usare le seguenti opzioni per aggiungere vari metadati testuali. Questo può aiutare a identificare facilmente la versione o la configurazione di un'immagine senza avviarla.

source: _* #{LB_ISO_APPLICATION/--iso-application NAME}#: This should describe the application that will be on the image. The maximum length for this field is 128 characters.
ca: _* #{LB_ISO_APPLICATION/--iso-application NAME}#: Ha de descriure l'aplicació que serà a la imatge. La longitud màxima per aquest camp és de 128 caràcters.
es: _* #{LB_ISO_APPLICATION/--iso-application NAME}#: Esto debería especificar la aplicación que estará en la imagen. La longitud máxima para este campo es de 128 caracteres.
fr: _* #{LB_ISO_APPLICATION/--iso-application NAME}#: Cela devrait décrire l'application qui sera sur l'image. Le nombre maximum de caractères pour ce champ est 128.
it: _* #{LB_ISO_APPLICATION/--iso-application NAME}#: descrive l'applicazione che sarà nell'immagine. La lunghezza massima per questo campo è di 128 caratteri.

source: _* #{LB_ISO_PREPARER/--iso-preparer NAME}#: This should describe the preparer of the image, usually with some contact details. The default for this option is the live-build version you are using, which may help with debugging later. The maximum length for this field is 128 characters.
ca: _* #{LB_ISO_PREPARER/--iso-preparer NAME}#: Ha de descriure al preparador de la imatge, en general amb algunes dades de contacte. El valor per defecte per a aquesta opció és la versió de live-build utilitzada, la qual cosa pot ajudar amb la depuració d'errors posterior. La longitud màxima per aquest camp és de 128 caràcters.
es: _* #{LB_ISO_PREPARER/--iso-preparer NAME}#: Esto debería identificar quién prepara la imagen, por lo general con algunos detalles de contacto. El valor predeterminado para esta opción es la versión de live-build que se está utilizando, lo que puede ayudar con la posterior depuración de errores. La longitud máxima para este campo es de 128 caracteres.
fr: _* #{LB_ISO_PREPARER/--iso-preparer NAME}#: Cela devrait décrire le préparateur de l'image, généralement avec certains détails de contact. Le défaut de cette option est la version de live-build que vous utilisez, ce qui peut faciliter le débogage plus tard. Le nombre maximum de caractères pour ce champ est 128.
it: * #{LB_ISO_PREPARER/--iso-preparer NAME}#: descrive il costruttore dell'mmagine, solitamente con alcuni dettagli per contattarlo. L'impostazione predefinita è la versione di live-build che si sta usando, il quale potrà essere utile in seguito per il debugging. La lunghezza massima per questo campo è di 128 caratteri.

source: _* #{LB_ISO_PUBLISHER/--iso-publisher NAME}#: This should describe the publisher of the image, usually with some contact details. The maximum length for this field is 128 characters.
ca: _* #{LB_ISO_PUBLISHER/--iso-publisher NAME}#: Ha de descriure l'editor de la imatge, en general amb algunes dades de contacte. La longitud màxima per aquest camp és de 128 caràcters.
es: _* #{LB_ISO_PUBLISHER/--iso-publisher NAME}#: Esto debería identificar quién publica la imagen, por lo general con algunos detalles de contacto. La longitud máxima para este campo es de 128 caracteres.
fr: _* #{LB_ISO_PUBLISHER/--iso-publisher NAME}#: Ce doit décrire l'éditeur de l'image, généralement avec certains détails de contact. Le nombre maximum de caractères pour ce champ est 128.
it: _* #{LB_ISO_PUBLISHER/--iso-publisher NAME}#: descrive l'editore dell'immagine, solitamente con qualche dettaglio per contattarlo. La lunghezza massima lunghezza per questo campo è di 128 caratteri.

source: _* #{LB_ISO_VOLUME/--iso-volume NAME}#: This should specify the volume ID of the image. This is used as a user-visible label on some platforms such as Windows and Apple Mac OS. The maximum length for this field is 32 characters.
ca: _* #{LB_ISO_VOLUME/--iso-volume NAME}#: Això ha d'especificar l'ID de volum de la imatge. Això s'utilitza com una etiqueta visible per l'usuari en algunes plataformes com Windows i Apple Mac OS. La longitud màxima per aquest camp és de 32 caràcters.
es: _* #{LB_ISO_VOLUME/--iso-volume NAME}#: Esto debería especificar el volumen de identificación de la imagen. Esto se utiliza como etiqueta visible para el usuario en algunas plataformas como Windows y Apple Mac OS. La longitud máxima para este campo es de 32 caracteres.
fr: _* #{LB_ISO_VOLUME/--iso-volume NAME}#: Cela devrait spécifier l'ID de volume de l'image. Il est utilisé comme une étiquette visible par l'utilisateur sur certaines plateformes comme Windows et Apple Mac OS. Le nombre maximum de caractères pour ce champ est 128.
it: _* #{LB_ISO_VOLUME/--iso-volume NAME}#: specifica l'ID del volume dell'immagine. Questa è utilizzata come etichetta visibile all'utente su alcune piattaforme, come Windows e Apple Mac OS. La lunghezza massima per questo campo è di 128 caratteri.

source: Imagine that you want to build a Progress Linux client but you prefer to include the server's theme because you want to have the help menu. Then you would launch #{lb config}# as follows:
ca: Imaginar que es vol construir un client Progress Linux però es prefereix incloure el tema del servidor, perquè es vol tenir el menú d'ajuda. S'hauria d'utilitzar #{lb config}# de la següent manera:
