Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/user_basics.ssi.po
Languages: it

source: :B~ The basics
it: :B~ Nozioni di base

source: 1~the-basics The basics
it: 1~the-basics Nozioni di base

source: This chapter contains a brief overview of the build process and instructions for using the three most commonly used image types. The most versatile image type, #{iso-hybrid}#, may be used on a virtual machine, optical media or USB portable storage device. In certain special cases, such as the use of persistence, #{hdd}# may be more suitable for USB devices. The chapter finishes with instructions for building and using a #{net}# type image, which is a bit more involved due to the setup required on the server. This is a slightly advanced topic for anyone who is not familiar already with netbooting, but is included here because once the setup is done, it is a very convenient way to test and deploy images for booting on the local network without the hassle of dealing with image media.
it: Questo capitolo contiene una breve panoramica del processo di generazione e le istruzioni per utilizzare i tre tipi di immagine più comunemente utilizzati. La tipologia di immagine più versatile, #{iso-hybrid}#, può essere usata su una macchina virtuale, supporto ottico o dispositivo di archiviazione portatile USB. In alcuni casi particolari, come l'utilizzo della persistenza, la #{hdd}# potrebbe essere più adatta per i dispositivi USB. Il capitolo termina con le istruzioni per costruire e usare un'immagine di tipo #{net}#, che è un poco più complessa a causa del setup richiesto sul server. Si tratta di un argomento leggermente avanzato per chi non ha familiarità con l'avvio da rete, ma è incluso qui perché, una volta che il setup è stato fatto, è un modo molto comodo per collaudare e distribuire immagini facendo il boot nella rete locale senza la seccatura di doversi occupare dei mezzi di divulgazione dell'immagine.

source: Throughout the chapter, we will often refer to the default filenames produced by live-build. If you are downloading a prebuilt image instead, the actual filenames may vary.
it: In tutto il capitolo faremo spesso riferimento ai nomi dei file predefiniti creati da live-build. Se si scarica invece un'immagine precompilata, i nomi possono variare.

source: 2~what-is-live What is a live system?
it: 2~what-is-live Che cos'è un sistema live?

source: A live system usually means an operating system booted on a computer from a removable medium, such as a CD-ROM or USB stick, or from a network, ready to use without any installation on the usual drive(s), with auto-configuration done at run time (see {Terms}#terms).
it: Per sistema live generalmente si intende un sistema operativo che può essere avviato da un supporto rimovibile, come un CD-ROM o una chiavetta USB oppure da una rete, pronto per l'uso senza alcuna installazione su hard disk con una configurazione automatica fatta durante l'esecuzione (vedere {Glossario}#terms).

source: With Debian Live, it's a Debian GNU/Linux operating system, built for one of the supported architectures (currently amd64, i386, powerpc and sparc). It is made from the following parts:
it: Con Debian Live, si tratta di un sistema operativo Debian GNU/Linux, generato per una delle architetture previste (attualmente amd64, i386, powerpc e sparc). È costituito dalle seguenti parti:

source: _* *{Linux kernel image}*, usually named #{vmlinuz*}#
it: _* *{Immagine del kernel Linux}*, comunemente chiamata #{vmlinuz*}#

source: _* *{Initial RAM disk image (initrd)}*: a RAM disk set up for the Linux boot, containing modules possibly needed to mount the System image and some scripts to do it.
it: _* *{Initial RAM disk image (initrd)}*: un disco RAM creato per il boot di Linux, contenente i moduli potenzialmente necessari per montare l'immagine di sistema e alcuni script per farlo.

source: _* *{System image}*: The operating system's filesystem image. Usually, a SquashFS compressed filesystem is used to minimize the Debian Live image size. Note that it is read-only. So, during boot the Debian Live system will use a RAM disk and 'union' mechanism to enable writing files within the running system. However, all modifications will be lost upon shutdown unless optional persistence is used (see {Persistence}#persistence).
it: _* *{Immagine di sistema}*: l'immagine del filesystem del sistema operativo. Normalmente è usato un filesystem compresso SquashFS, per minimizzare le dimensioni dell'immagine Debian Live. Si noti che è in sola lettura. Dunque, durante il boot il sistema Debian Live userà un disco RAM e il meccanismo 'unione' per attivare i file in scrittura all'interno del sistema in esecuzione. Ad ogni modo, tutte le modifiche verranno perse con lo spegnimento a meno che non si usi la persistenza opzionale (si veda {Persistenza}#persistence).

source: _* *{Bootloader}*: A small piece of code crafted to boot from the chosen media, possibly presenting a prompt or menu to allow selection of options/configuration. It loads the Linux kernel and its initrd to run with an associated system filesystem. Different solutions can be used, depending on the target media and format of the filesystem containing the previously mentioned components: isolinux to boot from a CD or DVD in ISO9660 format, syslinux for HDD or USB drive booting from a VFAT partition, extlinux for ext2/3/4 and btrfs partitions, pxelinux for PXE netboot, GRUB for ext2/3/4 partitions, etc.
it: _* *{Bootloader}*: una piccola porzione di codice predisposto per l'avvio dal supporto scelto, che presenta un prompt o un menu per la selezione di opzioni/configurazioni. Carica il kernel Linux ed il suo initrd da eseguire con un filesystem associato. Possono essere usate diverse soluzioni, in base al supporto di destinazione ed al formato del filesystem contenenti le componenti precedentemente citate: isolinux per il boot da CD o DVD nel formato ISO9660, syslinux per supporti HDD o USB che si avviano da una partizione VFAT, extlinux per le partizioni ext/2/3/4 e btrfs, pxelinux per il netboot PXE, GRUB per partizioni ext2/3/4, ecc.

source: You can use live-build to build the system image from your specifications, set up a Linux kernel, its initrd, and a bootloader to run them, all in one media-dependant format (ISO9660 image, disk image, etc.).
it: È possibile usare live-build per creare l'immagine di sistema secondo le proprie specifiche, scegliere un kernel Linux, il suo initrd ed un bootloader per avviarli, tutto in un unico formato che dipende dal mezzo (immagini ISO9660, immagine disco, ecc.)

source: 2~building-iso-hybrid First steps: building an ISO hybrid image
it: 2~building-iso-hybrid Primi passi: creare un'immagine ISO ibrida

source: Regardless of the image type, you will need to perform the same basic steps to build an image each time. As a first example, execute the following sequence of live-build commands to create a basic ISO hybrid image containing just the Debian standard system without X.org. It is suitable for burning to CD or DVD media, and also to copy onto a USB stick.
it: Indipendentemente dal tipo di immagine, per crearne una è necessario eseguire ogni volta la stessa procedura. Come primo esempio si eseguirà la seguente sequenza di comandi di live-build per creare un'immagine ISO ibrida di base contenente soltanto il sistema Debian standard senza X.org. È adatta per essere masterizzata su CD o DVD e anche per essere copiata su una penna USB.

source: First, run the #{lb config}# command. This will create a "config/" hierarchy in the current directory for use by other commands:
it: In primo luogo eseguire il comando #{lb config}#, il quale creerà una gerarchia "config/" nella directory corrente e che verrà utilizzata da altri comandi:

source: No parameters are passed to #{lb config}#, so defaults for all of its various options will be used. See {The lb config command}#lb-config for more details.
it: Non viene passato alcun parametro a #{lb config}#, in modo da utilizzare le impostazioni predefinite per le varie opzioni, vedere {Il comando lb config}#lb-config) per maggiori dettagli.

source: Now that the "config/" hierarchy exists, build the image with the #{lb build}# command:
it: Ora che si ha una gerarchia "config/" si può generare l'immagine con il comando #{lb build}#:

source: This process can take a while, depending on the speed of your network connection. When it is complete, there should be a #{binary.hybrid.iso}# image file, ready to use, in the current directory.
it: Questo processo può richiedere tempo, a seconda della velocità della connessione di rete. Una volta completato, nell'attuale directory ci sarà un file immagine #{binary.hybrid.iso}# pronto da usare.

source: 2~using-iso-hybrid Using an ISO hybrid live image
it: 2~using-iso-hybrid Utilizzare un'immagine ISO live ibrida

source: After either building or downloading an ISO hybrid image, which can be obtained at http://www.debian.org/CD/live/, the usual next step is to prepare your media for booting, either CD-R(W) or DVD-R(W) optical media or a USB stick.
it: Dopo aver costruito o scaricato un'immagine ISO ibrida, ottenibile all'indirizzo http://www.debian.org/CD/live/, il passo successivo è preparare il supporto per l'avvio, che sia esso un CD-R(W), un DVD-R(W) o una penna USB.

source: 3~burning-iso-image Burning an ISO image to a physical medium
it: 3~burning-iso-image Masterizzare un'immagine ISO su un supporto fisico

source: Burning an ISO image is easy. Just install wodim and use it from the command-line to burn the image. For instance:
it: Masterizzare un'immagine ISO è semplice, basta installare wodim e utilizzarlo da riga di comando; ad esempio:

source: 3~copying-iso-hybrid-to-usb Copying an ISO hybrid image to a USB stick
it: 3~copying-iso-hybrid-to-usb Copiare un'immagine ISO ibrida su una penna USB

source: ISO images prepared with the #{isohybrid}# command, like the images produced by the default #{iso-hybrid}# binary image type, can be simply copied to a USB stick with the #{dd}# program or an equivalent. Plug in a USB stick with a size large enough for your image file and determine which device it is, which we hereafter refer to as #{${USBSTICK}}#. This is the device file of your key, such as #{/dev/sdb}#, not a partition, such as #{/dev/sdb1}#! You can find the right device name by looking in #{dmesg}#'s output after plugging in the stick, or better yet, #{ls -l /dev/disk/by-id}#.
it: Le immagini ISO preparate con il comando #{isohybrid}#, come quelle prodotte in modo predefinito da #{iso-hybrid}#, possono essere semplicemente copiate su una penna USB con il programma #{dd}# o suo equivalente. Inserire una penna USB con una dimensione sufficiente a contenere l'immagine e determinare quale device sia, al quale in seguito si farà riferimento come #{${USBSTICK}}#.Questo è il device della penna, ad esempio #{/dev/sdb}#, non una partizione come #{/dev/sdb1}#! È possibile trovare il nome corretto controllando l'output di #{dmesg}# una volta inserita, o meglio ancora con il comando #{ls -l /dev/disk/by-id}#.

source: Once you are certain you have the correct device name, use the #{dd}# command to copy the image to the stick. *{This will definitely overwrite any previous contents on your stick!}*
it: Una volta che si è certi sul nome del device, usare il comando #{dd}# per copiare l'immagine sulla penna. *{Questo sovrascriverà qualsiasi dato presente su di essa!}*

source: 3~booting-live-media Booting the live media
it: 3~booting-live-media Avviare il supporto live

source: The first time you boot your live media, whether CD, DVD, USB key, or PXE boot, some setup in your computer's BIOS may be needed first. Since BIOSes vary greatly in features and key bindings, we cannot get into the topic in depth here. Some BIOSes provide a key to bring up a menu of boot devices at boot time, which is the easiest way if it is available on your system. Otherwise, you need to enter the BIOS configuration menu and change the boot order to place the boot device for the live system before your normal boot device.
it: La prima volta che si avvia il supporto live, CD, DVD, penna USB o PXE, può essere necessario impostare il BIOS del computer, ma giacché questi variano parecchio in opzioni e scorciatoie, non siamo in grado di descriverli. Alcuni BIOS offrono un menu per selezionare il device in fase di boot, in caso sia disponibile nel vostro sistema è il modo più semplice. Altrimenti è necessario accedere alla sua configurazione e modificare l'ordine di avvio per posizionare la periferica di boot del sistema live prima di quella usuale.

source: Once you've booted the media, you are presented with a boot menu. If you just press enter here, the system will boot using the default entry, #{Live}# and default options. For more information about boot options, see the "help" entry in the menu and also the live-boot and live-config man pages found within the live system.
it: Avviando il supporto si otterrà un menu, premendo il tasto enter il sistema partirà utilizzando la voce #{Live}# e le opzioni predefinite. Per ulteriori informazioni sulle opzioni di boot, si veda la voce "help" nel menu e le pagine di manuale di live-boot e live-config all'interno del sistema.

source: Assuming you've selected #{Live}# and booted a default desktop live image, after the boot messages scroll by, you should be automatically logged into the #{user}# account and see a desktop, ready to use. If you've booted a console-only image, such as #{standard}# or #{rescue}# flavour prebuilt images, you should be automatically logged in on the console to the #{user}# account and see a shell prompt, ready to use.
it: Supponendo di aver selezionato #{Live}# e avviato l'immagine desktop predefinita, dopo i messaggi di avvio si dovrebbe automaticamente accedere all'account #{user}# e avere il desktop pronto all'uso. Se invece si è avviata un'immagine per la sola console, come le preconfezionate #{standard}# o #{rescue}#, si accederà alla console dell'account #{user}# ed avere un prompt di shell pronto da usare.

source: 2~using-virtual-machine Using a virtual machine for testing
it: 2~using-virtual-machine Utilizzare una macchina virtuale per le prove

source: It can be a great time-saver for the development of live images to run them in a virtual machine (VM). This is not without its caveats:
it: Per lo sviluppo delle immagini live, può essere un notevole risparmio di tempo eseguirle in una macchina virtuale (VM). Non senza qualche raccomandazione:

source: _* Running a VM requires enough RAM for both the guest OS and the host and a CPU with hardware support for virtualization is recommended.
it: _* Eseguire una VM richiede un quantitativo sufficiente di RAM sia per il sistema ospitato che per quello ospitante; è consigliato un processore che gestisca la virtualizzazione a livello hardware.

source: _* There are some inherent limitations to running on a VM, e.g. poor video performance, limited choice of emulated hardware.
it: _* Ci sono alcune limitazioni inerenti, quali uno scarso rendimento video e una scelta limitata di hardware emulato.

source: _* When developing for specific hardware, there is no substitute for running on the hardware itself.
it: _* Quando si sviluppa per un hardware specifico non vi è alcun sostituto migliore del proprio hardware.

source: _* Occasionally there are bugs that relate only to running in a VM. When in doubt, test your image directly on the hardware.
it: _* Occasionalmente possono esserci dei bug relativi al solo utilizzo di una VM. Nel dubbio si provi l'immagine direttamente sul proprio hardware.

source: Provided you can work within these constraints, survey the available VM software and choose one that is suitable for your needs.
it: A condizione che si possa lavorare entro questi vincoli, cercare il software disponibile per la virtualizzazione e scegliere quello adatto alle proprie necessità.

source: 3~testing-iso-with-qemu Testing an ISO image with QEMU
it: 3~testing-iso-with-qemu Provare un'immagine ISO con QEMU

source: The most versatile VM in Debian is QEMU. If your processor has hardware support for virtualization, use the /{qemu-kvm}/ package; the /{qemu-kvm}/ package description briefly lists the requirements.
it: Il programma più versatile in Debian è QEMU. Se il processore gestisce la virtualizzazione hardware utilizzare il pacchetto /{qemu-kvm}/; la descrizione elenca brevemente i requisiti.

source: First, install /{qemu-kvm}/ if your processor supports it. If not, install /{qemu}/, in which case the program name is #{qemu}# instead of #{kvm}# in the following examples. The /{qemu-utils}/ package is also valuable for creating virtual disk images with #{qemu-img}#.
it: Per prima cosa installare /{qemu-kvm}/ o altrimenti /{qemu}/, nel qual caso il nome del programma nei successivi sarà #{qemu}# invece di #{kvm}#. Il pacchetto /{qemu-utils}/ è inoltre utile per creare immagini di dischi virtuali con #{qemu-img}#.

source: Booting an ISO image is simple:
it: Avviare un'immagine ISO è semplice:

source: See the man pages for more details.
it: Per maggiori dettagli si vedano le pagine di manuale.

source: 3~testing-iso-with-virtualbox Testing an ISO image with virtualbox-ose
it: 3~testing-iso-with-virtualbox Provare un'immagine ISO con virtualbox-ose

source: In order to test the ISO with /{virtualbox-ose}/:
it: Per provare la ISO con /{virtualbox-ose}/:

source: Create a new virtual machine, change the storage settings to use #{binary.hybrid.iso}# as the CD/DVD device, and start the machine.
it: Creare una nuova macchina virtuale, modificare le impostazione di archiviazione in modo da usare #{binary.hybrid.iso}# come dispositivo CD/DVD, e avviare la macchina.

source: *{Note:}* For live systems containing X.org that you want to test with /{virtualbox-ose}/, you may wish to include the VirtualBox X.org driver package, /{virtualbox-ose-guest-x11}/, in your live-build configuration. Otherwise, the resolution is limited to 800x600.
it: *{Nota:}* per sistemi live contenenti X.org che si vogliono provare con /{virtualbox-ose}/, si può voler includere il pacchetto dei driver per X.org di VirtualBox, /{virtualbox-ose-guest-x11}/, nella configurazione di live-build. In caso contrario la risoluzione è limitata a 800x600.

source: 2~building-hdd Building an HDD image
it: 2~building-hdd Creare un'immagine HDD

source: Building an HDD image is similar to ISO hybrid in all respects except you specify #{-b hdd}# and the resulting filename is #{binary.img}# which cannot be burnt to optical media. It is suitable for booting from USB sticks, USB hard drives, and various other portable storage devices. Normally, an ISO hybrid image can be used for this purpose instead, but if you have a BIOS which does not handle hybrid images properly, or want to use the remaining space on the media for some purpose, such as a persistence partition, you need an HDD image.
it: La creazione di un'immagine HDD è simile alla ISO ibrida sotto tutti gli aspetti ad eccezione della necessità di specificare l'opzione #{-b hdd}# e che il nome del file risultante è #{binary.img}# e non può essere masterizzato. È adatta per avviarsi da chiavette USB, dischi rigidi USB, e da svariati altri dispositivi di archiviazione portatili. In genere per questo scopo può essere usata un'immagine ISO ibrida, ma se si ha un BIOS che non supporta le immagini ibride, o si vuole usare lo spazio rimanente sul supporto per altri scopi, come una partizione persistente, allora occorre un'immagine HDD.

source: *{Note:}* if you created an ISO hybrid image with the previous example, you will need to clean up your working directory with the #{lb clean}# command (see {The lb clean command}#lb-clean):
it: *{Nota:}* se si è creata un'immagine ISO ibrida con gli esempi precedenti, occorre pulire la directory di lavoro con il comando #{lb clean}# (vedere {Il comando lb clean}#lb-clean):

source: Run the #{lb config}# command as before, except this time specifying the HDD image type:
it: Eseguire il comando #{lb config}# come prima, questa volta specificando però il tipo di immagine HDD:

source: Now build the image with the #{lb build}# command:
it: Si crei ora l'immagine con il comando #{lb build}#:

source: When the build finishes, a #{binary.img}# file should be present in the current directory.
it: Quando la costruzione è terminata dovrebbe essere presente un file #{binary.img}# nella directory corrente.

source: 2~using-hdd-image Using an HDD image
it: 2~using-hdd-image Utilizzare un'immagine HDD

source: The generated binary image contains a VFAT partition and the syslinux bootloader, ready to be directly written on a USB stick. Since using an HDD image is just like using an ISO hybrid image on USB, follow the instructions in {Using an ISO hybrid live image}#using-iso-hybrid, except use the filename #{binary.img}# instead of #{binary.hybrid.iso}#.
it: L'immagine binaria generata contiene una partizione VFAT e il bootloader syslinux, pronti per essere scritti direttamente su una penna USB. Dal momento che utilizzare un'immagine HDD è come utilizzare un'immagine ISO ibrida via USB, seguire le istruzioni contenute in {Utilizzare un'immagine live ISO ibrida}#using-iso-hybrid tenendo però conto che il nome del file sarà #{binary.img}# invece di #{binary.hybrid.iso}#.

source: 3~testing-hdd-with-qemu Testing an HDD image with Qemu
it: 3~testing-hdd-with-qemu Provare un'immagine HDD con Qemu

source: First, install /{qemu}/ as described above in {Testing an ISO image with QEMU}#testing-iso-with-qemu. Then run #{kvm}# or #{qemu}#, depending on which version your host system needs, specifying #{binary.img}# as the first hard drive.
it: Installare /{qemu}/ come descritto in {Provare un'immagine ISO con QEMU}#testing-iso-with-qemu; quindi eseguire #{kvm}# o #{qemu}#, a seconda di quale versione è necessaria al sistema ospitante, specificando #{binary.img}# come disco rigido principale.

source: 3~using-usb-extra-space Using the space left on a USB stick
it: 3~using-usb-extra-space Usare lo spazio rimanente su una penna USB

source: To use the remaining free space after copying #{binary.img}# to a USB stick, use a partitioning tool such as /{gparted}/ or /{parted}/ to create a new partition on the stick. The first partition will be used by the Debian Live system.
it: Per utilizzare lo spazio libero che rimane dopo aver copiato il file #{binary.img}# su una penna USB, usare uno strumento di partizionamento come /{gparted}/ o /{parted}/ per creare una nuova partizione. La prima partizione verrà utilizzata dal sistema Debian Live.

source: After the partition is created, where #{${PARTITION}}# is the name of the partition, such as #{/dev/sdb2}#, you have to create a filesystem on it. One possible choice would be ext4.
it: Dopo aver creato la partizione, dove #{${PARTITION}}# è il nome della partizione, ad esempio #{/dev/sdb2}#, si deve creare su di essa un filesystem. Una scelta possibile potrebbe essere ext4.

source: *{Note:}* If you want to use the extra space with Windows, apparently that OS cannot normally access any partitions but the first. Some solutions to this problem have been discussed on our {mailing list}#contact, but it seems there are no easy answers.
it: *{Nota:}* se si desidera utilizzare lo spazio extra con Windows pare che questo sistema operativo non possa accedere a nessuna partizione eccetto la prima. Alcune soluzioni a questo problema sono state discusse sulla nostra {mailing list}#contact, ma non sembrano esserci risposte semplici.
