Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/user_customization-overview.ssi.po
Languages: es

source: :B~ Customizing contents
es: :B~ Personalizando los contenidos

source: 1~customization-overview Customization overview
es: 1~customization-overview Un resumen de la personalización.

source: This chapter gives an overview of the various ways in which you may customize a Debian Live system.
es: Este capítulo presenta un resumen de las diversas formas en que un sistema Debian Live pueden ser personalizado.

source: 2~ Build time vs. boot time configuration
es: 2~ Tiempo de creación vs tiempo de configuración en el arranque

source: Live system configuration options are divided into build-time options which are options that are applied at build time and boot-time options which are applied at boot time. Boot-time options are further divided into those occurring early in the boot, applied by the live-boot package, and those that happen later in the boot, applied by live-config. Any boot-time option may be modified by the user by specifying it at the boot prompt. The image may also be built with default boot parameters so users can normally just boot directly to the live system without specifying any options when all of the defaults are suitable. In particular, the argument to #{lb --bootappend-live}# consists of any default kernel command line options for the Live system, such as persistence, keyboard layouts, or timezone. See {Customizing locale and language}#customizing-locale-and-language, for example.
es: Las opciones de configuración de un sistema Debian Live se pueden dividir en opciones que se tienen en cuenta en el momento de la creación de la imágen del sistema en vivo y opciones que se tendrán en cuenta cuando el sistema en vivo arranque. Estas últimas se puenden dividir a su vez en opciones que se tienen en cuenta en una etapa inicial del arranque, utilizadas por el paquete live-boot, y otras que se tienen en cuenta posteriormente y que son utilizadas por el paquete live-config. Cualquier opción en tiempo de arraque puede ser modificada por el usuario indicandola en los parámetros de arranque del kernel mediante el indicador de arranque (boot prompt). La imagen puede ser creada por defecto con los parámetros de arranque adecuados, de manera que los usuarios solamente tendrán que arrancar el sistema en vivo, directamente, sin necesidad de especificar ninguna opción adicional, ya que las opciones por defecto son las adecuadas. En particular, la opcion #{lb --bootappend-live}# permite introducir cualquier parámetro del kernel para el sistema en vivo, como pueden ser la persistencia, distribuciones de teclado, zonas horarias, etc. Ver un ejemplo en {Personalización de variantes locales e idioma}#customizing-locale-and-language.

source: Build-time configuration options are described in the #{lb config}# man page. Boot-time options are described in the man pages for live-boot and live-config. Although the live-boot and live-config packages are installed within the live system you are building, it is recommended that you also install them on your build system for easy reference when you are working on your configuration. It is safe to do so, as none of the scripts contained within them are executed unless the system is configured as a live system.
es: Las opciones de configuración en tiempo de creación se describen en la página del manual de la orden #{lb config}#. Las opciones en tiempo de arranque se describen en las páginas de manual de los paquetes live-boot y live-config. Aunque los paquetes live-boot y live-config se instalan en el sistema en vivo que se está creando, también se recomienda que sean instalados en el sistema huesped, que se utiliza para crear la imagen del sistema en vivo, con el fin de facilitar la referencia cuando se trabaja en una configuración. No hay ningún problema en hacerlo, ya que ninguno de los scripts que contienen será ejecutado, a menos que se configure el sistema huesped como sistema en vivo, cosa que no tiene sentido.

source: 2~stages-of-the-build Stages of the build
es: 2~stages-of-the-build Etapas en la creación de la imagen

source: The build process is divided into stages, with various customizations applied in sequence in each. The first stage to run is the *{bootstrap}* stage. This is the initial phase of populating the chroot directory with packages to make a barebones Debian system. This is followed by the *{chroot}* stage, which completes the construction of chroot directory, populating it with all of the packages listed in the configuration, along with any other materials. Most customization of content occurs in this stage. The final stage of preparing the live image is the *{binary}* stage, which builds a bootable image, using the contents of the chroot directory to construct the root filesystem for the Live system, and including the installer and any other additional material on the target media outside of the Live system's filesystem. After the live image is built, if enabled, the source tarball is built in the *{source}* stage.
es: El proceso de creación de la imagen está dividido en etapas en las que se aplican diferentes personalizaciones en cada una de ellas. La primera etapa que se ejecuta es la etapa *{bootstrap}*. Esta fase inicial crea y rellena el directorio chroot con paquetes que constituyen un sistema Debian básico. A continuación la etapa *{chroot}* completa la creación del directorio chroot, rellenandolo con todos los paquetes que han sido listados en la configuración y material adicional. En esta etapa se utiliza la mayoria de las personalizaciones de contenido. La etapa *{binary}* es la etapa final en la que se prepara la imagen del sistema en vivo utilizando el contenido del directorio chroot para construir el sistema de ficheros raiz del futuro sistema en vivo, se incluye el instalador y cualquier otro material adicional de la imagen que no es parte el sistema de fichero raiz, como puede ser el gestor de arranque (bootloader) o ficheros de documentación. Posteriormente, en la etapa opcional *{source}* se creará el fichero comprimido (tarball) que contiene los ficheros de código fuente de los paquetes utilizados.

source: Within each of these stages, there is a particular sequence in which commands are applied. These are arranged in such a way as to ensure customizations can be layered in a reasonable fashion. For example, within the *{chroot}* stage, preseeds are applied before any packages are installed, packages are installed before any locally included files or patches are applied, and hooks are run later, after all of the materials are in place.
es: En cada una de estas etapas hay una secuencia particular en la se aplican las acciones a realizar. Estas acciones son organizadas en forma de capas de tal manera que aseguran la personalización de una manera razonable. Por ejemplo, dentro de la etapa *{chroot}*, los preseeds se aplican antes que cualquier paquete sea instalado, los paquetes son instalados antes de incluir localmente ningún fichero o antes de aplicar cualquer parche y los scripts de gancho (scripts hooks) serán ejecutados al final de todo, una vez que todos los materiales estan ubicados en su lugar.

source: 2~ Supplement lb config with files
es: 2~ Opciones para lb config en ficheros

source: Although #{lb config}# does create a skeletal configuration in the config/ directory, to accomplish your goals, you may need to provide additional files in subdirectories of config/. Depending on where the files are stored in the configuration, they may be copied into the live system's filesystem or into the binary image filesystem, or may provide build-time configurations of the system that would be cumbersome to pass as command-line options. You may include things such as custom lists of packages, custom artwork, or hook scripts to run either at build time or at boot time, boosting the already considerable flexibility of debian-live with code of your own.
es: Aunque la orden #{lb config}# crea un esqueleto de configuración en el directorio config/, quizas sea necesario escribir ficheros de configuración adicionales dentro de la jerarquia de subdirectorios de config/ con el fin de alcanzar los fines propuestos. En el proceso de creación de la imagen estos ficheros adicionales serán copiados o en el sistema de ficheros que se utilizará en el sistema en vivo, o en el sistema de ficheros de la propia imagen binaria o quizas podrán suministrar opciones de configuracion al sistema en vivo que sería incomodo pasar en la línea de parámetros del kernel. Esto dependerá de en que parte de la jerarquia de subdirectorios de config/ se copian estos ficheros. Se puede incluir cosas como listas de paquetes personalizadas, imágenes gráficas personalizadas o scripts de gancho (scripts hook) para ejecutar o en el momento de creación de la imagen o en el momento de arranque del sistema en vivo, aumentando la, ya por otra parte considerable, flexibilidad de Debian Live con código creado ex profeso.

source: 2~ Customization tasks
es: 2~ Tareas de personalización

source: The following chapters are organized by the kinds of customization task users typically perform: {Customizing package installation}#customizing-package-installation, {Customizing contents}#customizing-contents and {Customizing locale and language}#customizing-locale-and-language cover just a few of the things you might want to do.
es: Los siguientes capítulos se organizan por tareas de personalización que el usuario realiza típicamente: Los capítulos de {Personalización de la instalación de paquetes}#customizing-package-installation, {Personalización de contenidos}#customizing-contents y {Personalización de variantes locales e idioma}#customizing-locale-and-language cubre solamente unas pocas de estas tareas que pueden realizarse.
