Repository: Acidburn0zzz/live-manual
Catalog: manual/po/*/user_customization-installer.ssi.po
Languages: ca

source: :B~ Customizing Debian Installer
ca: :B~ Personalització de l'instaŀlador de debian

source: 1~customizing-installer Customizing Debian Installer
ca: 1~customizing-installer Personalització de l'instaŀlador de debian

source: Live system images can be integrated with Debian Installer. There are a number of different types of installation, varying in what is included and how the installer operates.
ca: Les imatges del sistema en viu es poden integrar amb l'instaŀlador de Debian. Hi ha un nombre de diferents tipus d'instaŀlació, que varien en el que s'inclou i en com opera l'instaŀlador.

source: Please note the careful use of capital letters when referring to the "Debian Installer" in this section - when used like this we refer explicitly to the official installer for the Debian system, not anything else. It is often seen abbreviated to "d-i".
ca: Tenir en compte l'ús acurat de les lletres majúscules quan es refereix a "l'instaŀlador de Debian" en aquesta secció - quan s'utilitza així ens referim explícitament a l'instaŀlador normal del sistema Debian, i no a una altra cosa. Es veu sovint abreujat com "d-i".

source: 2~ Types of Debian Installer
ca: 2~ Tipus d'instaŀlador de Debian

source: The three main types of installer are:
ca: Els tres principals tipus d'instaŀlador són els següents:

source: *{"Normal" Debian Installer}*: This is a normal live system image with a separate kernel and initrd which (when selected from the appropriate bootloader) launches into a standard Debian Installer instance, just as if you had downloaded a CD image of Debian and booted it. Images containing a live system and such an otherwise independent installer are often referred to as "combined images".
ca: *{Instaŀlador de Debian "Normal"}*: Aquesta és una imatge normal de sistema en viu amb un nucli i initrd independents que (quan es seleccionen des del carregador d'arrencada adequat) realitzen una instaŀlació estàndard de Debian, igual que si s'hagués descarregat i arrencat una imatge de Debian des d'un CD. Les imatges que contenen un sistema viu i aquest tipus d'instaŀlador independent s'anomenen sovint "imatges combinades".

source: On such images, Debian is installed by fetching and installing .deb packages using /{debootstrap}/, from local media or some network-based network, resulting in a default Debian system being installed to the hard disk.
ca: Amb aquest tipus d'imatges, Debian s'instaŀla descarregant i instaŀlant paquets .deb mitjançant /{debootstrap}/, des dels medis locals o alguna xarxa, aixó resulta en un sistema Debian per defecte instaŀlat al disc dur.

source: This whole process can be preseeded and customized in a number of ways; see the relevant pages in the Debian Installer manual for more information. Once you have a working preseeding file, live-build can automatically put it in the image and enable it for you.
ca: Tot aquest procés pot ser preconfigurat i personalitzadat de moltes formes, veure les pàgines corresponents al manual de l'instaŀlador de Debian per a més informació. Quan es té un fitxer de preconfiguració que funcioni, live-build pot posar-lo automàticament a la imatge i activar-lo.

source: *{"Live" Debian Installer}*: This is a live system image with a separate kernel and initrd which (when selected from the appropriate bootloader) launches into an instance of the Debian Installer.
ca: *{Instaŀlador de Debian "Live"}*: Aquesta és una imatge en viu amb un nucli i initrd independents que (quan es seleccionen des del carregador d'arrencada adequat) llancen un instaŀlador de Debian.

source: Installation will proceed in an identical fashion to the "normal" installation described above, but at the actual package installation stage, instead of using /{debootstrap}/ to fetch and install packages, the live filesystem image is copied to the target. This is achieved with a special udeb called live-installer.
ca: La instaŀlació continuarà de forma idèntica a l'instaŀlació que s'ha descrit anteriorment, però en la fase d'instaŀlació dels paquets, en lloc d'utilitzar /{debootstrap}/ per a buscar-los i instalar-los, es copia el sistema de fitxers viu a la destinació. Això s'aconsegueix amb un udeb especial anomenat live-installer.

source: After this stage, the Debian Installer continues as normal, installing and configuring items such as bootloaders and local users, etc.
ca: Després d'aquesta etapa, l'instaŀlador de Debian continua de forma normal, instaŀlant i configurant elements com ara els gestors d'arrencada i els usuaris locals, etc

source: *{Note:}* to support both normal and live installer entries in the bootloader of the same live medium, you must disable live-installer by preseeding #{live-installer/enable=false}#.
ca: *{Nota:}* per a donar suport a les entrades de l'instaŀlador normal i live en el gestor d'arrencada del mateix medi s'ha de desactivar el live-installer mitjançant la preconfiguració #{live-installer/enable=false}#.

source: *{"Desktop" Debian Installer}*: Regardless of the type of Debian Installer included, #{d-i}# can be launched from the Desktop by clicking on an icon. This is user friendlier in some situations. In order to make use of this, the debian-installer-launcher package needs to be included.
ca: *{Instaŀlador de Debian "d'escriptori"}*: Independentment del tipus d'instaŀlador de Debian inclòs, es pot iniciar el #{d-i}# des de l'escriptori fent clic damunt una icona. Aixó és senzill per a l'usuari però perquè funcioni s'ha d'afegir el paquet debian-installer-launcher.

source: Note that by default, live-build does not include Debian Installer images in the images, it needs to be specifically enabled with #{lb config}#. Also, please note that for the "Desktop" installer to work, the kernel of the live system must match the kernel #{d-i}# uses for the specified architecture. For example:
ca: Tenir en compte que, per defecte, live-build no inclou imatges de l'instaŀlador de Debian en les imatges, ha de ser específicament activat amb #{lb config}#. A més, tenir en compte que per a que funcioni l'instaŀlador "d'escriptori" el nucli del sistema viu ha de coincidir amb el nucli que el #{d-i}# utilitza per a l'arquitectura especificada. Per exemple:

source: 2~ Customizing Debian Installer by preseeding
ca: 2~ Personalització de l'instaŀlador de Debian amb preconfiguració

source: As described in the Debian Installer Manual, Appendix B at http://www.debian.org/releases/stable/i386/apb.html, "Preseeding provides a way to set answers to questions asked during the installation process, without having to manually enter the answers while the installation is running. This makes it possible to fully automate most types of installation and even offers some features not available during normal installations." This kind of customization is best accomplished with live-build by placing the configuration in a #{preseed.cfg}# file included in #{config/debian-installer/}#. For example, to preseed setting the locale to #{en_US}#:
ca: Com es descriu en el Manual de l'instaŀlador de Debian, a l'apèndix B a http://www.debian.org/releases/stable/i386/apb.html, "la preconfiguració proporciona una manera de respondre a les preguntes durant la instaŀlació, sense haver d'introduir les respostes manualment mentre la instaŀlació està en curs. Això permet automatitzar completament la majoria dels tipus d'instaŀlacions i fins i tot ofereix algunes característiques no disponibles durant les instaŀlacions normals." Aquest tipus de personalització s'aconsegueix millor amb live-build coŀlocant la configuració en un fitxer #{preseed.cfg}# a #{config/debian-installer/}#. Per exemple, per a preconfigurar la variant local #{en_US}#:

source: 2~ Customizing Debian Installer content
ca: 2~ Personalitzar el contingut de l'instaŀlador de Debian
