Repository: Acidburn0zzz/live-manual
Catalog: po4a/*/basics.xml.po
Languages: fr

source: The basics
fr: Les principes

source: This chapter contains a brief overview of the build process as well as containing instructions on how to boot the various binary image types.
fr: Ce chapitre contient un bref aprçu du processus de création ainsi que des instructions sur la méthode de démarrage des différents types d'images

source: What is a live system?
fr: Qu'est-ce qu'un système live

source: A live system usually means an OS booted on a computer from a removable support (as CD-ROM, USB stick, or network), ready to use without any installation on the usual drive(s), with an auto-configuration done at runtime (see <xref linkend="terms"/>).
fr: Un système live désigne le plus souvent un Système d'Exploitation démarré sur une machine depuis un support amovible (comme un CD-ROM, une clef USB, ou depuis le réseau), prêt à l'emploi sans installation sur le(s) disque(s) traditionnel, avec une configuration automatique faite pendant le démarrage (voir <xref linkend="terms"/>).

source: With Debian Live, it's a Debian GNU/Linux OS, built for one of the supported architectures (currently amd64, i386, powerpc and sparc). It is made from following parts:
fr: Avec Debian Live, c'est un système d'exploitation Debian GNU/Linux, construit pour l'une des achitectures supportées (actuellement amd64, i386, powerpc, et sparc). Il est construit à partir des composants suivants:

source: Linux kernel
fr: Noyau Linux

source: The Linux image, usually named <filename>vmlinuz*</filename>.
fr: L'image du noyau Linux, habituellement nommée <filename>vmlinuz*</filename>.

source: RAM disk setup for the Linux boot, containing modules possibly need to mount the filesystem's image and some scripts to do it.
fr: Configuration de la RAM disque pour le démarrage de Linux, contenant les modules qui pourraient être nécessaire pour monter l'image du système de fichiers et plusieurs scripts pour le faire

source: System image
fr: L'image du système

source: The O.S. image. Debian Live uses a SquashFS image, a compressed filesystem, to minimize its size. Note that it's read-only, so during boot, the Debian Live system will uses RAM disk and 'union' mechanism to be able to write files on the system, but all modifications will be lost when shutdown, until using optional persistence partition(s) (see <xref linkend="persistence"/>).
fr: L'image du système d'exploitation Debian Live utilise une image Squashfs, un système de fichiers compressé, pour diminuer sa taille. Noter qu'il est en lecture seule, donc pendant la phase de démarrage, le système Debian Live utilisera la RAM comme un disque et un mechanisme d'union pour pouvoir écrire des fichiers sur le système, mais toutes les modifitions seront perdues à l'arrêt de la machine à moins d'utiliser une(des) partition(s) optionnelle(s) pour la persistence.(voir <xref linkend="persistence"/>).

source: Bootloader
fr: Chargeur de démarrage

source: A small piece of code, crafted to boot up from the chosen media, possibly proposing a prompt or menu to let select options/configuration, then loading the Linux kernel and its initrd to let it run with associated filesystem image. Different solutions can be proposed depending of the target media and fornat of filesystem containing the previous components: Isolinux to boot from a CD or DVD in ISO9660 format, syslinux for HDD or USB drive boot from a VFAT partition, GRUB for ext2/3 partition, pxelinux for PXE netboot...
fr: Un petit morceau de code destiné à démarrer depuis le média choisi, il peut proposer une invite ou un menu pour selectionner des options, une configuration, puis il doit charger le noyau Linux et son initrd pour pouvoir utiliser l'image de système de fichiers associée à ce dernier. Différentes solutions peuvent être proposées, elles dépendent du média cible et du format du système de fichiers contenant les composants précédents: Isolinux pour démarrer depuis un CD ou un DVD au format ISO9660, syslinux pour démarrer depuis les disques durs ou les clefs USB contenant une partition vfat, GRUB pour les partitions ext2/3, pxelinux pour un démarrage réseau PXE...

source: The Debian Live tools will build the system image from your specifications, setup a Linux kernel and its initrd, a bootloader to run them, all in one media-dependant format(ISO9660 image, disk image, ...).
fr: Les outils de Debian Live construiront l'image du système en fonction de vos spécifications, configuration du noyau Linux et son initrd, un chargeur de démarrage pour les exécuter, tout ces composants dependent du format du media choisi(image ISO9660, image disque, ...).

source: First steps: building an ISO image
fr: Premiers pas: Construire une image ISO

source: The following sequence of helper commands, provided by &live-helper;, will create a basic ISO image containing just the Debian standard system without X.org. It is suitable for burning to CD or DVD media.
fr: La séquence suivante de l'assistant de commandes fournit par &live-helper; créera une image ISO basique contenant uniquement le système Debian standard sans X.org. Elle peut être gravée sur un CD ou un DVD.

source: First, we run the <filename>lh_config</filename> helper command which will create a <filename>"config/"</filename> hierarchy in the current directory for use by other helper commands:
fr: D'abord on exécute la commande <filename>lh_config</filename> de l'assistant qui créée une arborescence <filename>"config/"</filename> dans le répertoire courant pour une utilisation ultérieure par d'autres commandes de l'assistant:

source: By passing no parameters to <filename>lh_config</filename>, we indicated that we wish to use the defaults, which will create an image of type binary (see <xref linkend="lh_config"/>).
fr: En ne passant aucun paramètres à <filename>lh_config</filename>, on choisit d'utiliser les paramètres par défauts qui créeront une image de type binaire (voir <xref linkend="lh_config"/>).

source: Now that we have a <filename>"config/"</filename> hierarchy, we may build the image with <filename>lh_build</filename> helper command:
fr: Maintenant que l'on a une arborescence <filename>"config/"</filename>, on devrait pouvoir construire une image avec la commande <filename>lh_build</filename> de l'assistant:

source: This process can take a while, depending on the speed of your network connection (see <xref linkend="lh_build"/>).
fr: Ce processus peut prendre du temps, en fonction du débit de votre connexion réseau (voir <xref linkend="lh_build"/>).

source: Testing an ISO image with Qemu
fr: Tester une image ISO avec Qemu

source: Testing an ISO is simple:
fr: Tester une image ISO est facile

source: Burning an ISO image to physical medium
fr: Graver une image ISO sur un support physique

source: Burning an ISO image is easy:
fr: Graver une imgae ISO est simple

source: Building an USB/HDD image
fr: Construire une image USB/HDD

source: The following sequence of helper commands will create a basic USB/HDD image containing just the Debian standard system without X.org. It is suitable for booting from USB sticks, USB hard drives, and various other portable storage devices.
fr: La séquence de commandes suivantes de l'assistant créera une image USB/HDD contenant uniquement le système Debian standard sans X.org. Elle peut être utilisée pour démarrer depuis une clef USB, une disque dur USB, ainsi que d'autres types variés de périphériques de stockage amovibles.

source: Note if you created an iso image with the previous example, you will need to clean up your working directory with the <filename>lh_clean</filename> helper command (see <xref linkend="lh_clean"/>):
fr: Noter que si l'on a créé une image avec l'exemple précédent, on doit nettoyer le répertoire de travail avec la commande <filename>lh_clean</filename> de l'assistant (voir <xref linkend="lh_clean"/>).

source: Run the <filename>lh_config</filename> helper command with the parameters to configure the <filename>"config/"</filename> hierarchy to create a USD/HDD image type:
fr: Exécuter la commande <filename>lh_config</filename> de l'assistant avec ces paramètres pour configurer l'arborescence <filename>"config/"</filename> afin de créer une image de type USB/HDD:

source: Now build the image with <filename>lh_build</filename> helper command:
fr: Maintenant construire l'image avec la commande <filename>lh_build</filename> de l'assistant

source: Copying USB/HDD image to a USB stick
fr: Copier une image USB/HDD sur une clef USB

source: The generated binary image contains a
fr: L'image binaire générée contient une partition

source: partition and the <command>syslinux</command> bootloader, ready to be directly written on an USB stick. Plug in an USB stick with a size larger than <filename>binary.img</filename>'s one, and type:
fr: et le chargeur de démarrage <command>syslinux</command>, prêt à être directement écrit sur une clef USB. Brancher une ckef USB d'une taille supérieure à celle du fichier <filename>binary.img</filename>, et taper:

source: where <replaceable>${USBSTICK}</replaceable> is the device file of your key, like <filename>/dev/sda</filename> (not a partition like <filename>/dev/sda1</filename>!); you can find the right device name by looking in <command>dmesg</command>'s output after plugging the stick, for example).
fr: Où <replaceable>${USBSTICK}</replaceable> est le fichier descripteur de périphérique de votre clef, comme <filename>/dev/sda</filename> (pas une partition comme <filename>/dev/sda1</filename>!); on peut trouver le fichier descripteur de périphérique adéquat en regardant la sortie de la commande <command>dmesg</command> après avoir branché la clef par exemple)

source: Testing a USB/HDD image with Qemu
fr: Tester une image USB/HDD avec Qemu

source: Building a netboot image
fr: Construire une image démarrable depuis le réseau

source: The following sequence of helper commands will create a basic netboot image containing the Debian standard system without X.org. It is suitable for booting over the network.
fr: La séquence de commandes suivante de l'assistant créera une image basique pour un démarrage réseau contenant uniquement le système Debian standard sans X.org. Elle peut être utilisée pour démarrer depuis le réseau.

source: Note if you performed any previous examples, you will need to clean up your working directory with the <filename>lh_clean</filename> helper command:
fr: Noter que si l'on a réalisé l'un ou l'autre des exemples précédents, on doit nettoyer le répertoire de travail avec la commande <filename>lh_clean</filename> de l'assistant:

source: Run the <filename>lh_config</filename> helper command with the parameters to configure the <filename>"config/"</filename> hierarchy to create our netboot image:
fr: Exécuter la commande <filename>lh_config</filename>de l'assistant avec les paramètres suivants pour configurer l'arborescence <filename>"config/"</filename> afin de créer une image pour un démarrage réseau:

source: In contrast with the ISO and USB hdd images, netbooting does not support serving a filesystem image with the client so the files must be served via NFS. The <replaceable>net-root-path</replaceable> and <replaceable>net-root-server</replaceable> options specify the location and server respectfully of the NFS server where the filesytem image will be located at boot-time.
fr: A l'inverse des images USB/HDD ou ISO, le démarrage depuis le réseau ne permet pas de donner une image de système de fichiers au client, les fichiers doivents être fournis par NFS. Les options <replaceable>net-root-path</replaceable> et <replaceable>net-root-server</replaceable> spécifient respectivement l'emplacement et le serveur NFS où trouver l'image du système de fichiers pendant la phase de démarrage.

source: In a network boot, the client runs a small piece of software, usually on the
fr: Lors d'un démarrage réseau, le client exécute un petit morceau de code habituellement sur l'

source: of the Ethernet card, which sends a
fr: de la carte Ethernet, qui envoie une requête

source: request to get an
fr: pour obtenir une adresse

source: address and also information about what to do next; such as getting (through
fr: ainsi que des informations sur ce qui doit être fait après; comme obtenir (via le protocole

source: protocol) a higher level boot software like <application>Grub</application> or <application>PXLINUX</application>, or directly to an operating system like <application>Linux</application>.
fr: ) un logiciel de démarrage de plus haut niveau comme <application>Grub</application> ou <application>PXLINUX</application>, ou directement un système d'exploitation comme <application>Linux</application>.

source: For example, you can extract the generated <filename>binary-net.tar.gz</filename> archive in the <filename>/srv/debian-live</filename> directory; you'll get the filesystem image in <filename>live/filesystem.squashfs</filename>, the kernel, initrd and PXE Linux bootloader in <filename>tftpboot/debian-live/i386</filename>.
fr: Par exemple, vous pouvez extraire l'archive <filename>binary-net.tar.gz</filename> dans le répertoire<filename>/srv/debian-live</filename>; vous aurez l'image du système de fichiers dans le fichier <filename>live/filesystem.squashfs</filename>, le noyau, initrd et le chargeur de démarrage PXE Linux dans le répertoire<filename>tftpboot/debian-live/i386</filename>.

source: We must now configure three services on the server:
fr: Nous devons maintenant configurer trois services sur le serveur:

source: DHCP server
fr: Le serveur DHCP

source: We must configure our network's DHCP server to be sure to give a
fr: Nous devons configurer le serveur DHCP de notre réseau pour être sure de délivrer une

source: address to the computer netbooting, and to advertise the location of the PXE bootloader.
fr: adresse à l'ordinateur qui démarre depuis le réseau et pour publier l'emplacement du programme de démarrage PXE.

source: Here is an example for inspiration, written for the ISC DHCP server (package <literal>dhcp3-server</literal>) in the <filename>/etc/dhcp3/dhcpd.conf</filename> configuration file :
fr: Voici un exemple dont on peut s'inspirer, écrit pour le serveur ISC DHCP (paquet <literal>dhcp3-server</literal>) dans le fichier de configuration <filename>/etc/dhcp3/dhcpd.conf</filename>:

source: TFTPd server
fr: Serveur TFTPd

source: This serves the kernel and initial ramdisk to the system at run-time.
fr: Il fournit le noyau et la ramdisk initiale au système pendant l'e

source: You should install the <command>tftpd-hpa</command> package. It can serve all files contained inside a root directory, usually <filename>/var/lib/tftpboot/</filename>, as defined with its
fr: Vous devriez installer le paquet <command>tftpd-hpa</command>. Il peut fournir tous les fichiers contenus dans un répertoire racine, habituellement <filename>/var/lib/tftpboot/</filename>, défini par l'option

source: option. To let it serves files inside <filename>/srv/debian-live/tftpboot</filename>, modify its start definition in <filename>/etc/inetd.conf</filename> with:
fr: Pour lui faire fournir les fichiers contenus dans <filename>/srv/debian-live/tftpboot</filename>, modifier sa commande de démarrage dans <filename>/etc/inetd.conf</filename> par:

source: and reload the super server with <command>/etc/init.d/openbsd-inetd reload</command>.
fr: et relancer le super server avec <command>/etc/init.d/openbsd-inetd reload</command>.

source: NFS server
fr: Serveur NFS

source: Once the guest computer will have downloaded and booted a Linux kernel and its initrd, it will try to mount the Live filesystem image through a NFS server.
fr: Une fois que la machine cliente a téléchargé et démarré le noyau Linux et sa ramdisk, elle essaie de monter l'image du système de fichiers Live via un serveur NFS.

source: You should install the <command>nfs-kernel-server</command> server package -- <command>nfs-user-server</command> does not function correctly with netboot.
fr: Vous devriez installer le paquet <command>nfs-kernel-server</command> --<command>nfs-user-server</command> ne fonctionne pas correctement pour le démarrage réseau.

source: Then, declare that the directory of the filesystem image is available through NFS, by writing in <filename>/etc/exports</filename> :
fr: Après, rendez le répertoire de l'image du système de fichiers disponible via NFS en ajoutant au fichier <filename>/etc/exports</filename>:

source: and let the NFS server knowing it typing following command :
fr: informez le serveur NFS en tapant la commande suivante:

source: Setting all these services is quite error prone, you'll need some patience to let all of them working together.
fr: Configurer tout ces services peut être source d'erreurs, vous aurez besoin de patience pour qu'il fonctionnent tous ensemble.
