Repository: Acidburn0zzz/live-manual
Catalog: po4a/*/resources.xml.po
Languages: fr

source: Resources and links
fr: Ressources et Liens

source: Links
fr: Liens

source: <ulink url="http://www.debian.org/">Debian homepage</ulink>
fr: <ulink url="http://www.debian.org/">Page de démarrage Debian</ulink>

source: Who is using Debian Live?
fr: Qui utilise Debian Live?

source: A number of projects are using Debian Live:
fr: Un certain nombre de projets utilisent Debian Live:

source: <ulink url="http://www.gnewsense.org/">gNewSense</ulink> "forked" a very early live-package
fr: <ulink url="http://www.gnewsense.org/">gNewSense</ulink> "dérive" une des premières versions d live-package.

source: <ulink url="http://livecd.gnustep.org/">GNUSTEP Live CD</ulink> using live-package
fr: <ulink url="http://livecd.gnustep.org/">GNUSTEP Live CD</ulink> utilise live-package

source: <ulink url="http://www.keshi.org/moin/moin.cgi/PS3/Debian/Live">PlayStation 3 Live CD</ulink> using live-package
fr: <ulink url="http://www.keshi.org/moin/moin.cgi/PS3/Debian/Live">PlayStation 3 Live CD</ulink> utilise live-package

source: <ulink url="http://www.sidux.org/">Sidux Live CD</ulink> "forked" an early live-package
fr: <ulink url="http://www.sidux.org/">Sidux Live CD</ulink> "dérive" une des premières versions d live-package.

source: <ulink url="http://clonezilla.sourceforge.net/">Clonezilla</ulink> (system image distributer)
fr: <ulink url="http://clonezilla.sourceforge.net/">Clonezilla</ulink> (système de distribution d'images)

source: <ulink url="http://pareto.uab.es/mcreel/PelicanHPC/">PelicanHPC</ulink> uses &live-helper;
fr: <ulink url="http://pareto.uab.es/mcreel/PelicanHPC/">PelicanHPC</ulink> utilise &live-helper;

source: IES S'Arenal, Llucmajor (Secondary school located near to Palma de Mallorca), Spain.
fr: IES S'Arenal, Llucmajor (École secondaire située près de Palma de Majorque), Espagne.
